[
  {
    "model": "lectures.lecture",
    "fields": {
      "thumbnail": "https://cdn.inflearn.com/public/courses/329963/cover/d2bd8295-0f8c-4947-9555-68785b871a67/329963-original.png",
      "lectureTitle": "[인프런x코드캠프] 부트캠프에서 만든 고농축 프론트엔드 코스\n대시보드",
      "lectureFee": 396000,
      "lectureDescription": "입문자를 위해 준비한\n[프론트엔드, 웹 개발] 강의입니다.\n1년간 300여명의 개발자를 배출한 ‘진짜’ 부트캠프의 고농축 커리큘럼 입니다. 이 강의 하나로 여러분은 현업 주니어 개발자 수준까지 성장 가능하며, 프론트엔드 기술스택의 활용 능력과 지식을 얻게 될거에요. 누구나 사회적, 경제적, 교육적 배경에 상관없이 커리어를 쌓을 수 있도록, [인프런X코드캠프]가 준비했습니다 :)\n✍️\n이런 걸\n배워요!\n실무 포트폴리오 2개\n최신 기술 스택을 활용한 8개의 프로젝트 구현\n전체적인 개발 사이클 완벽 이해\n실무 커뮤니케이션 역량 증진\n+α 백엔드의 기본 CRUD까지 습득\n노베이스 비전공자도\n프론트엔드 개발자로 커리어점프! ⭐\n💥 Attention!\n이 강의는 코딩 부트캠프에서 실제 사용하는 강의로 노베이스부터 비전공자 그리고 주니어 개발자까지 모두 수강 가능한 커리큘럼으로 구성되어 있습니다.\n\n'진짜' 부트캠프에서 만든\n[고농축 프론트엔드 코스]는요\n✅ 공부도 실무처럼! 실무에 적용하는 법을 알려주는 실무 중심 강의\n✅ 비전공자부터 전공자까지 모두가 이해할 수 있는 계단식 커리큘럼\n✅ [React, Next.js, Graphql] 최신 기술의 언어 학습과 프로젝트 구현\n✅ 취업률 92%의 인증된 '진짜' 부트캠프의 커리큘럼으로 진행\n✅ 노베이스도 가능한 완전 기초부터 개발자 취업 수준까지 성장\n\n이런 분들에게는\n더없이 안성맞춤이죠\n\nA to Z,\n전문적인 강의를 원해요.\n개발..? 아무것도 모르지만\n취업 수준까지 성장하고 싶어요.\n실무에서 사용하는 기술과\n진짜 노하우를 배우고 싶어요.\n우리는 왜\nReact와 Next.js를 사용해야 할까요?\nNext.js는 React 라이브러리의 프레임워크예요. React와 달리 기본적으로 Next.js는 Server-Side Rendering (SSR)을 하기 때문에 검색엔진 최적화(SEO, Search Optimiziation)에 좋아요. 또한 pre-rendering을 통해 미리 데이터가 렌더링 된 페이지를 가져올 수 있게 해주므로 사용자 경험 면에서도 유리하죠.\n이 외에도 페이지 기반 라우팅, 이미지 최적화, built-in-css등을 제공해서 프로젝트 성능을 향상해 주고 개발자들이 개발하기 편한 환경을 제공하니, 효율성 있고 성능 높은 개발을 할 수 있답니다 :)\n쌩초보도 괜찮아요,\n우선 기초부터 뿌셔볼까요?\n\"코딩의 '코'자도 모르는 나.. 개발자로 취업할 수 있을까?\" 그런 걱정은 당장 넣어두세요. 이 강의에서는 쌩초보도 현업 개발자 수준으로 성장할 수 있도록 탄탄한 기초 강의부터 시작하니까요!\n  🧩 기초뿌시기 step01.\n코딩이 뭐야? 프로그램 설치부터 기초쌓기\n웹·앱 개발의 기초 중에 기초, HTML · CSS · Javascript의 기본적인 문법과 활용 방법을 배우고, 배운 내용을 토대로 회원가입과 미니홈피를 구현할거예요.\n \n🧩 기초뿌시기 step02.\n60개 이상의 최신 프로퍼티를 통한 CSS!\n오늘 배운 내용은 오늘 복습하자! 강의 수강 후 충분한 연습을 통해 완전히 내 것으로 흡수할 수 있게 도와줄 거예요.\n🧩 기초뿌시기 step03.\nJavascript로 웹페이지의 기능을 더 풍요롭게.\n함께 사용하는 도구들과 Javascript가 동작하는 원리, 코드를 작성하는 법을 위주로 학습하며 d-day counter와 to-do list를 구현하며 배운 내용을 완전한 내 것으로 만드는 시간이예요.\n \n빈틈 하나까지 놓치지 않는\n'선 넘는' 프론트엔드 커리큘럼\n#01. React 기초\nReact의 기초부터 시작해볼까요? 우선, 각종 패키지를 설치해요. 그리고 Javascript 런타임 환경인 Node.js를 이해하며 React로 프로젝트를 생성합니다.\n#02. 데이터 통신\nRest-API와 GraphQL의 차이에 대해 이해하고, Apollo Client를 통해 백엔드와의 통신 방법을 습득해요.\n#03. 라우팅 및 리렌더링\n페이지 이동 방식인 Router와 Dynamic Routing의 차이를 이해하고 활용할 수 있어요.\n#04. 폴더 구조·props·컴포넌트 재사용성\nContainer/Presenter 패턴에 대해 이해하고, 컴포넌트를 재사용하는 법을 통해 효율을 높여줍니다.\n#05. 타입스크립트\n타입스크립트의 여러 가지 타입에 대해 이해하고 내 포트폴리오에 적용해봅니다.\n#06. 프레임워크 / 라이브러리와 레이아웃\n구조\n웹페이지를 꾸며주는 다양한 라이브러리. 그것들의 활용법을 배우고, 사용성을 위한 페이지네이션과 무한스크롤을 구현해요.\n#07. 컴포넌트와 생명주기\n클래스 컴포넌트의 생명주기와 함수형 컴포넌트의 생명주기 차이를 이해해보고, 이를 바탕으로 활용하는 법을 학습합니다.\n#08. 백엔드 구조 및 파이어베이스\nAPI를 직접 만들어 보고, 백엔드의 기초를 이해할 수 있어요. 또한 BAAS 서비스인 파이어베이스를 활용해볼 거예요. 백엔드를 이해하는 프론트엔드 개발자라니! 너무 매력적이지 않나요?\n#09. 이미지 업로드\n'홈페이지에 예쁜 이미지를 올리고 싶어요!' 이미지 업로드에 대한 프로세스를 이해하고 검증을 통해 직접 업로드 할 수 있어요.\n#10. 검색\n웹페이지에 검색기능은 빠질 수 없죠. 검색 프로세스를 이해하고 디바운싱을 적용해 내 웹페이지를 한껏 고도화합니다.\n#11. 로그인과 권한 분기\nJWT 토큰 방식의 로그인 프로세스를 이해해요. 또한 로그인 유무로 권한 분기를 설정하고 Recoil을 활용해 Globalstate를 관리할 수 있어요.\n#12. 폼 라이브러리\nReact-Hook-Form과 yup을 활용해서 기존 코드들을 리팩터링해서 더 효율적으로 서비스를 개선할 수 있어요.\n#13. custom hooks\n구조 분해 할당과 타입스크립트의 제네릭 타입을 활용해서 커스텀 훅을 만들 수 있어요.\n#14. 카카오 지도 및 웹에디터\nSSR과 CSR을 아시나요? 이 차이에 대해 이해해 보고, 카카오 지도와 웹 에디터를 사용하는 법을 배워요.\n#15. 결제 및 이벤트 루프\nE-commerce platform의 핵심! 결제 프로세스를 이해하고 구현해봐요. 또한 자바스크립트의 구동 원리에 대해 더 정확하게 알아갈 거예요.\n#16. refresh Token\nrefresh Token을 사용해서 실무에서도 사용할 수 있는 로그인 프로세스를 학습해요. \n#17. 성능 최적화\nuseMemo와 useCallback, 이미지 임시 URL을 활용해서 기존의 코드들을 마치 실무에서처럼 리팩토링할 수 있어요.\n  * 별도의 수업용 API를 제공합니다.\n#18. 테스트 코드 및 배포\njest와 cypress를 활용해서 테스트 코드를 만들어 볼 거예요. 이를 통해 단위 테스트와 통합 테스트를 진행해서 내 코드를 테스트하는 시간이에요.\n \n내 손으로 채운 코드로\n포트폴리오를 완성하세요.\n☝🏻 올어바웃 자유게시판\n블로그, 커뮤니티 등 웹의 어디에서나 빠지지 않는 게시판을 직접 구현할 수 있어요. 코딩을 이론만 알고 한다는 것은 불가능해요! 프로젝트 실습을 통해 페이지네이션, 무한 스크롤 등 여러 기능으로 나만의 코드를 채워나가요. 게다가 내 개성에 맞는 UI로 꾸밀 수 있으니 흥미뿐만 아니라 실력도 올라가겠죠?\n✌🏻 게시판으로 만드는 이커머스 플랫폼\n\"혹시.. 당근이세요?🥕\" 쿠팡, 당근마켓과 같은 E-commerce Platform이 어떻게 만들어지는지 아시나요? 회원가입, 로그인, 결제, 커뮤니티 등 많은 기능을 담고 있는 E-commerce 웹사이트를 내 손으로 구현할 수 있어요. 아직은 막막하겠지만 이 강의를 수강하고 나면 멋진 포트폴리오가 만들어져 있을 거예요.\n🎯 이 강의로 얻는 포트폴리오 입니다.\n· 01. 자유게시판  - UI·리스트업·페이지 네이션·글 수정 및 삭제 등 웹의 가장 핵심이 되는 기능들을 구현하고 이를 바탕으로 하나의 포트폴리오를 완성합니다.\n· 02. 중고마켓 - 첫번째 포트폴리오로 제작한 게시판을 중고마켓으로 고도화 하는 포트폴리오 입니다. 로그인·권한분기·결제·이미지 처리 등의 기능을 구현합니다.\n     \n게다가 강의 하나로 \n이만-큼의 스택을 한 번에 겟! \n여러 언어를 한 번에 이해하는 것은 어려운 일이죠. 이 강의에서는 프로젝트를 통해 Javascript, Typescript, React, Next.js, Graphql 등 다양한 스택을 직접 활용하며 나만의 웹페이지를 완성해요. 하나의 기능을 구현하기 위해 유기적으로 연결된 언어들의 사용 방법을 습득하며, 자연스럽게 이해하게 될 거예요.\n진짜 실무에서는 다양한 언어를 적절히 사용하며 최고의 효율을 낼 수 있어야 하니까요!\n* version : 수강 시 사용하는 버전입니다. (필요시 참고해주세요!) \n- next 12.1.0\n- react\": 17.0.2\n- react-dom\": 17.0.2\n- typescript\": ^4.8.4\n- @types/node\": 17.0.2\n- @types/react\": 17.0.2\n- @apollo/client\": ^3.6.9\n- @emotion/styled\": ^11.10.0\n- @material-ui/core\": 4.12.4\n- antd\": ^4.22.8\n- eslint\": ^8.0.1\n- prettier\": 2.7.1\n\n'Version'과 해당 기술 스택에 대한 이해가 없어도 괜찮아요. 강의에서 꼼꼼하고 친절하게 설명해 드릴게요:)\n   \n더 높은 커리어 점프를 위해\n부트캠프 수업자료를 제공해요.\n   \n📑 섹션별 학습자료\n강의를 수강하면서 내용의 이해를 도와주는 자료에요. 실제 부트캠프 수강생도 사용하는 자료인 만큼 잘 활용한다면, 놓친 부분이 있더라도 큰 도움이 될 거예요.\n    📑 섹션별 과제자료\n오늘 배운 내용은 오늘 복습하자! 강의 수강 후 충분한 연습을 통해 완전히 내 것으로 흡수할 수 있게 도와줄 거예요.\n\n📑 섹션별 포트폴리오\n각 섹션에서 배운 기능을 활용해 포트폴리오를 만들 때 참고할 수 있는 자료에요. 이 강의로 내 포트폴리오에 두 개의 프로젝트를 추가해보세요!\n \n\n이 강의의 수강생이\n직접 만든 서비스를 소개합니다.\n🎨 Artipul\n미대생의 작품을 쉽게 구매할 수 있는 서비스에요. 메인페이지뿐만 아니라 결제 오픈 API로 포인트 충전, 결제를 가능하게 하고, Socket.io를 사용해 실시간 입찰 기능까지 구현했어요.\n  📙 Flog\n여행 일정 · 가계부 · 여행 로그로 구성된 여행 가이드북 서비스에요. drag&drop 기능으로 여행 일정을 짜면 실시간으로 DB에 저장되어 사용성을 높였어요. 게다가 다른 유저와 일정을 공유할 수 있도록 구현했어요!\n\n  [고농축 프론트엔드 코스]\n수강 후엔 나도 개발자!\n\n\n🙆🏻‍♀️ 실무에 바로 활용할 수 있는 포트폴리오 2개\n👨🏻‍🎓 스스로 성장할 수 있는 튼튼한 개발 지식 구축\n💁🏻‍♀️ 실무에서 부드러운 커뮤니케이션을 하는 주니어 개발자\n👨🏻‍💻 타 부서와 협업 능력이 뛰어난 프런트엔드 개발자\n🙋🏻‍♀️ 혼자서도 할 수 있는 E-commerce Platform 개발\n  더 높은 커리어 점프를 위해\n[고농축 백엔드 코스]도 준비했어요.\n👉🏻 연관 추천강의 :\n\n실습용 API를 이용해 프론트엔드 최신 기술스택과 개발 사이클을 이해했다면, Node.js와 Nest를 중심으로 백엔드까지 더 깊게 배워보세요. 필요한 API를 직접 만들고 데이터를 다루는 법과 검색, 결제, 배포 등 백엔드의 모든 것을 알려드려요. 백엔드 코스까지 완주하고 풀스택 개발자로 더 높이 커리어 점프하세요🚀\n잠깐!\n수강 전 확인해주세요.\n💡 컴퓨터 사양을 확인해주세요.\n· Mac OS는 사양 무관합니다.\n\n· Window OS를 사용할 경우, git-bash 설치가 필요합니다.\n- 수업자료 > 환경 세팅을 참고해주세요.\n\n- Intel Core i5 9세대 이상 / AMD RYZEN 5 2세대 이상\n- RAM 16GB 이상 추천\n💡 일과표를 만들어 규칙적으로 꾸준히 학습하시길 권장해요.\n💡 학습 자료를 받기 위해 협업툴 ‘노션’ 계정을 만들어주세요.\n💡 수강에 필요한 학습자료는 노션(링크)으로 제공됩니다.\n ※ 학습 자료의 저작권은 코드캠프에게 있습니다. 무단 도용 · 배포 · 복제를 금지합니다.\n \n혹시\n궁금한 점이 있으신가요?\nQ. 아무런 지식 없이 수강해도 될까요?\n네. 코딩의 '코'자도 몰라도 괜찮아요. 더 깊고 넓게 이해할 수 있도록 HTML·CSS·Javascript의 쌩기초 과정이 포함되어 있어요.\nQ. 별도의 교재가 있나요?\n노션으로 제공해드리는 [강의 자료]를 활용해주세요! 본 자료는 실제 부트캠프에서 사용하는 그대로의 자료에요. 무단 도용·배포·복제를 금지합니다.\nQ. 기초강의 (시작은 프리캠프, CSS, Javascript)의 수업자료 리스트가 헷갈려요.\n\nQ. 수강 중 궁금한 점이 생겼어요.\n커뮤니티에 질문을 남겨주세요. 코드캠프 팀이 빠른 시일 내에 속 시원한 답변을 달아드릴게요 :)\n팀 코드캠프를\n소개합니다.\n\n지식공유자가 알려주는\n강의 수강 꿀팁!\n🎓\n이런 분들께\n추천드려요!\n전문 커리큘럼으로 제대로 성장하고 싶은 누구나\n국비 또는 다른 강의에 부족함을 느끼신 분\n최신 기술 스택으로 개발 사이클을 완성하고 싶은 주니어 개발자\n트렌드에 맞는 포트폴리오로 취업하고 싶은 취준생\n체계적으로 코딩 공부를 하고 싶은 대학생\n📚\n선수 지식,\n필요한가요?\n코딩에 대한 열정과 의지💪🏻",
      "lectureDifficulty": "입문자"
    }
  },
  {
    "model": "lectures.lecture",
    "fields": {
      "thumbnail": "https://cdn.inflearn.com/public/courses/328376/cover/6baa63b8-8f8f-473d-9b55-9047a521037e/328376-eng.jpg",
      "lectureTitle": "실제 이력서 사례로 알아보는 [합격하는 이력서] 작성 가이드\n대시보드",
      "lectureFee": 39600,
      "lectureDescription": "입문자를 위해 준비한\n[취업 · 이직, 개발 · 프로그래밍] 강의입니다.\n최소한 이력서 때문에 취업이나 이직에 실패하는 일이 없기를 바라는 마음으로 준비한 강의입니다. 🙏 다양한 이력서 사례들과 실제 신입/경력 이력서 개선 과정을 통해 이력서 작성 방법을 배울 수 있습니다.\n✍️\n이런 걸\n배워요!\n실제 이력서를 보며 배우는 이력서 작성 방법\n생생한 신입/경력 이력서 개선 과정\n탈락하는 이력서를 합격하는 이력서로 개선하는 방법\n이력서 피드백을 잘 받는 방법\n회사 지원할 때 유용했던 팁\n강의와 멘토링에서 자주 듣는 질문에 대한 답변\n사례 중심의 이력서 강의 두둥 등장!\n신입부터 경력까지 전부 OK 🥳\n  잘 쓴 이력서가 뭔가요? 📄\n이력서는 취업이나 이직 시 가장 먼저 준비하는 문서입니다. 하지만 막상 이력서를 쓰려고 하면 막막하지 않나요? 특히 다른 사람의 이력서를 볼 기회가 많지 않다 보니 '좋은 이력서'에 대한 감을 잡기조차 어렵죠.\n저는 지난 이직에서 8개에 회사에 이력서를 제출하여 7.5개 회사에 합격했습니다. 다른 사람의 이력서를 수없이 봤음에도 불구하고 이력서를 쓰는 일은 쉽지 않았기에, 이력서에 관한 글을 닥치는 대로 읽으며 이력서 작성 방법을 정리했습니다. 그렇게 정리한 이력서 작성 방법을 블로그에 공유했고, 그 글은 조회수 약 17만, 구글 ‘개발자 이력서' 키워드 상위 노출 1위를 기록했습니다.\n\n\n\n이후 수많은 강의 제안과 구체적인 이력서 작성 방법 설명, 이력서 피드백 요청을 받았습니다. 그동안은 블로그 글만으로도 충분할 것이라 예상하여 거절해왔습니다. 하지만 우연히 하게 되었던 몇 번의 멘토링과 강의를 통해 취업이나 이직에서 더욱 좋은 결과를 얻는 수강생들의 모습을 보게 되었습니다. 이후 더 많은 분께 도움이 되면 좋겠다는 생각이 들어 이 강의를 준비하게 되었습니다. (이 강의 소개를 빌어 좋은 결과를 내주시고 그 사실을 알려주신 분들께 진심으로 감사하다는 말씀 전해요! 🙇‍♀️)\n이 강의를 수강하시는 분들이 그간 쌓아온 멋진 경험과 자신만의 강점을 이력서에 잘 담아내어 최소한 이력서 때문에 취업이나 이직에 실패하는 일이 없기를 바라는 마음으로 준비했습니다. 🙏\n\n이 강의만의 특장점 ✨\n다양한 실제 이력서를 살펴보며 합격하는 이력서에 대한 감을 기를 수 있어요.\n구체적인 이력서 작성 방법을 익힐 수 있게 도와드려요.\n1:1 멘토링처럼 실제 신입 및 경력 이력서 개선 과정을 생생하게 보여드려요.\n이직 시 유용했던 팁과 강의와 멘토링에서 받았던 질문에 대한 답변까지 알차게 담았어요.\n후기 미리 보기 👀\n* 아래 후기는 지식공유자님이 진행하셨던 외부 강의나 멘토링에 대한 후기입니다.\n“저는 워니님께서 잘 피드백 해주신 것을 토대로 2월에 취업해서 현재 열심히 다니고 있습니다!”\n“나 혼자 열심히 고민하고, 노력해서 만들었기 때문에 남들도 당연히 이렇게 생각해줄 거라고 착각하고 작성한 이력서를 다시 살펴보는 계기가 되었습니다! 앞으로 무엇을 준비하고, 어떤 전략으로 나아갈지가지 배울 수 있던 아주 값진 시간이었습니다.”\n“진짜 필요한 부분들을 너무 잘 집어주셔서 좋았습니다. 왜 그렇게 이력서를 잘 쓰시는지 이력서뿐만 아니라 면접에 관해서도 너무 좋은 이야기를 많이 해주셔서 좋았습니다. 좋은 소식 가지고 또 연락드리겠습니다. 감사합니다!”\n“워니님 특강 후에 이력서의 방향을 잡을 수 있었습니다. 그 덕에 제가 원하는 회사에 지원하여 합격할 수 있을 것 같습니다!”\n혹시 이런 고민을 하시나요? 🤔\n이런 걸 배워요 ✨\n다양한 실제 이력서 사례\n다양한 이력서들을 살펴보며 합격하는 이력서에 대한 감을 익힐 수 있어요.\n구체적인 이력서 작성 방법과 팁\n실제 이력서를 바탕으로 구체적인 이력서 작성 방법과 팁을 배워요.\n생생한 이력서 피드백 과정 공유\n실제 신입과 경력 분들의 이력서를 보며 개선 포인트와 참고하면 좋을 포인트를 배워요.\n면접 질문으로 이어지는 이력서\n면접까지 대비하는 이력서 작성을 위해 강의 중간중간 이력서 내용이 어떻게 면접 질문으로 이어지는지 알려드려요.\n나의 부족한 점/개선 포인트 발견\n이력서 작성이 어려울 때 무엇이 부족한지, 더 나은 취업/이직 결과를 위해 평소에 무엇을 더 챙기면 좋을지 알 수 있어요.\n채용 담당자 입장에서는?\n채용 담당자가 이력서를 리뷰하는 방식을 보여드리고, 담당자 입장에서 매력적인 이력서가 무엇인지 알려드려요.\n알찬 강의 구성 🗂️\n이력서의 목적부터 탈락/합격하는 이력서의 특징, 구체적인 이력서 작성 방법, 실제 이력서 개선하는 과정 등을 담았습니다. 또 회사 지원할 때 유용했던 팁과 신입 개발자가 자주 하는 질문에 대한 답변까지 알차게 전하려고 노력했습니다.\nPart 1. 이력서를 작성하기 전에\n이력서의 목적\n탈락하는 이력서, 합격하는 이력서\n잘 읽히는 이력서 (이력서 템플릿 제공)\nPart 2. 이력서 작성하기\n이력서 구성과 순서\n제목과 프로필\n자기소개\n경험\n기술과 학력/교육\nPart 3. 이력서 작성 후\n지키지 않으면 과락인 것들\n작성보다 중요한 퇴고 (최종 점검 체크리스트, 피드백 잘 받는 방법 제공)\n회사 지원할 때 유용했던 팁\nPart 4. 실제 이력서 개선하기\n신입 이력서 개선하기\n경력 이력서 개선하기\nPart 5. FAQ\n신입 개발자가 자주 하는 질문\n자주하는 질문 모음 (강의 노트 only 📝)\n  예상 질문 Q&A 💬\nQ. 이 강의를 수강하면 무조건 이력서 합격을 할 수 있을까요?\n🙅‍♀️ 솔직하게 말씀드리면 그렇지 않습니다!  이력서가 합격하기 위해서는 이력서 구성이나 형식도 좋아야 하지만, 결국 가장 중요한 것은 이력서에 담긴 내용입니다. 그렇기 때문에 이력서에 담을 좋은 내용 없이는 아무리 이력서 작성 요령을 터득하여도 합격하는 이력서를 작성하기 어렵습니다.\n그래서! 강의를 진행하면서 무엇을 더 해야 하는지를 이야기합니다. 이력서 작성이 어려울 때 발견할 수 있는 나의 부족한 점, 개선 포인트를 언급하기 때문에 합격하는 이력서를 작성하기 위해 무엇을 더 해야 하는지 알 수 있습니다. (특히! 가장 고민이 많으신 비전공자 신입분들이 더 잘 챙겨야 하는 부분을 많이 설명하려고 노력했어요.)\nQ. <Part 5-1. 신입 개발자가 자주하는 질문>에서는 어떤 질문을 이야기하나요?\n💁‍♀️ 아래의 질문에 대해 답변합니다. 강의 오픈 이후에 자주 받게 되는 질문은 강의 자료에 업데이트될 예정입니다.\nQ. 신입에게 요구하는 수준은 어느 정도인가요?\nQ. 프로젝트는 몇 개를 해야 할까요?\nQ. 어떤 프로젝트를 하면 좋을까요?\nQ. 블로그와 깃헙을 관리할 때 무엇을 잘 챙기면 좋을까요?\nQ. 비전공자인데 CS 공부를 얼마나 해야 할까요?\nQ. 포트폴리오 꼭 필요한가요?\nQ. 실제 서비스가 아니라서 성과를 숫자로 표현할 수 없는데 어떡하죠?\nQ. 네카라쿠배에 합격할 때까지 공부하는 게 좋을까요?\nQ. 쓸 내용이 없어요.\nQ. 비전공자는 전공자랑 경쟁하면 무조건 밀릴 수밖에 없을 것 같은데.. 어떻게 비전공자가 경쟁력을 가질 수 있을까요?\nQ. 개발자가 아닌 사람도 들을 수 있나요?\n🙆‍♀️ 네! 들을 수 있습니다. 개발자 중심으로 설명드리기는 하지만 대부분의 내용이 직무 상관없이 이력서를 쓰시는 모든 분들이 적용할 수 있는 내용으로 구성하였습니다.\n지식공유자 소개 ✒️ 워니\n  힐링페이퍼(강남언니) 엔지니어\n힐링페이퍼 프론트엔드 리드, 트레바리 테크 리드 역할을 경험하며 다수의 이력서 리뷰\n블로그에 이력서 작성 방법을 공유하였고, 구글 ‘개발자 이력서' 키워드 상위 노출 1위 (조회수 약 17만)\n유튜브 스타트업 채널 eo, 제로베이스, 인프런, 멋쟁이사자처럼 등에서 이력서 주제의 강의 및 멘토링 다수 진행\n지식공유자가 알려주는\n강의 수강 꿀팁!\n🎓\n이런 분들께\n추천드려요!\n이력서를 처음 작성해보는 취업 준비생\n이직을 위해 내 경력을 어떻게 정리할지 고민 중인 분들\n직무를 전환해서 구직하느라 이전 경력이 고민되는 분들\n내 강점을 어떻게 어필할지 막막한 분들\n다른 이력서를 참고하며 감을 잡고 싶은 분들\n내가 한 일을 어떻게 성과중심적으로 표현할지 고민되는 분들",
      "lectureDifficulty": "입문자"
    }
  },
  {
    "model": "lectures.lecture",
    "fields": {
      "thumbnail": "https://cdn.inflearn.com/public/courses/324145/cover/184a19f3-c99f-4eea-a764-dc8e71d4c37a/324145.png",
      "lectureTitle": "프로그래밍 시작하기 : 파이썬 입문 (Inflearn Original)\n대시보드",
      "lectureFee": 27500,
      "lectureDescription": "입문자를 위해 준비한\n[프로그래밍 언어] 강의입니다.\n이미 2만명 이상이 학습하고 만족한 최고의 프로그래밍 입문 강의. 인프런이 비전공자 위치에서 직접 기획하고 준비한 프로그래밍 입문 강의로, 프로그래밍을 전혀 접해보지 못한 사람부터 실제 활용 가능한 프로그래밍 능력까지 갈 수 있도록 도와주는 강의입니다.\n✍️\n이런 걸\n배워요!\n입문자도 쉽게 할 수 있는 프로그래밍 입문\n파이썬 기초 문법과 활용법을 배울 수 있어요\n데이터 분석\n업무 자동화\n파이썬 입문,\n누구나 할 수 있어요! 💪\n프로그래밍이 우리에게 자유를 줄 수단이라서가 아닐까요? \n과제를 위한 자료 찾기를 클릭 한 번으로!\n수많은 거래처에 보낼 문서를 엔터 한 번으로!\n매달 해야 하는 반복 업무를 컴퓨터가 자동으로!\n최근 코딩과 관련된 교육 과목이 증가하면서 프로그래밍과 관련된 교육/직무에 관한 관심도 많이 증가하고 있죠. 게다가 수많은 기업이나 팀에서 코딩을 필수 덕목으로 생각하기 시작했어요. 대기업 입사 면접에서 비전공자들에게 파이썬 할 줄 아냐고 물어보기도 하죠.\n프로그래밍을 취미로 투잡하는 사람들, 여행 다니며 일하는 만들고 싶은 것을 만드는 노마드 인생을 즐기는 사람들도 늘어나고 있어요.\n하지만 코딩은 어쩐지\n어렵게 느껴지지 않나요?\n🥺\n코딩 강의가 너무 비싼데, 강의 내용이 좋을지 모르겠어요. 한두 번 듣고 안 들을까 봐 걱정돼요.\n🥲\n혼자 코딩 공부 중인데, 제가 하는 게 맞는지 모르겠어요. 모르는 건 누구한테 질문해야 하나요?\n🤔\n무작정 시작해도 되는 건가요? 어떤 걸 어떻게 공부해야 할지 모르겠어요.\n🤨\n시간도 없고 학원도 너무 멀어서 코딩 공부를 시작하기가 쉽지 않아요.\n고민은 그만! \n누구나 재미있게 배울 수 있어요 💡\n파이썬(Python)이란?\n우리가 매일 만나는 웹 사이트, 앱을 만들 수 있는 프로그래밍 언어예요. 웹, 앱 말고도 게임, 인공지능 등 파이썬으로 할 수 있는 것들이 정말 많아요. 배우기가 다른 언어보다 쉽다는 점을 포함한 다양한 장점 덕분에 인기 언어로 꼽히고 있어요.\n왜 파이썬을 배워야 할까요?\n파이썬은 문법 구조가 쉽기 때문에 프로그래밍을 처음 접하는 초보자도 쉽게 이해할 수 있어요. 파이썬은 그 어떤 프로그래밍 언어보다 확장성이 월등히 높은 언어예요. 데이터 분석가도, 웹 개발자도, 머신러닝 연구자도, 대학원생도 파이썬을 사용하죠. 당신이 어떤 업무를 맡더라도 파이썬만 알아두면 척척 대응하기 쉬워집니다.\n당연히 비전공자도 다룰 수 있습니다. 프로그래밍 언어는 만국 공통어에요. 만약 C, Java 등의 언어를 접해봤다면 더욱 쉽게 파이썬을 익힐 수 있겠죠.\n파이썬의 특장점 ⭐\n코딩 입문에 딱\n파이썬은 사람의 언어와 닮아서 상대적으로 배우기 쉬운 개발 언어입니다.\n거대한 커뮤니티\n커뮤니티에서 참고할 자료가 많고, 다른 사람들에게 도움받기도 쉬워요. \n높은 활용성\n웹 개발, 데이터 분석, 해킹 등 다양한 분야에서 쓰이는 언어예요.\n많은 라이브러리\n다양한 파이썬 라이브러리와 함께 빠른 결과물을 만들 수 있어요.\n업무 자동화\n메일 분류, 웹 크롤링 등 반복적이고 오래 걸리는 일을 빨리할 수 있어요.\n많은 기업의 관심\n인스타그램 등 유명 사이트도 파이썬으로 만들어진 경우가 많아요.\n가장 실무에 가까운 언어, 파이썬\n\n\n# 개념 확립 & 실무 기초\n시중에 나와 있는 모든 파이썬 기본서를 분석하고 습득한 후 제작했습니다. 정확한 개념 확립과 실무 기초를 한 번에 가져갈 수 있는 구성입니다.\n\n# 실제 활용\n본 강의는 기존 파이썬 기초 강의에서 다루고 있는 기초 ‘맛보기’가 아닌 실제 활용을 염두에 두고 제작되었습니다.\n\n# 데이터 타입\n실제 현업(필드)에서 처리해야 할 다양한 데이터 타입을 정리하고 분류하는 데 많은 시간을 할애하여 만들었습니다.\n실전 프로젝트와 함께\n수업에서 배웠던 것들을 총동원하여 행맨 게임을 만들어보세요!\n🎮 행맨 게임이란?\n글자 수만큼 밑줄을 그려 놓고 단어를 완성하는 게임입니다.\n\n👨🏻‍💻 행맨 미니 게임 코드 작성하기\n무작위 단어를 추가하고, 단어를 맞추기 위한 힌트도 만들어볼까요?\n사운드 효과도 추가해서 더 재밌는 게임을 만들어보세요 :D\n파이썬 (Python),\n다양한 분야에서 쓰이고 있어요!\n데이터 분석\n다양한 파이썬 라이브러리를 활용하면 데이터를 쉽게 분석하고 정리할 수 있습니다.\n딥러닝\n파이썬 라이브러리 TensorFlow를 활용하세요. 알파고에 활용된 딥러닝을 배울 수 있어요.\n대학원\n파이썬과 SciPy를 활용하면 여러 문제를 컴퓨터로 쉽게 풀 수 있습니다.\n웹 개발\n파이썬의 웹 프레임워크인 Django로 나만의 웹 서비스를 만들어 보세요.\n이런 분들께 추천해요!\n  반복업무\n끝없는 반복 업무에 지친 직장인과 대학생\n파이썬?\n파이썬 이름은 들어봤는데 궁금한 분\n코알못\n프로그래밍을\n배우고 싶은 모든 분\n파알못\n파이썬을\n처음 접하는 분\n인프런 오리지널 - 파이썬 입문 \n수강생의 목소리를 직접 들어보세요!\n1. IT 기업 근무하는 비전공자, \"구본세 님\" 인터뷰\n2. 창업을 위한 프로그래밍, \"몽몽 님\" 수강 후\n인프런 오리지널 시리즈 : 파이썬 (Python)\n파이썬의 기본부터 심화까지 차근차근 따라 해보세요. 인프런이 제시하는 프로그래밍 학습 로드맵을 따라가면 어느덧 파이썬 프로그래밍을 마스터한 자신과 만나게 될 겁니다. \n고민은 그만! 파이썬 완주 A to Z 🏃‍♂️\n묶음 할인 50%\n✅ 파이썬 기초~기초 복습\n✅ 파이썬 중급~고급 문법\n✅ 파이썬 메타 클래스 설계\n✅ 동시성, 병렬성, Thread, Processing 프로그래밍\n# 개념 확립 & 실무 기초 # 데이터 타입현재 강의\n본 강의는 기존 파이썬 기초 강의에서 다루고 있는 기초 '맛보기'가 아닌 실제 활용을 염두에 두고 제작되었습니다.\n#기초완벽복습 #기본기다지기 #다양한퀴즈풀기\n본 강의는 파이썬 기초 강의를 통해 더 효율적이고 안전하고, 깔끔한 코드 작성 및 문제 해결 능력 향상을 목적으로 제작되었습니다.\n# 데이터 분석 # 업무 자동화\n초심자에서 한 단계 뛰어넘는 프로그래밍 중급 과정을 통해 파이썬 고급 문법과 패키지 활용을 배우면서 대비해보세요!\n# 메타 프로그래밍 # 파이썬 패키지 제작\n파이썬 초급 활용 단계에서 취준생 및 경력직 이직 희망자들을 대상으로 파이썬 내부 원리에 대해 깊게 공부합니다!\n#동시성 프로그래밍 #파이썬 병렬성 #파이썬 병행성\n파이썬 중급 활용 단계에서 취준생 및 경력직 이직 희망자들을 대상으로 파이썬 동시성 및 병렬성에 대한 지식을 제공합니다.\n왜 인프런 오리지널일까요? 💡\n두둥, 드디어 나왔다. 인프런 오리지널\n넷플릭스 오리지널이 퀄리티가 높지 않습니까? 인프런 오리지널도 그렇습니다.\n본 강의는 더 많은 사람이 양질의 강좌를 들을 수 있도록 하기 위해 제작되었는데요.\n부끄럽지 않도록 신경 써서 만들었어요.\n더 알아볼까요?\n\n\n\n\n\n지식공유자가 알려주는\n강의 수강 꿀팁!\n🎓\n이런 분들께\n추천드려요!\n프로그래밍 배우고 싶은 모든 분\n끝없는 반복 업무에 지친 직장인과 대학생\n파이썬 이름은 들어봤는데 궁금한 분\n파이썬을 처음 접하는 분\n📚\n선수 지식,\n필요한가요?\n없음",
      "lectureDifficulty": "입문자"
    }
  },
  {
    "model": "lectures.lecture",
    "fields": {
      "thumbnail": "https://cdn.inflearn.com/public/courses/330330/cover/d31a6383-8b78-41b8-b1df-244512985ef1/330330-eng.png",
      "lectureTitle": "프로그래밍 시작하기 : 도전! 45가지 파이썬 기초 문법 실습 (Inflearn Original)\n대시보드",
      "lectureFee": 16500,
      "lectureDescription": "초급자를 위해 준비한\n[프로그래밍 언어] 강의입니다.\n파이썬 기초 문법 지식을 기반으로 쉬운 예제부터 어려운 예제로 난이도를 높여갑니다. 이 과정에서 혼자서 학습하는 방법, 탄탄한 문법 지식 습득 및 기본기를 확실하게 다지게 될 거예요. 아울러, 파이썬 프로그래밍의 자주 사용하는 패턴을 배워봅니다.\n✍️\n이런 걸\n배워요!\n입문자도 쉽게 할 수 있는 프로그래밍 입문\n탄탄한 파이썬 기초 문법 학습\n퀴즈를 통한 파이썬 기초 문법 복습하기\n문서 & 코드 작업 대비 Jupyter Notebook 기초\n자주 사용하는 여러가지 문법 패턴 배우기\n기타 다양한 파이썬 활용 이야기\n45가지 예제 기반 학습을 통한\n파이썬 기본기를 완벽하게 다져보세요! 😎\n고민은 그만! 파이썬 완주 A to Z 🏃‍♂️\n묶음 할인 50%\n✅ 파이썬 기초~기초 복습\n✅ 파이썬 중급~고급 문법\n✅ 파이썬 메타 클래스 설계\n✅ 동시성, 병렬성, Thread, Processing 프로그래밍\n깊이 있고 쉽게 설명하는 파이썬 문법 기본기 다지기!\n파이썬 기술 면접 대비 & 파이썬 기본 개념과 동작 원리 이해력 상승까지!\n본 강의는 파이썬에 대해서 기초 문법을 알고 사용할 줄 아는 분들을 대상으로 파이썬 활용 분야의 취업을 원하는 취준생, 경력직 이직을 준비하는 개발자(엔지니어 등)을 위해 파이썬 기초를 확실하게 다지고 프로그래머의 필수 스킬인 논리적인 사고방식과 문제 해결 능력을 향상을 목적으로 45가지 다양한 예제를 준비했습니다. 단순한 하향식 설명이 아닌, 서로 직접 코딩하며 라이브하게 진행합니다.\n\n문제 해결 능력 상승, 최신 개발 트렌드에 적합한 지식 습득\n도전! 45가지 기초 문법 실습 복습편\n파이썬 숙련자가 되기 위한 필수 스킬, 문제해결력\n파이썬(Python)은 유행을 넘어서 대부분의 분야에 널리 사용되고 있습니다. 우선 초반 진입 장벽이 타 언어 대비 이해하기 매우 쉽기 때문입니다. 파이썬에 대한 기술적 수요는 폭넓게 증가하고 있고 대부분의 기업에서 외부의 진화하는 환경에 대비해 숙련된 파이썬 개발자를 많이 채용하고 있습니다.\n파이썬 프로그래밍을 활용한 다양한 분야로 진출하기 위한 가장 중요한 선행 조건은 기본기를 확실하게 다지고 프로그래머처럼 생각하는 것입니다. 직면한 문제에 대해 솔루션을 찾는 과정이라고 생각해 볼 수 있습니다. 문제 해결을 위한 포인트는 구현하는 사람에 따라 다르지만, 파이썬이 가진 언어적 특징을 확실하게 이해하고 머릿속으로 그려놓은 최적화 된 프로세스로 정답을 제공하는 능력을 습득하는 것이 가장 중요하다고 생각합니다.\n빠르게 성장하는 개발자는 프로그래밍 언어 고유의 동작 원리를 학습하고 실습에 적용하는 사람입니다. 성장의 의미는 원하는 직장으로의 이직, 연봉상승, 스타트업 창업, 개인 발전 등과도 관련이 있을 것입니다.\n인정받는 파이썬 개발자가 되고 싶다면?\n주어진 비즈니스 문제를 해결하는 사람으로 거듭나기 위해서\n 문제해결력 학습이 꼭 필요합니다.\n어떤 분야든 일정 수준에 도달하면, 누구나 반드시 어려움과 직면하게 되는 것 같습니다. 수박 겉핥기식이 아닌 파이썬 언어에 대해 깊이 있는 지식이 강의를 통해 전달되었으면 좋겠습니다.\n본 강의에선 파이썬 언어를 폭넓게 활용하고 숙련자가 되기 위해 필요한 문법 패턴 45가지를 정리했습니다. 파이썬의 독창적인 문법 특징을 포함해서 쉬운 예제부터 다소 난이도가 있는 예제까지 퀴즈 형식으로 어렵지 않게 누구나 쉽게 기본기를 다질 수 있을 거예요. 핵심 원리를 단순히 이론적으로 이해하는 것이 아니라, 문제 해결 능력과 효율적이고 깔끔하게 코드의 질을 업그레이드할 수 있는 능력을 자연스럽게 습득하게 될 것입니다. \n왜 파이썬을 배워야 할까요?\n파이썬은 문법 구조가 쉽기 때문에 프로그래밍을 처음 접하는 초보자도 쉽게 이해할 수 있어요. 파이썬은 그 어떤 프로그래밍 언어보다 확장성이 월등히 높은 언어예요. 데이터 분석가도, 웹 개발자도, 머신러닝 연구자도, 대학원생도 파이썬을 사용하죠. 당신이 어떤 업무를 맡더라도 파이썬만 알아두면 척척 대응하기 쉬워집니다.\n당연히 비전공자도 다룰 수 있습니다. 프로그래밍 언어는 만국 공통어에요. 만약 C, Java 등의 언어를 접해봤다면 더욱 쉽게 파이썬을 익힐 수 있겠죠.\n파이썬의 특장점 ⭐\n코딩 입문에 딱\n파이썬은 사람의 언어와 닮아서 상대적으로 배우기 쉬운 개발 언어입니다.\n거대한 커뮤니티\n커뮤니티에서 참고할 자료가 많고, 다른 사람들에게 도움받기도 쉬워요. \n높은 활용성\n웹 개발, 데이터 분석, 해킹 등 다양한 분야에서 쓰이는 언어예요.\n많은 라이브러리\n다양한 파이썬 라이브러리와 함께 빠른 결과물을 만들 수 있어요.\n업무 자동화\n메일 분류, 웹 크롤링 등 반복적이고 오래 걸리는 일을 빨리할 수 있어요.\n많은 기업의 관심\n인스타그램 등 유명 사이트도 파이썬으로 만들어진 경우가 많아요.\n강의 목차\n학습 순서\n수업 시작 준비 - 오리엔테이션 & 수업 환경 설정\n사전 기초 강의 - 주피터 노트북(Jupyter Notebook) 기초 실습\n45가지 기초 문법 실습 - 핵심 영역\n최종 정리\n강의의 섹션 0~1은 오리엔테이션 및 수업 기본 환경설정, 주피터 노트북 기초 학습을 진행합니다.\n이를 통해 기본적인 아나콘다 설치 및 주피터 기반 개발 환경 설정 방법을 습득하고, 예제 소스 코드의 구성 및 수업 진행 방법에 대한 가이드라인을 제공하며, 주피터 노트북의 인터랙티브한 셀 기반 단계적 실행의 장점에 대해서 배웁니다. 아울러, 문서 작성 능력은 덤으로 배우실 수 있습니다.\n섹션 2~4는 본 강의의 메인 입니다. 여러분이 직접 해결하는 45가지 쉽고 어려운 다양한 예제들을 통해서 잊기 쉬운 기초 문법 복습, 테크니컬한 사용법, 문제 해결 능력 향상을 목적으로 이루어진 섹션입니다. 아울러, 파이썬의 장점인 간결하고 단순한 코드를 작성할 수 있도록 몇 번이고 반복합니다.\n이 강의를 듣고 나면\n파이썬 기초 지식 습득 후 다양한 분야의 개발 경험이 쌓이면 자연스럽게 피드백을 수렴을 위한 다양한 사람들과 협업을 준비할 단계입니다. 이를 위해 직접 해결하는 퀴즈 형식의 예제를 통해서 시간과 노력에 들어가는 기간을 최대한 단축할 수 있는 다양한 경험과 노하우를 제공해드리겠습니다.\n강의가 끝나면 여러분은 파이썬 기초 문법을 통해서 지식의 빈틈을 보완하고, 좋은 코드 작성을 위한 Best Practices를 찾게 될 것입니다.\n학습이 다소 힘들어도 마지막에는 자연스럽게 숙련도가 높아질 것입니다. 이를 통해 파이썬을 활용한 다양한 분야로의 진출에 자신감을 느끼게 될 것입니다. \n이런 분들께 추천합니다!\n(인프런 오리지널 - 파이썬 초급(Level 1)을 익히신 분, 혹은 해당 수준 이상의 파이썬 기초 문법을 익히신 분들을 대상으로 한 강의입니다 🙌)\n깊게 배우자!\n문제 해결 도전!\n파이썬 초급자\n파이썬 초급 졸업\n파이썬 문법\n확실하게 배우고픈 분\n파이썬 스택!\n파이썬 기반 취업\n준비 중인 구직자\n차근차근\n파이썬을 깊이 있게\n배우고픈 분\n직접 따라 해보세요!\n본 강의는\n본 강의는 45가지 예제(퀴즈)를 통해서 자주 사용하는 파이썬 문법을 반복적인 코딩으로 문제 해결 능력 향상 및 기초 문법 기본기를 확실하게 다지기 위해 만들어진 강의입니다.\n인프런 파이썬 중급 단계(Level 2)를 수강하기 위한 확실한 기초 능력을 다지게 됩니다.\n관련 로드맵\n인프런 오리지널 시리즈: 파이썬\n파이썬의 기본부터 심화까지 차근차근 따라 해보세요. 인프런이 제시하는 프로그래밍 학습 로드맵을 따라가면 어느덧 파이썬 프로그래밍을 마스터한 자신과 만나게 될 겁니다.\n#개념확립 #실무기초 #데이터타입\n본 강의는 기존 파이썬 기초 강의에서 다루고 있는 기초 '맛보기'가 아닌 실제 활용을 염두에 두고 제작되었습니다.\n#기초완벽복습 #기본기다지기 #다양한퀴즈풀기현재 강의\n본 강의는 파이썬 기초 강의를 통해 더 효율적이고 안전하고, 깔끔한 코드 작성 및 문제 해결 능력 향상을 목적으로 제작되었습니다.\n#데이터분석 #업무자동화\n초심자에서 한 단계 뛰어넘는 프로그래밍 중급 과정을 통해 파이썬 고급 문법과 패키지 활용을 배우면서 대비해보세요!\n#데이터분석 #업무자동화\n초심자에서 한 단계 뛰어넘는 프로그래밍 중급 과정을 통해 파이썬 고급 문법과 패키지 활용을 배우면서 대비해보세요!\n#동시성프로그래밍 #파이썬병렬성 #파이썬병행성\n파이썬 중급 활용 단계에서 취준생 및 경력직 이직 희망자들을 대상으로 파이썬 동시성 및 병렬성에 대한 지식을 제공합니다.\n강의 자료를 제공합니다!\n수업에 활용된 모든 예제 소스 파일과 PPT는 원본으로 제공됩니다.\n복습에 적극적으로 활용될 수 있도록 별도의 실행 파일을 제공합니다.\n지식공유자가 알려주는\n강의 수강 꿀팁!\n🎓\n이런 분들께\n추천드려요!\n파이썬을 배운 것 같은데 뭔가 부족함이 느껴지시는 분\n인프런 오리지널 : 파이썬 입문 수료하신 분\n인프런 오리지널 : 우리를 위한 파이썬(Level2) 수강 예정 이신 분\n파이썬 기반 다양한 분야의 프로그래머 전향을 꿈꾸는 분\n데이터사이언티스트 또는 인공지능 분야를 꿈꾸시는 분\n파이썬을 우선 배우고 나중에 활용하고 싶으신 분\n파이썬을 활용한 다양한 어플리케이션을 개발 하고 싶은 분\n프로그래밍 배우고 싶은 모든 분\n📚\n선수 지식,\n필요한가요?\n파이썬 개발 환경 설정 방법\n약간의 파이썬 기초 문법\n인프런 오리지널 : 파이썬 입문 수료하신 분\n파이썬 언어에 대한 깊은 관심",
      "lectureDifficulty": "초급자"
    }
  },
  {
    "model": "lectures.lecture",
    "fields": {
      "thumbnail": "https://cdn.inflearn.com/public/courses/329922/cover/364e7406-3569-437b-b719-7f146cad3d60/thumbnail-js.png",
      "lectureTitle": "[인프런x코드캠프] 훈훈한 Javascript\n대시보드",
      "lectureFee": 22000,
      "lectureDescription": "입문자를 위해 준비한\n[프로그래밍 언어, 웹 개발] 강의입니다.\n다른 언어도 많은데.. 왜 자바스크립트여야 하냐구요? 자바스크립트는 전세계에서 가장 많이 쓰는 언어로, 비전공자도 빠르게 배울 수 있고 이해하기 쉬운 구조를 가지고 있어요. 게다가 구글, 페이팔, 아마존 등 유명 기업들도 활용하고 있다니! 더 이상의 고민이 필요한가요?\n✍️\n이런 걸\n배워요!\n실무형 자바스크립트 지식과 구동 원리 학습\n자유로운 코드 작성을 위해 필요한 개발 도구\n[D-Day Counter] 프로젝트를 통한 데이터 다루는 방법\nopen WeatherMap/Geolocation을 통한 날씨 데이터 추출\n개발 중 직면한 문제를 능동적으로 해결할 수 있는 힘\n코딩 기초 뿌시기 마지막 Chapter 03.\n훈훈한 JavaScript!\n웹 환경에서 사용할 수 있는 프로그래밍 언어로써 가장 강력한 자바스크립트,\n배우지 않을 이유가 없겠죠?\n[훈훈한 JavaScript]는요 ✨\n👉🏻 자바스크립트로 코드를 작성할 때 꼭! 알아야 할 구동 원리와 지식들을 전달해요.\n👉🏻 스스로 무언가를 만들 수 있는 기반을 다지게 해드려요.\n👉🏻 다양한 프레임워크 라이브러리가 존재하는 만큼 여러 방향으로 뻗어나갈 수 있는 토대를 다져드려요.\n👉🏻 단순해 보이는 기능의 복잡한 로직을 직접 이해하고 개발을 위한 코딩 능력과 컴퓨터적 사고 능력을 발달시킬 수 있어요.\n무엇이든 처음 학습할 땐 \n빠른 이해가 동반되어야 좋아요 😉\nStep 01.\n기초부터 꼼꼼하고 탄탄하게!\n자바스크립트는 여러 방향으로 퍼져 나갈 수 있는 언어인 만큼 코드를 자유롭게 작성할 수 있다는 특징을 가져요. 그렇기 때문에 더욱 그 기초가 중요하죠.\n이 강의는 Javascript가 동작하는 기본적인 원리, 코드를 작성하는 방법 등 그 기초를 중점적으로 다루고 있어요. 완성된 성을 받아 가는 것이 아닌 성을 쌓아가는 방법을 배우는 것이죠.\n또한, Chrome의 개발자 도구, debugger, vscode를 사용해가며 스스로 성을 쌓아 올릴 수 있도록 필요한 도구들을 함께 알아갈 거에요.\nStep 02.\n데이터를 다루는 방법을 알아봅시다.\nD-day Counter를 만들기 위해 숫자, 문자 등의 데이터를 다루는 방법을 중점적으로 학습해요. 그리고 하나의 기능을 만들기 위한 도구, 함수를 정의하고 사용하는 방법에 대해 배울 거예요.\n우리가 직접 만든 도구인 함수를 조립해 D-day Counter를 완성시키게 되는데, 그 과정에서 반복적인 코드의 양을 줄일 수 있는 방법, 코드 실행의 분기점을 나누는 방법 등을 함께 학습하게 되죠.\n우리는 다양한 문제들을 직면하고, 해결할 수 있는 개념을 알아보고 코드에 적용 시키면서 이론적으로 살펴본 개념이 실제로 어떻게 동작하게 되는지 알 수 있게 될 거예요.\nStep 03.\n자바스크립트 구동 원리를 알아보고, 직접 이용해요.\nJavascript로 HTML을 조작할 수 있었던 이유에 대해 알아보고, Todo list를 만들기 위해 Javascript의 구동 원리, 컴퓨터의 통신 방식 등 여러가지 실습을 통해 직접 알아봅니다.\n이러한 개념들을 조합해 openWeatherMap과 Geolocation 등을 통해서 날씨 데이터를 받아오는 실습도 함께 진행할 거에요. 이를 통해 우리 눈에 보이지 않는 데이터의 통신이 어떻게 이루어지는지 직접 확인할 수 있게 되죠.\n이후, 통신을 통해 받아온 데이터를 Javascript의 구동 원리를 이용해서 활용하는 방법에 대해 학습하고 이를 직접 코드에 적용합니다.\n[훈훈한 JavaScript] 수강 후엔\n이런 입문자가 될 수 있어요.💪🏻\n잠깐! 수강 전 확인해주세요. 📢\n💡 일과표를 만들어 규칙적으로 꾸준히 학습하시길 권장해요.\n💡 학습 자료를 받기 위해 협업툴 ‘노션’ 계정을 만들어주세요.\n💡 수강에 필요한 학습자료는 노션(링크)으로 제공됩니다.\n ※ 학습 자료의 저작권은 코드캠프에게 있습니다. 무단 도용 · 배포 · 복제를 금지합니다.\n궁금한 점이 있으신가요? 💬\nQ. 아무런 지식 없이 수강해도 될까요?\nA. 네. 본 강의는 프로그래밍이 처음인 사람도 들을 수 있는 난이도입니다. 만약 HTML, CSS 등 더 탄탄한 기초를 쌓은 후 수강하고 싶으시다면 [시작은 프리캠프!] [강력한 CSS] 강의를 추천드립니다.\nQ. 별도의 교재가 있나요?\nA. 노션으로 제공해드리는 [강의 자료]를 활용해주세요!\nQ. 강의 수강 전, 설치해야 할 프로그램이 있나요?\nA. 네, ‘크롬 브라우저’와 ‘VSCode’를 미리 설치해주세요! 다른 프로그램은 강의에서 함께 설치해보도록 해요!\n팀 코드캠프를 소개합니다. 💑\n지식공유자가 알려주는\n강의 수강 꿀팁!\n🎓\n이런 분들께\n추천드려요!\n(★추천★)[강력한 CSS] 강의 수강자\n기초는 알지만 기능 구현을 고도화하고 싶은 입문자\n개발자로 커리어 전환을 하고 싶은 예비 개발자\n프론트엔드와 백엔드 포지션 중, 확신이 필요한 분들\n코딩 공부를 했지만 자바스크립트에 대한 이해가 부족한 분들\n자바스크립트에 대한 기초 지식이 전무한 분들\n코딩으로 자기계발을 하고 싶은 분들\n📚\n선수 지식,\n필요한가요?\n(★추천★)[시작은 프리캠프] 강의 학습\n(★추천★)[강력한 CSS] 강의 학습\n개발자에 대한 열정과 의지\n코딩에 대한 호기심",
      "lectureDifficulty": "입문자"
    }
  },
  {
    "model": "lectures.lecture",
    "fields": {
      "thumbnail": "https://cdn.inflearn.com/public/courses/329534/cover/76d5fd7f-3e76-4801-bb8f-523d10ff5829/329534-eng.jpg",
      "lectureTitle": "외워서 끝내는 네트워크 핵심이론 - 기초\n대시보드",
      "lectureFee": 77000,
      "lectureDescription": "입문자를 위해 준비한\n[개발 · 프로그래밍, 네트워크] 강의입니다.\nTCP/IP에서 HTTP까지! 네트워크에 대한 기본 이론이 부족한 분들이 '외워서'라도 전공 이론을 이해하고자 희망하는 분들을 위해 준비한 강의입니다. 할 수 있습니다!\n✍️\n이런 걸\n배워요!\nOSI 7 layer를 외우지 않아도 되는 이유\nTCP/IP 네트워크 구조\n인터넷에 대한 기본 이해\n웹 서비스 시스템의 작동원리\nPort 번호의 역할\nPacket의 생성부터 소멸까지 일련의 과정\n네트워크, 외워서 쉽고 빠르게! \n7시간에 끝내는 TCP/IP 네트워크 & HTTP 👨‍🎓 \n네트워크 이론, \n배우긴 해야 하는데... 😥\n여러분의 네트워크 공부가 어려웠던 이유?\n네트워크는 용어도 개념도 너무 복잡하고 추상적인 것 같아요. \nOSI 7계층이 대체 뭔지... 배우려고 씨름하다 시간만 잡아먹고 포기했어요.\nTCP/IP부터 HTTP까지, 일단 뭐가 뭔지 빠르게 훑어보고 생각할 순 없을까요?\n👉 그렇다면, 공부하는 방법을 바꿔야 합니다!\n네트워크? 길게 생각하지 마세요.\n외워도 끝낼 수 있습니다! 👨‍🎓\nOSI 7 Layer에 대해 공부하다가 네트워크(Network)에 대해 어려움을 느끼고 포기하는 분들이 많습니다. 이유는 매우 간단합니다. 구체적이지 않은, 추상적인 관념을 이해하려 시도했기 때문입니다. 지금 이 글을 읽는 분들께 “사랑이 무엇인가요?” 하고 물으면 쉽게 답할 수 있을까요? 무엇보다 그 답을 ‘정답’이라고 할 수 있을까요? 우리가 네트워크를 어렵게 느끼는 이유는 구체적이지 않은 이론을 이해하려 애쓰기 때문입니다.\n그래서 준비했습니다. 빠르고 효과적으로 네트워크를 공부하고 싶은 분들이시라면, 우선은 먼저 외워서 끝내세요! 너무 오랜 시간 들여 이해하는 것보다 우선 빠르게 외우고, 기초 체력을 기르는 게 더 효과적입니다. 물론 외워서 끝낸다 하더라도 결코 부족하지 않은 이해를 얻을 수 있습니다.\n‘외워서 끝내는 네트워크 핵심이론’ 시리즈 📖\n외워서 끝내는 네트워크 핵심이론 - 기초\n네트워크\n프로토콜\n(72)\n₩77,000\n외워서 끝내는 네트워크 핵심이론 - 응용\n네트워크\n(13)\n₩66,000\n꼭 알아야 할 핵심 내용을 정리하여 빠르게 전달합니다.\n강의에 쓰인 67p 분량의 시각 자료까지 함께 제공합니다.\n이런 분들께 \n추천합니다 👍\nOSI 7 Layer와 씨름하다 \n네트워크를 포기했던 분 \nTCP/IP 네트워크 원리를 \n빠르게 훑고 싶은 분 \n소켓 프로그래밍 개발자 \n(게임 서버 등) \n네트워크 관련 지식이 \n필요한 웹 서비스 개발자 \n✅ 아래 내용을 알고 있다면, 누구나 수강할 수 있어요.\n(섹션 0. [수강 전에 알고 있다고 가정하는 것들] 수업 미리보기를 확인해주세요!)\nbit, byte 등 정보 표현의 단위를 알고 있다.\n1byte는 8bit임을 알고 있다.\nbit 단위 논리연산을 할 수 있다.\n2진수를 16진수로 변환할 수 있다.\n1024MB가 1GB임을 알고 있다.\nProcess와 Program의 차이를 알고 있다.\nOSI 7 Layer라는 말을 들어본 적 있다.\n범용 운영체제에 User mode와 Kernel mode가 존재한다는 걸 알고 있다.\nBuffer의 의미를 알고 있다.\n개념(Abstraction)과 구현(Implementation)의 차이를 안다.\n나는 ‘외워서’라도 네트워크를 잘 알고 싶다!\n이 강의를 만든 \n지식공유자는 👨‍💻\n널널한 개발자 TV의 ‘널널한 개발자’ 최호성입니다.\n(모두가 싫어하는) 국내 최초 PC 방화벽 개발자\n1992년부터 C언어를 공부한 30년 묵은 C/C++ 개발자\n다수 국책과제 수행 경험자이자 15년 이상 개발 강의 경력을 함께 보유한 아저씨!\nC언어 인기 입문서 『독하게 시작하는 C 프로그래밍』 저자\n3만 명 이상이 구독하는 \"널널한 개발자 TV\" 유튜브 채널을 운영하고 있습니다. (바로가기)\n‘네트워크를 위한 기초 체력’을 다질 수 있게 도와드립니다. 😊\n네트워크 공부, 중요하다고들 하죠? 하지만 막상 네트워크를 공부하다 보면 개념적인 측면을 이해하지 못하고 발목이 잡혀 깊이있는 이론으로 나아가지 못하는 경향이 있는 것 같습니다. 그동안 유튜브 채널을 통해 여러 강의를 풀어내면서 네트워크 관련 이해가 어렵다는 많은 분들을 만나보기도 했습니다.\n이해하려 하지 마시고 암기해서 우선 끝을 내세요. 그 암기의 결과로 언젠가 자연스럽게 네트워크를 이해할 수 있도록 도움을 드리는 것이 이번 강의의 목표입니다. 책을 봐도 이해하기 어려운 네트워크를 좀 더 쉽게 이해할 수 있도록 기초 체력을 다짐으로써, 추후 TCP/IP 네트워크 관련 서적을 보거나 조금 더 깊이있는 내용을 공부할 때 그 의미를 좀 더 쉽게 받아들일 수 있게 되기를 바랍니다. 오랫동안 개발에 부딪히며 공부해온 과정에서 제가 알게 된 것들을 빠르게, 그리고 효율적으로 알려드리겠습니다.\n지식공유자가 알려주는\n강의 수강 꿀팁!\n🎓\n이런 분들께\n추천드려요!\nTCP/IP 네트워크의 원리를 배우려는 분\n게임서버를 비롯한 소켓 프로그래밍 개발자\n웹 서비스 시스템 개발자\n📚\n선수 지식,\n필요한가요?\n2진수 16진수 진법변환에 대한 이해, 논리연산(AND, OR, XOR, NOT), 프로세스와 프로그램의 차이, 범용 운영체제 구조(User/Kernel mode 구분)",
      "lectureDifficulty": "입문자"
    }
  },
  {
    "model": "lectures.lecture",
    "fields": {
      "thumbnail": "https://cdn.inflearn.com/public/courses/329170/cover/223c54c0-9220-4937-836d-70a36be3eb1c/329170-eng.png",
      "lectureTitle": "따라하며 배우는 리액트 A-Z\n대시보드",
      "lectureFee": 55000,
      "lectureDescription": "초급자를 위해 준비한\n[프론트엔드, 웹 개발] 강의입니다.\n이 강의를 통해 리액트 기초부터 중급까지 배우게 됩니다. 하나의 강의로 개념도 익히고 실습도 하며, 리액트를 위해 필요한 대부분의 지식을 한번에 습득할 수 있도록 만들었습니다.\n✍️\n이런 걸\n배워요!\n리액트\nNextJS\n타입스크립트\n정적 사이트 자동 배포\n도커\n리액트 기초 개념부터 중급 기술까지\n직접 앱을 만들어보며 배울 수 있어요!\n따라하며 배우는\n리액트 A-Z\n이 강의를 통해서 리액트 기초부터 중급까지의 기술을 익히실수 있습니다. \n리액트를 처음 접하는 사람들도 이 강의 하나로 리액트를 위해 필요한 대부분의 지식을 습득하실수 있습니다. \n하나의 강의로 개념도 익히고 실습도 하며, 리액트를 위해 필요한 대부분의 지식을 한번에 습득할 수 있도록 만들었습니다. 프론트엔드 개발자가 되기 위해 필수처럼 생각되는 리액트를 배워서 취업에 많은 도움이 되었으면 좋겠습니다.\n이 강의만의\n장점을 확인하세요.\n구조적 이해를 돕는 \n도표 중심의 \n쉽고 자세한 설명 \n직접 소스 코드를 \n작성하면서 \n자연스러운 반복 학습 \n실제 애플리케이션을 \n만들어볼 수 있는  \n실습 중심 강의 \n자바스크립트 기초를 뗀 \n초보 개발자라면 \n누구나 OK! \n1-2. 도표를 통한 시각적 설명 + 직접 코드 작성의 2단계!\n도표를 통해서 시각적으로 봤을 때 그냥 설명을 듣기만 했을 때보다 이해가 더 잘 되기 때문입니다. 또한 이렇게 도표를 통해서 학습한 후 소스 코드를 작성하므로 자연스럽게 복습하는 효과가 나타난다고 생각합니다.\n3. 따라하며 배우세요, 실습 중심 강의.\n먼저 필요한 개념을 익힌 후에 실습을 통해 개념을 더욱 확실하게 해줍니다.\n4. 자바스크립트 기초를 알고 있는 학습자에게 적합합니다.\n자바스크립트의 기초를 알고 계시면 이 강의를 듣는데 어려움 없이 들으실 수 있습니다. \n다음 내용을 학습합니다.\n섹션 1) 리액트의 개념에 대해서 배우게 됩니다. \n섹션 2-3) To-Do 앱을 만들며 리액트 기초 개념을 배우며 사용해 봅니다.\n섹션 4-5) 넷플릭스 앱을 만들며 리액트의 좀 더 심화적인 개념을 배우고 사용해 봅니다.\n섹션 6-7) 리액트 테스트에 대해서 기초적인 부분은 배우며 실습으로 간단한 버튼 앱을 만들어 봅니다. \n            섹션 8) NextJS 와 Typescript에 대해서 알아보며 이 둘을 이용한 블로그 앱을 만들어봅니다.\n섹션 9) 리액트의 새로운 버전인 리액트 18버전에서 새로나온 기능과 API에 대해서 알아봅니다.\n섹션 10) 리액트의 대표적인 상태관리 라이브러리인 리덕스에 대해서 알아봅니다.\n섹션 11) 도커로 리액트를 실행하는 법에 대해서 알아봅니다. \n예상 질문 Q&A 💬\nQ. 비전공자도 들을 수 있는 강의인가요?\nA. 기초부터 자세하게 강의하기 때문에 비전공자도 들을수 있습니다.\nQ. 왜 리액트를 배워야 하나요?\nA. 프론트엔드 개발자로서 가장 많이 사용되는 라이브러리 이기에 리액트를 배우는게 취업에 많은 도움이 된다고 생각됩니다.\nQ. 강의를 듣기 전 준비해야 할 것이 있나요?\nA. 기초적인 자바스크립트 개념을 알고 들으면 좋습니다.\n지식공유자의 \n다른 강의가 궁금하다면?\n누적 수강생 32,000+명, 따라하며 배우는 웹 개발 시리즈 📖\nJohn Ahn\n따라하며 배우는 리액트 테스트\n22,000원\n4.7\n(\n41\n)\n+800명\nJohn Ahn\n따라하며 배우는 노드, 리액트 시리즈 - 기본 강의\n무료 강의\n4.9\n(\n804\n)\n+18700명\nJohn Ahn\n따라하며 배우는 리액트, 파이어베이스 - 채팅 어플리케이션 만들기\n31,900원\n4.8\n(\n39\n)\n+800명\n지식공유자가 알려주는\n강의 수강 꿀팁!\n🎓\n이런 분들께\n추천드려요!\n리액트를 처음 배우는 분\n프론트엔드 개발자가 되고 싶은 분\n📚\n선수 지식,\n필요한가요?\n자바스크립트",
      "lectureDifficulty": "초급자"
    }
  },
  {
    "model": "lectures.lecture",
    "fields": {
      "thumbnail": "https://cdn.inflearn.com/public/courses/329032/cover/11fe18ef-5bb2-4e14-850e-2f2122469529/329032-eng.jpg",
      "lectureTitle": "2023년 태블로를 향한 첫 걸음\n대시보드",
      "lectureFee": 55000,
      "lectureDescription": "입문자를 위해 준비한\n[데이터 시각화, 데이터 분석] 강의입니다.\n태블로 자격증에 나오는 내용을 훑으면서, 짧은 시간 안에 태블로의 전반적인 기능에 대해서 파악할 수 있습니다.\n✍️\n이런 걸\n배워요!\nTableau Specialist Desktop 자격증 전범위\n태블로를 통한 데이터 연결\n태블로를 통한 데이터 시각화\n태블로를 통한 인사이트 공유 방법\n태블로 데이터 분석/시각화,\n기초 + 실습을 강의 하나로 잡아보세요! \n태블로, 클릭 몇 번만으로\n쉽게 다룰 순 없을까요?\n강력한 데이터 분석/시각화 툴, 태블로\n태블로(Tableau)는 클릭만으로 간단하게 데이터를 분석하고, 대시보드를 만들 수 있는 편리한 도구입니다. 때문에 코딩은 못하지만 데이터 분석을 하고 싶은 분들께 완벽한 툴이에요. \n하지만 태블로를 켰더니 화면에 이것저것 많아서 어디서부터 시작해야 될지 모르겠나요? 처음 배울 때의 부담감이 크게 다가오나요? 일단은 자격증 시험 범위를 훑는 것을 목표로 시작해봅시다!\n부담은 줄이고, 효율은 더 높일 수 있도록.\n🙋‍♀️ 태블로를 한번에 가볍게 훑어보고 싶은 입문자 \n🙋‍♀️ 클릭만으로 데이터 분석을 하고 싶은 분 \n🙋‍♀️ 태블로에서 어떤 단축키를 써야 유용한지 알고 싶은 분\n우리의 니즈에 맞는 데이터 시각화 및 분석을 할 수 있도록, 이 강의에서는 Tableau Desktop Specialist 자격증 가이드에서 제시한 공식적인 시험범위를 따라갑니다.\n어떠한 지식이든 처음 배울 때엔 어디서부터 시작해야 하는지 막막해지기 마련이죠. 이럴 때 저는 시험을 활용해요. 그러면 자연스럽게 전반적인 개념을 배우면서 중요한 내용은 좀 더 디테일하게, 덜 중요한 내용은 일단 패스하면서 효율적으로 학습할 수 있어요.\n꼭 자격증을 취득하지 않아도 괜찮습니다. 초보자의 마음에서, 처음 배우는 부담감을 덜고 차근차근 태블로에게 가벼운 마음으로 다가갈 수 있도록 이 강의를 기획했습니다. 올해는 꼭, 태블로를 향해 첫 걸음을 떼어보세요!\n태블로로 제작한 지도 기반 분포 시각화 차트\n초보자 눈높이에 딱! 맞춘 \n태블로 첫 걸음\n공식이 제안하는 효율적인 학습 범위\n공식적인 시험 범위를 따라가는 만큼 선택과 집중이 가능합니다. 기본적인 내용부터 시작해 태블로의 구성요소가 무엇을 뜻하는지 알 수 있고, 중간중간 나오는 꿀팁을 통해 빠르고 효과적으로 익힐 수 있어요.\n물론 이 내용을 혼자 일일이 비교하며 공부하기에는 영어나 새로 듣는 용어 때문에 벅차겠죠? 하지만 이 수업에서는 개념 설명과 실습을 병행하기에 수업을 보며 스스로 따라갈 수 있습니다. 더욱이 영어로 된 용어는 한국어로 다시 설명해드림으로써 부담을 덜 수 있도록 구성하였습니다.\n초보자를 생각한 강의 자료 + 숙제 제공\n수강생을 위한 이론 수업 PPT도 제공됩니다. 맨 앞 슬라이드에는 태블로 핵심 용어가 적혀 있어 앞으로 무엇을 다루는지, 어떤 개념과 기능이 중요한지 한 눈에 확인 가능합니다.\n태블로 자격증 가이드에서 발췌한 목차와 함께, 마지막 슬라이드에서는 강의에서 다뤘던 내용을 연결해 복습하는 섹션까지 마련되어 있습니다. 아울러 혼자서 학습하면서 태블로를 연습할 수 있도록 섹션별 숙제 및 솔루션을 제공합니다. 여러분의 태블로 실력을 직접 점검해보세요!\n상세 커리큘럼\n강의는 크게 4가지 Part로 나뉩니다.\nPart 1. \n태블로 기본 개념 이해\n태블로가 가지는 기본 개념에 대해 다룹니다. Dimension vs Measure / Discrete vs Continuous 등 용어 정리를 하면서 다음 Part에 들어갈 준비를 합니다.\nPart 2. \n데이터 분석\n기본적인 태블로 차트(예: Bar chart, Line chart, Scatterplot, Map 등)와 그 위에 적용하는 태블로의 기능에 대해 단계적으로 배웁니다.\n다양한 시각화 방법과 디테일한 분석을 다루기 때문에, 이 파트가 가장 중요합니다. Part 1~2까지 듣는다면, 엑셀 정도의 크지 않는 데이터를 혼자 분석할 수 있는 실력이 됩니다.\nPart 3.\n인사이트 공유\n데이터를 통해 발견한 인사이트를 효과적으로 다른 사람에게 공유하는 태블로만의 방법에 대해서 다룹니다.\n우리가 데이터를 분석하는 최종 목표는 결국에는 자신이 찾은 인사이트를 다른 사람에게 공유하기 위해서일 것입니다. Part 2까지 배운 내용을 통해 찾은 인사이트를 태블로의 Dashboard, Story 기능을 통해 공유하는 방법에 대해 배울 것입니다.\nPart 4. \n데이터 연결\n2개 이상의 데이터 파일을 합칠 때 필요한 방법에 대해서 배웁니다. 대부분은 하나의 데이터 파일을 다루기 때문에 모든 수강생들에게 필요한 내용은 아니지만, 부담없이 익혀두면 유용하게 쓸 수 있는 새로운 기능에 대해 배워봅시다.\n태블로 개념 용어 정리 (Measure / Dimension)\n중요 개념 복습\nQ&A 💭\nQ. 태블로를 배우면 뭐가 좋은가요?\n데이터는 5개 이상만 넘어가도 눈으로 의미를 파악하기 힘듭니다. 천 개, 만 개에 육박하는 수많은 데이터라면 도구의 도움 없이는 형체를 파악하기 어렵습니다. 하지만 태블로를 배우면 몇 번의 클릭만으로도 한 눈에 빅데이터의 성격을 파악할 수 있습니다. 이런저런 방법을 적용할 때마다 새롭게 톡 튀어나오는 인사이트를 알아가는 재미까지 느낄 수 있습니다.\nQ. 비전공자도 들을 수 있는 강의인가요?\n네, 이 강의는 입문자용입니다. 클릭으로 엑셀을 처음 배울 때의 느낌처럼 태블로에 다가가시면 됩니다!\nQ. 이 강의를 다 듣고 나면 수강생인 저는 어느 수준까지 올라갈 수 있나요?\n강의의 앞 50%를 잘 따라오시면 태블로로 혼자서 원하는 데이터를 분석할 수 있는 수준이 됩니다. 나머지 50%까지 완수하시면, 다른 사람에게 내 인사이트를 공유할 수 있는 수준이 됩니다.\n지식공유자가 알려주는\n강의 수강 꿀팁!\n🎓\n이런 분들께\n추천드려요!\n코딩을 못하지만 데이터 분석을 하고 싶은 사람\n태블로 자격증을 훑고 싶은 사람",
      "lectureDifficulty": "입문자"
    }
  },
  {
    "model": "lectures.lecture",
    "fields": {
      "thumbnail": "https://cdn.inflearn.com/public/courses/327901/cover/d0f80fce-6877-4058-91bb-dc1ef57339a2/327901-eng.png",
      "lectureTitle": "스프링 핵심 원리 - 고급편\n대시보드",
      "lectureFee": 121000,
      "lectureDescription": "중급자를 위해 준비한\n[백엔드, 웹 개발] 강의입니다.\n스프링의 핵심 원리와 고급 기술들을 깊이있게 학습하고, 스프링을 자신있게 사용할 수 있습니다.\n✍️\n이런 걸\n배워요!\n핵심 디자인 패턴\n스프링 고급 기능\n스프링 AOP\n핵심 디자인 패턴, 쓰레드 로컬, 스프링 AOP\n스프링의 3가지 핵심 고급 개념 이해하기\n📢 수강 전 확인해주세요!\n본 강의는 자바 스프링 완전 정복 시리즈의 8번째 강의입니다. 우아한형제들 최연소 기술이사 김영한의 스프링 완전 정복 로드맵을 먼저 확인해주세요. (바로가기)\n  스프링 핵심 원리 - 기본편\n객체 지향 설계와 스프링\nSOLID - SRP, OCP, DIP\n스프링 컨테이너와 스프링 빈\n스프링 컨테이너 - IoC, DI\n의존관계 주입\n빈 생성주기와 스코프\n스프링 핵심 원리 - 고급편 현재 강의\n스프링 핵심 디자인 패턴\n템플릿 메서드 패턴, 전략 패턴, 템플릿 콜백 패턴, 프록시 패턴, 데코레이터 패턴\n쓰레드 로컬\n동시성 문제, 멀티쓰레드, 쓰레드 로컬\n스프링 AOP\n개념, 동작 원리, 실전 예제, 주의 사항\n김영한의 스프링 핵심 원리 고급편\n핵심 디자인 패턴, 쓰레드 로컬, 스프링 AOP\n실무에서 가장 많이 사용하는 기술\n스프링 프레임워크\n실력 있는 개발자가 되려면 실무에서 자주 사용하는 도구를 깊이 있게 이해해야 합니다.\n스프링은 실무에서 가장 많이 사용하는 백엔드 기술입니다.\n따라서 백엔드 개발자라면 스프링을 깊이 있게 이해하는 것이 중요합니다.\n스프링 핵심 원리\n기본에서 고급으로\n우리는 앞서 스프링 핵심 원리 - 기본편에서 스프링과 객체 지향 개발의 기본기를 학습했습니다.\n스프링을 깊이 있게 이해하고, 실무에서 실력 있는 개발자가 되려면, 기본편에서 학습한 내용을 기반으로 크게 3가지 핵심 고급 개념을 알아야 합니다. 이번 스프링 핵심 원리 - 고급편에서는 이러한 고급 개념을 학습합니다.\n1. 스프링 핵심 디자인 패턴\n2. 동시성 문제를 다루기 위한 쓰레드 로컬\n3. 스프링 AOP\n스프링 핵심 원리\n고급편\n1. 스프링 핵심 디자인 패턴\n스프링의 내부 기술들은 몇 가지 핵심 디자인 패턴으로 만들어져 있습니다. 따라서 스프링을 깊이 있게 이해하기 위해서는 먼저 스프링이 자주 사용하는 핵심 디자인 패턴들을 알아야 합니다.\n강의에서 전달하는 핵심 디자인 패턴\n템플릿 메서드 패턴\n전략 패턴\n템플릿 콜백 패턴\n프록시 패턴\n데코레이터 패턴\n강의에서는 이러한 디자인 패턴들을 예제 코드로 하나하나 만들어보면서 아주 쉽게 설명해드립니다. 그리고 이렇게 학습한 디자인 패턴을 애플리케이션에 적용하는 방법도 알아봅니다.\n2. 쓰레드 로컬\n스프링은 주로 웹 애플리케이션 개발에 사용됩니다. 웹 애플리케이션은 동시에 여러 요청을 처리하기 위해 멀티쓰레드를 사용합니다. 따라서 여러 쓰레드가 경합하는 동시성 문제가 발생할 수 있습니다.\n강의에서 전달하는 동시성 문제와 쓰레드 로컬 내용\n웹 애플리케이션\n멀티쓰레드\n동시성 문제\n강의에서는 스프링을 사용할 때 발생하는 동시성 문제를 알아보고, 또 동시성 문제를 편리하게 해결할 수 있는 쓰레드 로컬 개념까지 학습합니다. \n쓰레드 로컬은 멀티쓰레드 환경에서 스프링이 어떻게 동시성 문제 없이 잘 작동하는지 이해하기 위한 필수 개념입니다.\n3. 스프링 AOP\n스프링 AOP는 실무에서 정말 많이 사용되는, 마치 마법처럼 느껴질 정도로 편리한 기술입니다. 많은 개발자가 스프링 AOP를 사용하지만, 스프링 AOP가 어떻게 동작하는지 그 원리를 정확하게 이해하고 사용하는 개발자는 많지 않습니다.\n단순히 스프링 AOP의 기능만 알고 사용하는 단계를 넘어서, 스프링 AOP의 동작 원리를 깊이 있게 이해해야 장애가 발생했을 때 근본적인 문제 해결이 가능합니다.\n강의에서 전달하는 스프링 AOP 내용\n개념, 용어정리\n프록시 - JDK 동적 프록시, CGLIB\n동작 원리\n실전 예제\n실무 주의사항\n강의에서는 스프링 AOP의 단순한 기능 정리를 넘어서 동작 원리부터 실전 예제, 그리고 실무에서 자주 발생하는 주의 사항까지 스프링 AOP의 모든 것을 정리해드립니다.\n기타\n추가로 스프링 컨테이너의 고급 기술인 빈 후처리기와 스프링 애플리케이션을 개발하는 다양한 실무 팁도 전해드립니다.\n스프링 컨테이너의 확장 포인트 - 빈 후처리기\n스프링 애플리케이션을 개발하는 다양한 실무 팁\n이 강의를\n시작하기 전에\n고급편인 만큼 이 강의에서 다루는 내용들은 쉬운 내용들이 아닙니다.\n하지만 실력 있는 백엔드 개발자가 되려면 반드시 한번은 공부해야 하는 내용입니다.\n포기하지 않고 이 강의를 끝까지 따라오시면 여러분은 개발자로서 엄청난 내공 상승을 경험하고 누구보다 자신있게 스프링을 사용하실 수 있게 됩니다.\n어려운 내용이니만큼 저도 철저하게 강의를 준비했습니다. 여러분이 이 내용들을 본인 것으로 완성할 수 있게 도와드리겠습니다.\n이 강의를\n이런 분들께 추천합니다\n스프링을 더 깊게\n알고 싶은데…\n스프링의 고급 개념을\n학습함으로써 실력을\n더 키우고 싶은 분\n스프링 AOP를\n사용하기는 하는데…\n스프링 AOP의 동작\n원리를 정확하게\n이해하고 싶은 분\n스프링을 코드로\n이해하고 싶은데…\n디자인 패턴을 통해\n스프링의 내부 기술을\n이해하고 싶은 분\n스프링으로 웹 앱을\n만들 생각인데…\n쓰레드 로컬을 통해\n스프링 동시성 문제를\n이해하고 싶은 분\n앞으로 이어질\n스프링 완전 정복 시리즈\n스프링을 완전히 마스터할 수 있는 시리즈를 준비하고 있습니다. 실제 실무에서 사용하는 핵심 스프링 기능을 중심으로, 실무에서 쓰이지 않거나 오래된 기능은 과감하게 생략한 실무 노하우를 전수해드릴 예정입니다.\n강의 순서\n스프링 입문 - 코드로 배우는 스프링 부트, 웹 MVC, DB 접근 기술 \n스프링 핵심 원리 - 기본편\n모든 개발자를 위한 HTTP 웹 기본 지식\n스프링 MVC 1편 - 백엔드 웹 개발 핵심 기술\n스프링 MVC 2편 - 백엔드 웹 개발 활용 기술\n스프링 DB 1편 - 데이터 접근 핵심 원리\n스프링 DB 2편 - 데이터 접근 활용 기술\n스프링 핵심 원리 - 고급편\n실전! 스프링 부트  출시 예정  \n이 강의와 관련된\n강의 로드맵\n김영한의 스프링 완전 정복 시리즈\n스프링 핵심 원리~실전 활용이 강의 포함\n스프링 부트 + JPA 실무 완전 정복\n내공있는 백엔드 최신 실무 기술실전 심화편\n지식공유자가 알려주는\n강의 수강 꿀팁!\n🎓\n이런 분들께\n추천드려요!\n스프링을 깊이있게 이해하고 싶은 개발자\n스프링을 코드로 쉽게 이해하고 싶은 개발자\n개발자 취업 준비생\n스프링을 공부했지만 어려워서 포기했던 개발자\n실무에서 스프링을 사용하지만 스프링의 핵심 원리를 제대로 이해하고 사용하고 싶은 개발자\n📚\n선수 지식,\n필요한가요?\n자바 언어\n스프링 핵심 원리 - 기본편",
      "lectureDifficulty": "중급자"
    }
  },
  {
    "model": "lectures.lecture",
    "fields": {
      "thumbnail": "https://cdn.inflearn.com/public/courses/326674/cover/4657d793-56a4-42f3-9d44-dc88d125a49e",
      "lectureTitle": "스프링 MVC 1편 - 백엔드 웹 개발 핵심 기술\n대시보드",
      "lectureFee": 99000,
      "lectureDescription": "초급자를 위해 준비한\n[백엔드, 웹 개발] 강의입니다.\n웹 애플리케이션을 개발할 때 필요한 모든 웹 기술을 기초부터 이해하고, 완성할 수 있습니다. 스프링 MVC의 핵심 원리와 구조를 이해하고, 더 깊이있는 백엔드 개발자로 성장할 수 있습니다.\n✍️\n이런 걸\n배워요!\n자바 백엔드 웹 기술\n스프링 웹 기술\n스프링 MVC\n원리를 알아야 핵심이 보인다!\n김영한의 스프링 MVC 기본편 👨‍💻\n📌 수강 전 확인해주세요!\n본 강의는 자바 스프링 완전 정복 시리즈의 네 번째 강의입니다. 우아한형제들 최연소 기술이사 김영한의 스프링 완전 정복 로드맵을 먼저 확인해주세요. (바로가기)\n가장 인기 있는 웹 프레임워크\n현대의 애플리케이션은 대부분 웹 환경에서 동작하는 웹 애플리케이션입니다. 자바 백엔드 개발자는 이러한 웹 애플리케이션을 개발할 때, 대부분 스프링 MVC를 사용합니다. 스프링 MVC는 복잡한 웹 애플리케이션을 쉽고 빠르게 개발할 수 있게 도와주는, 가장 인기 있는 웹 프레임워크입니다.\n백엔드 웹 기술을 학습하기 어려운 이유\n자바 백엔드(Java Backend) 웹 기술은 매우 방대하고 공부할 분량도 많습니다. 특히 스프링 MVC는 제공하는 기능도 많고, 구조도 복잡합니다. 이런 웹 기술을 학습하기 어려운 이유는 다음 3가지 때문입니다.\n1. HTTP 기반 지식이 약하다\n모든 웹 기술은 HTTP를 기반으로 합니다. 따라서 HTTP 기반 지식이 약하면 웹 기술을 깊이있게 학습하기 어렵습니다. HTTP 기반 지식이 약하다면 이 강의를 학습하기 전에 먼저 모든 개발자를 위한 HTTP 웹 기본 지식 강의를 학습하기 바랍니다.\n모든 개발자를 위한 HTTP 웹 지식선수 지식\n실무 개발에 꼭 필요한 HTTP의 핵심\n2. 자바 백엔드 웹 개발의 역사가 너무 오래 되었다\n자바 백엔드 웹 개발의 역사는 이미 20년이 넘었습니다. 오랜시간 동안 불편한 점들을 개선하고, 발전하면서 너무 많은 것이 자동화 되고, 추상화 되었습니다.\n특히 최근에 웹 개발을 시작한 개발자들은 웹 프레임워크가 제공하는 기능들을 사용할 때, 왜 이런 방식으로 기능을 제공하는지 정확한 이유를 모르고 단순 사용법 위주로 학습하게 됩니다. ‘왜 이런 방식으로 사용하지?’ 하고 의문을 가져도 과거에 어떤 불편한 문제 때문에 지금 이런 방식으로 개선되고 사용하는지, 과거의 문맥을 제대로 이해하고 사용하기는 어렵습니다.\n3. 스프링 MVC가 제공하는 기능이 너무 방대하다\n스프링 MVC는 백엔드 웹 기술에 필요한 거의 모든 기능을 제공합니다. 그만큼 방대하고, 학습할 내용도 많습니다. 자바 백엔드 웹 기술의 발전과 함께 스프링 MVC도 수많은 기능이 추가되고 발전했습니다. 하지만 스프링 MVC 프레임워크의 기본 구조는 탄탄하게 잘 설계되어서, 지금까지 수많은 기능이 추가되어도 그 기본 구조는 거의 변하지 않았습니다. 따라서 스프링 MVC의 기본 구조를 확실하게 이해하는 것이 매우 중요합니다.\n강의 특징\n자바 웹 기술의 시작부터 최신 실무 기술까지\n이 강의는 20년 전으로 돌아갑니다. 자바 웹 기술의 기초라 할 수 있는 서블릿부터 시작해서 JSP, MVC 패턴, MVC 프레임워크, 그리고 스프링 MVC의 탄생부터 실무에서 주로 사용하는 최신 스프링 MVC의 사용법까지, 모든 것을 코드로 여러분과 함께 만들어보면서 단계적으로 알아갑니다. 과거에 어떤 불편한 점이 있어서 다음 기술이 탄생했고, 어떤 점들이 개선되었는지 그 이유를 직접 코딩하면서 자연스럽게 이해할 수 있습니다.\nMVC 프레임워크를 직접 코드로 개발\n스프링으로 웹 애플리케이션을 제대로 개발하려면, 스프링 MVC의 핵심 구조를 한번은 제대로 파악해야 합니다. 그런데 스프링 MVC에는 수 많은 기능이 자동화되고, 추상화되어 있기 때문에 핵심 구조를 파악하기가 쉽지 않습니다.\n여러분과 저는 스프링 없이 직접 스프링 MVC의 핵심 기능을 만들어봅니다. 단순히 머리로 MVC 프레임워크를 이해하는 것이 아니라, 완전히 처음부터 MVC 프레임워크를 새로 개발합니다. 그리고 단계적으로 MVC 프레임워크를 발전시켜 나가는 과정을 통해 자연스럽게 스프링 MVC의 내부 구조가 왜 이렇게 설계되었는지 깊이있게 이해할 수 있습니다.\n강의 목표\n목표: 실무 백엔드 웹 애플리케이션을 개발할 때 필요한 모든 웹 기술을 완성하는 것이 이 강의의 목표입니다.\n웹 기초부터 실무까지: 실무 개발을 위한 내용이 많지만, 웹 애플리케이션 개발 경험이 없는 개발자도 적응할 수 있게 단계적으로 구성하였습니다.\n자바 웹 기술 이야기: 서블릿, JSP 처럼 자바 기본 웹 기술부터 시작해서 왜? 스프링 MVC가 나오게 되었는지를 설명합니다. \n실무 예제 중심: 실무에서 스프링으로 웹 애플리케이션을 개발할 때 필요한 모든 과정을 예제를 통해 자연스럽게 학습하며, 실무 베스트 프랙티스를 전수해드립니다.\n간결함: 실무에서 사용하지 않는 오래된 스프링 MVC 기능은 과감하게 제외했습니다. 최신 실무에 주로 사용하는 내용 중심으로 설명합니다.\n자바 웹 기술을 모두 설명하려면 수백시간도 부족합니다. 이 강의는 모든 것을 설명하기 보다는 자바 백엔드 웹 개발의 핵심 뼈대를 세우고, 그 위에 실무에 꼭 필요한 웹 기술을 위주로 설명합니다. 이 강의가 끝나면 여러분은 튼튼한 기반 지식을 바탕으로 스프링 백엔드 웹 애플리케이션을 자신있게 개발할 수 있습니다.\n스프링 MVC 강의 구성\n스프링 MVC 강의는 1, 2편으로 나누어져 있습니다.\n본 강의는 스프링 MVC 1편 - 백엔드 웹 개발 핵심 기술입니다.\n스프링 MVC 1편 - 백엔드 웹 개발 핵심 기술현재 강의 \n자바 웹 기술과 스프링 MVC의 핵심 개념을 다지고, 스프링 MVC의 기본 기능을 이해합니다.\n1편은 먼저 자바 백엔드 웹 기술을 소개하고, 서블릿, JSP, MVC 패턴, MVC 프레임워크까지 웹 기술 전반을 학습합니다. 이렇게 웹 기술의 배경을 이해한 다음에 스프링 MVC의 핵심 개념을 단단히 다집니다. 이후 스프링 MVC의 기본 기능 기능을 학습하고, 스프링 MVC를 사용해서 기본 CRUD가 가능한 웹 페이지도 개발합니다.\n스프링 MVC 2편 - 백엔드 웹 개발 활용 기술\n스프링 MVC의 다양한 활용 기술을 학습합니다. \n2편은 타임리프, 메시지, 국제화, 검증(Validation), 쿠키, 세션, 필터, 인터셉터, 예외 처리와 공통 기능, 확장 포인트 등 하나의 예제를 점진적으로 발전시키면서, 스프링 MVC의 다양한 활용 기술을 코드로 학습합니다.\n앞으로 이어질\n스프링 완전 정복 시리즈\n스프링을 완전히 마스터할 수 있는 시리즈를 준비하고 있습니다. 실제 실무에서 사용하는 핵심 스프링 기능을 중심으로, 실무에서 쓰이지 않거나 오래된 기능은 과감하게 생략한 실무 노하우를 전수해드릴 예정입니다.\n강의 순서\n스프링 입문 - 코드로 배우는 스프링 부트, 웹 MVC, DB 접근 기술 \n스프링 핵심 원리 - 기본편\n모든 개발자를 위한 HTTP 웹 기본 지식 \n스프링 MVC 1편 - 백엔드 웹 개발 핵심 기술  현재 강의 \n스프링 MVC 2편 - 백엔드 웹 개발 활용 기술\n스프링 DB 1편 - 데이터 접근 핵심 원리\n스프링 DB 2편 - 데이터 접근 활용 기술\n스프링 핵심 원리 - 고급편\n실전! 스프링 부트   출시 예정   \n연관 로드맵\n스프링 완전 정복 시리즈 \n스프링, 핵심 원리부터 실전 활용  이 강의 포함 \n스프링 부트 + JPA 실무 완전 정복 \n최신 실무 기술로 웹 앱을 만들며 학습  실전 심화 단계 \n지식공유자가 알려주는\n강의 수강 꿀팁!\n🎓\n이런 분들께\n추천드려요!\n스프링 MVC를 처음 접하는 개발자\n개발자 취업 준비생\n스프링 MVC를 깊이 이해하고 싶은 현업 개발자\n스프링으로 웹 애플리케이션을 만들고 싶은 개발자\n📚\n선수 지식,\n필요한가요?\n자바 언어\n스프링 기본 지식\nHTTP 기본 개념",
      "lectureDifficulty": "초급자"
    }
  },
  {
    "model": "lectures.lecture",
    "fields": {
      "thumbnail": "https://cdn.inflearn.com/public/courses/324941/course_cover/a8153884-2434-4e0d-a6af-edeb9f2d267d/rookiss-rpg-4-1.jpg",
      "lectureTitle": "[C#과 유니티로 만드는 MMORPG 게임 개발 시리즈] Part4: 게임 서버\n대시보드",
      "lectureFee": 88000,
      "lectureDescription": "중급자를 위해 준비한\n[게임 프로그래밍, 백엔드] 강의입니다.\n네트워크/멀티쓰레드/운영체제 등 핵심 전공 지식을 공부하고 게임 서버를 바닥부터 만들어보면서 MMORPG 기술을 학습하는 강의입니다.\n✍️\n이런 걸\n배워요!\nC#\nMMORPG\n게임 서버\nMMORPG 개발에 필요한 모든 기술,\nC# + Unity로 Step By Step! 🕹️\n기초부터 끝판왕까지, MMORPG 개발하기 🎮 \n아무런 지식도 없다는 가정하에 누구나 부담없이 차근차근 수강할 수 있도록 구성된 게임 개발 강의입니다. 최종적으로는 500~1000명의 유저를 수용할 수 있는 MMORPG 인디게임을 출시하는 것을 목표로 합니다.\n이번 시리즈에서는 C#과 유니티(Unity)를 이용하여 유니티에서 제공하는 무료 에셋을 토대로 2D 로그라이크 게임을 만들어 볼 수 있도록 단계별로 필요한 기술을 학습합니다. 함께 도전해볼까요?\n이런 걸 만들 수 있어요 ✨\n▲ 간단한 에셋을 가지고 RPG 게임의 필수적인 기능을 구현해보세요. \n(샘플 포트폴리오 클립: 2015년 N사 신입 채용 서류전형에 통과했던 실제 포트폴리오입니다.)\n▲ 온라인 멀티플레이 게임을 만드는 핵심 서버 연동 기술까지 배우게 됩니다.\n학습 내용 📚 \nPart1 : C# 프로그래밍 입문\nPart2 : 자료구조와 알고리즘\nPart3 : 유니티 엔진\nPart4 : 게임 서버 (네트워크, 멀티쓰레드, OS) 현재 강의\nPart5 : 데이터베이스(SQL Server)\nPart6 : 웹서버 (ASP.NET Core Blazor, WebApi)\nPart7 : MMORPG 컨텐츠 구현 (Unity + C# 서버 연동)\nPart8 : Entity Framework Core (.NET ORM)\nPart9 : MMORPG 컨텐츠 구현 (DB 연동 + 대형 구조 관리 + 라이브 준비)\n번외편 : AWS로 시작하는 서버 운영\n번외편 : ASP.NET Core 심화편\n어디에서도 볼 수 없었던,\n그래서 더욱 궁금했던 <게임 서버> 강의\nPart4는 MMORPG의 꽃, 게임 서버를 설계하고 구현하는 강의입니다. 클라이언트 관련 지식은 비교적 흔하게 찾을 수 있지만, 게임 서버는 전문적인 서적이나 강의를 찾아보기 힘듭니다. 왜 그럴까요? 게임 서버를 제작하기 위해선 여러 방면의 지식이 필요한데 이것을 처음부터 끝까지 체계적으로 정리해서 설명하기가 매우 힘들기 때문입니다. \n이번 강의에서는 서버를 구현하는 데 있어 가장 핵심적인 부분들을 자연스럽게 학습할 수 있도록 커리큘럼에 특히나 신경을 썼습니다. 서버 개발에 필요한 중요한 내용을 간단명료하게 다뤄서 추후 본인만의 스타일을 찾아 나가는 데 훌륭한 길잡이 역할을 하게 될 것입니다.\n다음 순서로 학습해보세요!\n개론 👉 멀티쓰레드 👉 네트워크 👉 패킷 직렬화 👉 Job Queue 👉 유니티 연동\n파트4, 이런 분들께 추천합니다!\n게임 서버 지식이\n없는 클라 개발자\nMMORPG 서버\n만들고픈 분\n유니티 - 서버 연동 \n배우고픈 분\nQ&A 🙋‍♀️\nQ. 강의 환경이 무엇인가요?\nA. 모든 시리즈는 Windows 환경이라 가정하고 제작이 되었으며, macOS에 대한 부가적인 설명은 없습니다.\nQ. 비전공자도 들을 수 있나요?\nA. 선수 지식이 아예 없다고 가정을 하고 진행하기에 아무런 문제 없습니다.\nQ. 이 강의를 시작하게 된 계기를 소개해주세요.\nA. 개인적으로 서버 공부를 시작하면서 참고할 자료가 없어서 어려웠던 기억이 있습니다.\n취업 후 실제 돌아가는 라이브 MMORPG 코드를 비교하며 보면서, 헤딩을 통해 만든 제 코드의 잘못된 점을 많이 깨닫게 되었습니다. MMORPG 개발에 관한 전반적인 내용을 기초부터 끝까지 간략하게 다루는 수업이 있었으면 시간도 절약하고 덜 고생했을 것 같다는 생각을 했습니다.\n이 수업이 여러분들에게 MMORPG 게임 입문의 길잡이 역할을 해줄 것으로 기대합니다.\nQ. C++이나 언리얼 엔진은 사용하지 않나요?\nA. [인디 게임을 위한 C#/Unity를 이용한 버전(해당 시리즈)]과 [취업을 위한 C++/UE4 버전]으로 구분해서 제작할 예정입니다.\nMMORPG는 네트워크, OS, 멀티쓰레드, 웹, 클라이언트 엔진, 등등 다뤄야 할 내용이 굉장히 많은데, C++ 기반으로 진행할 경우 난이도가 높아서 입문자에겐 적합하지 않습니다. 특히 게임 개발에 대한 지식이 없다면 C# 버전으로 먼저 전체적인 숲을 훑어 보시기 바랍니다.\nQ. 하나의 Part를 구매하면 다른 Part는 무료인가요?\nA. 각 파트는 독립적으로 제작되어 별도로 판매됩니다.\nC# + 유니티 게임 개발 로드맵 🏃‍♂️\n▲ 로드맵을 통해 〈C#과 유니티로 만드는 MMORPG 게임 개발 시리즈〉 파트 1~9까지 전체 시리즈 과정을 학습할 수 있습니다. (클릭하면 바로가기: 번외편은 포함되지 않습니다.)\n지식공유자가 알려주는\n강의 수강 꿀팁!\n🎓\n이런 분들께\n추천드려요!\nMMORPG 기술에 관심이 많은 사람\n서버에 대한 지식이 없는 클라이언트 개발자\n📚\n선수 지식,\n필요한가요?\n기본적인 C# 이해도",
      "lectureDifficulty": "중급자"
    }
  },
  {
    "model": "lectures.lecture",
    "fields": {
      "thumbnail": "https://cdn.inflearn.com/public/courses/330567/cover/a1307534-8c5d-4c1f-9a0b-17b5f5cd9152/330567-eng.png",
      "lectureTitle": "Entity Framework Core DB 성능 튜닝 (for SQL Server)\n대시보드",
      "lectureFee": 165000,
      "lectureDescription": "중급자를 위해 준비한\n[데이터베이스] 강의입니다.\n.NET Entity Framework Core로 데이터베이스 프로그래밍을 구현할 때 DB와 쿼리 성능 이슈들을 이해하고 이를 개선해서 더 좋은 성능과 더 안정적인 EF Core 프로그래밍을 할 수 있는 방법들을 배울 수 있습니다.\n✍️\n이런 걸\n배워요!\nEF Core DB Model 성능 고려 사항\nEF Core 자동 생성 쿼리의 성능 이슈와 해결 방안 학습\nDB 성능 향상에 필요한 EF Core 및 SQL Server 기능 학습\n.NET EF/EF Core 기반 성능 튜닝, \n더 안정적으로 & 더 강력하게! \n더 강력한 .NET 개발, \n핵심은 쿼리에 있습니다!\n“EF Core에서 생성되는 모든 쿼리가 좋은 형태는 아니다.”\n.NET EF 또는 EF Core(혹은 유사한 ORM 환경)를 사용한 애플리케이션에서 자동 생성되는 쿼리나 쿼리의 처리 방식이 SQL Server 입장에서 적절치 않은 관계로 데이터베이스나 쿼리 성능의 영향을 끼치는 경우가 적지 않습니다. 데이터 변경과 트랜잭션 처리에서는 더 민감합니다. 더불어 쿼리의 추적, 수정과 같은 관리의 어려움으로 인해 DB 운영자들이 불편함을 호소하는 것이 일반적입니다.\n.NET Entity Framework Core 기반 DB 프로그래밍 성능 튜닝 방법\n이 강의에서는 .NET 개발자에게 좋은 프로그래밍 도구인 EF Core를 더 성능 좋은 쿼리, 더 안정적인 처리 방식으로 구현할 수 있도록 현재의 성능 이슈를 이해하고 그 해결 방안을 공유하고자 합니다 더불어 최신 버전(V7)의 향상된 기능들도 소개합니다.\n이런 분들께 \n추천합니다.\n.NET 개발자\nEF Core 개발자 \n또는 사용자 \nEF 또는 EF Core \n환경에서 운영되는 \n시스템 관리자 \nEF Core의 DB 성능에 \n관심 있는 사용자 \n💬 “.NET 개발 초보이고 EF Core는 처음인데 수강을 해도 될까요?”\n.NET과 EF Core의 경험이 있으면 내용을 이해하는데 수월하실 겁니다. 다만 EF Core가 처음인 사용자를 위해서 도움이 될 만한 학습 자료들도 같이 소개했습니다. 선수 학습 자료로 참조해서 미리 학습하시면 도움이 되실 겁니다. 또한 예제 프로젝트가 콘솔 애플리케이션으로 구성되어 있어 상대적으로 쉽게 접근할 수 있습니다.\n💬 “EF Core 버전에 따라서도 차이가 있을까요?”\n  자료와 데모는 EF5부터 최근의 EF7까지를 다루며, 새로운 버전의 개선된 기능과 차이점도 소개하므로 구분해서 볼 수 있습니다. 중요 기능에 대해서는 도입 버전을 함께 기술했으므로 판단에 도움이 되실 겁니다.\n한 단계 성장한 스스로를\n만날 수 있습니다.\nEF Core에서 성능이 더 뛰어난, 적절한 쿼리를 생성하도록 프로그래밍할 수 있습니다.\nEF Core에서 Insert/Update/Delete 및 트랜잭션, 잠금 처리를 보다 안정적으로 구현할 수 있습니다.\n성능 이슈가 예상되는 쿼리에 대해 DB 담당자 및 유관 부서, 실무자 등과 협의하고 문제를 방지할 수 있습니다.\nSQL Server 쿼리 추적\n집합 연산 및 중복(distinct) 처리\n💡 실무 개발에 꼭 필요한 쿼리 성능 이슈 해결 노하우\n.NET EF Core의 구현 방식 또는 Lambda/LINQ 식의 형태에 따라 자동 생성되는 쿼리의 유형이 달라지고 이로 인해 쿼리 성능이나 DB 성능에 영향을 미칩니다. 본 교육에서는 EF Core 구현에 따른 자동 생성 쿼리의 내용과 성능 상의 이슈들을 살펴보고 이를 해결하기 위한 방법들을 배울 수 있습니다. 또한 데이터 변경(DML) 작업이나 트랜잭션 처리 이슈로 인해 실무에서 발생되는 중요 문제들을 이해할 수 있습니다.\n특히 SQL Server를 전문적으로 오랫동안 컨설팅하고 강의해 온 지식공유자가 각 주제별로 실무에서 공통적으로 나타나는 상황을 예제로 사용하므로 실무 활용에 직접적으로 도움이 될 수 있도록 구성하였습니다.\n상세 커리큘럼 ✅\nQ&A 💬\nQ.  비전공자도 들을 수 있는 강의인가요?\n .NET과 SQL의 기초가 있다면 들을 수 있습니다, 조금 부족하더라도 수강 중에 필요한 기초를 병행 학습하시면 될 겁니다.\nQ. 강의를 듣기 전 준비해야 할 것이 있나요?\n혹시 .NET EF Core 입문자라면 과정 앞 부분에서 소개하는 사전 학습용 자료를 살펴보고 따라해 보십시오. 데모용 DB, EF Core 샘플 프로젝트를 포함한 기타 자료들도 미리 다운로드 해 두시면 됩니다. 데모 DB 구성과 내용은 교육에서 설명 드립니다. 또한 DB로 사용하기 위한 SQL Server와 SSMS와 같은 관리 도구도 필요하니 미리 설치해 두시기 바랍니다\nQ. 수강 전 갖춰야 할 환경이 있나요?\nVisual Studio (Community Edition 이상)와 SQL Server가 필요합니다. 가능하면 최신 버전이 좋습니다. 과정 앞 부분에서 .NET 입문자를 위해 Visual Studio 다운로드 및 구성에 대해서도 간략하게 소개와 데모를 보여드립니다\n이 강의의 지식공유자를 \n소개합니다.\n김정선SQL\n이력 사항\n㈜씨퀄로(www.sqlroad.com ) 대표컨설턴트/이사 (2005년부터)\nSQL Server 컨설팅, 기술지원, 강의, 솔루션 개발\nSQLBigEyes (SQL Server 성능 모니터링 솔루션, www.sqlbigeyes.com ) 개발   \nSQLBigEyes (SQL Server 성능 모니터링 솔루션, www.sqlbigeyes.com ) 개발\nMicrosoft Data Platform MVP\n2002년부터 (현재 2022년 기준) 21년간 수상, 2008년 MVP 공로상 수상\n자격 및 인증\nMCT, Azure DBA, MCITP 외 다수\n강의 활동 (1999년부터)  \n부산정보산업진흥원, 스킬서포트교육센터, 러닝웨이코리아교육센터, 삼성멀티캠퍼스 외 다수\nSQL Server 자체 개발 과정 진행(쿼리 튜닝, DB 튜닝, 대용량 데이터 핵심 기술 이해 등)\n외부 활동\nSQL Server MVP Deep Dives Vol 2(Manning Pubs) 공동 저자 참여\n김정선의 SQL Server 컨설팅 이야기 시즌 12년간 진행 중\nSQL Unplugged 세미나 5년간 진행\nSQL PASS Korea Chapter Leader\nMicrosoft Ignite, BITEC, Tech Camp, MVP Camp, TechEd, MSDN 등 Speaker 참여\n함께 보면 좋은 강의\nSW 개발자를 위한 성능 좋은 SQL 쿼리 작성법\nSQL\nDBMS/RDBMS\n(34)\n₩132,000\n지식공유자가 알려주는\n강의 수강 꿀팁!\n🎓\n이런 분들께\n추천드려요!\nEF Core 또는 EF 개발자\nEF Core 애플리케이션이 적용된 DB 운영자 (SQL Server)\nEF Core DB 성능에 관심 있는 사용자\n📚\n선수 지식,\n필요한가요?\n.NET EF Core 기초\nSQL Server 기초",
      "lectureDifficulty": "중급자"
    }
  },
  {
    "model": "lectures.lecture",
    "fields": {
      "thumbnail": "https://cdn.inflearn.com/public/courses/330414/cover/d4260ef6-d341-4fab-a3be-33fd9242cf14/330414-eng.png",
      "lectureTitle": "포토샵 마스터 클래스 (만들면서 배우는 포토샵 입문)\n대시보드",
      "lectureFee": 29700,
      "lectureDescription": "입문자를 위해 준비한\n[그래픽 디자인, 디자인 툴] 강의입니다.\n포토샵이 보유하고 있는 기능들을 모두 클리어해간다는 느낌이 아닌, 실전에 필요한 기능과 기본기만으로 어떤 상황에서도 대응할 수 있는 바탕을 만들고자 했습니다.\n✍️\n이런 걸\n배워요!\n누구나 쉽게 접할 수 있는 포토샵 A to Z\n간단한 기능으로 눈에 확 드러나게 만들어지는 효과적인 제작 과정\n다양한 분야의 실전에서 활용할 수 있는 실용적인 컨텐츠\n포토샵의 기본기를 탄탄히 잡고\n원하는 이미지를 뚝딱뚝딱 제작할 수 있어요! 🛠️\n이 강의의 핵심 포인트 📌\n이런 분들에게 추천해요.\n포토샵을 처음 접하는 대학생\n친해질수록 더 좋은 포토샵을\n보다 더 빠르게 다가갈 수 있어요.\n셀프 홍보를 해보고자 하는 분\n상품의 보정과 콘텐츠 제작까지\n할 수 있는 알찬 구성이예요.\n효과적인 이미지를 고민하는 분\n시선을 사로잡는 이미지 구성을\n배워서 업무에 접목할 수 있어요.\n몇 번의 클릭만으로\n멋진 아트워크를 만들어요.\n이 강의의 예제들은 제가 다년간 포토샵 작업을 해오면서 활용 빈도가 높았던 기능들을 활용하여 아트워크를 만들면서 배우도록 구성되어 있습니다. 포토샵이 보유하고 있는 기능들을 모두 클리어해간다는 느낌이 아닌, 실전에 필요한 기능과 기본기만으로 어떤 상황에서도 대응할 수 있는 바탕을 만들고자 했습니다.\n예제들은 난도가 너무 높지 않아 접근하기 쉬우면서도 가볍지 않은 밀도의 작업으로 구성되어 있습니다. 이를 응용해 더욱 디테일한 작업에 도전할 수 있는 자신감도 얻을 것입니다. 이 강의는 단순히 포토샵 기능 습득을 위한 강의가 아닙니다. 한 가지 요리를 잘하면 여러 방면에 응용해 다른 요리도 잘 할 수 있는 것처럼, 포토샵의 기본기가 탄탄하게 잡힐 수 있도록 정리했습니다.\n🍯 Tip\n얼굴 보정, 전신 사진 보정, 사진 속 불필요한 사람들 지우는 방법 등 실생활에서 유용하게 쓰이는 내용을 다뤄요!\n디자인 하는 분들뿐만 아니라 내 사진을 조금 더 잘 보정하고 싶은 분에게도 좋은 강의입니다.\n학습할 내용 📚\n예상 질문 Q&A 💬\nQ. 비전공자도 들을 수 있는 강의인가요?\n네, 포토샵을 처음 접하는 사람들도 쉽게 접할 수 있도록 A 부터 Z까지 차근차근 알려드립니다.\nQ. 수업 내용을 어느 수준까지 다루나요?\n한가지 소재를 활용해 다양한 기법들을 쉬운 난도부터 점진적으로 배워가며, 적재적소에 활용할 수 있는 응용력을 자연스럽게 습득할 수 있습니다.\nQ.  포토샵 프로그램은 제공되나요?\n아니오, 포토샵 정품 프로그램을 구매하기 전에 7일간 무료로 사용이 가능한 체험판 프로그램을 사용할 수 있습니다. 포토샵 공식 사이트인 어도비 사 홈페이지에서 다운로드 후 사용할 수 있습니다.\n지식공유자 소개 ✒️\n\nBehance 포트폴리오\n도서 홈페이지\n☑️ 수강 전 참고사항\n실습환경\n운영 체제 및 버전(OS): Windows, macOS\n사용 도구: Adobe Photoshop CC 2020 이상\n학습자료\n예제 제공 (PPT, 클라우드 링크, 텍스트, 소스 코드, 애셋, 프로그램, 예제 문제 등)\n지식공유자가 알려주는\n강의 수강 꿀팁!\n🎓\n이런 분들께\n추천드려요!\n포토샵을 처음 접하는 대학생 : 친해질 수록 더 좋은 포토샵을 보다 더 빠르게 다가갈 수 있는 비법서\n셀프 홍보를 해보고자 하는 자영업자 : 상품의 보정은 물론 컨텐츠 제작까지 할 수 있는 알찬 구성\n효과적인 이미지에 대해 고민하는 직장인 : 포토샵을 익혀 시선을 사로잡는 이미지 구성을 배워보며 다양한 업무에 접목\n📚\n선수 지식,\n필요한가요?\n설렘, 호기심, 열망",
      "lectureDifficulty": "입문자"
    }
  },
  {
    "model": "lectures.lecture",
    "fields": {
      "thumbnail": "https://cdn.inflearn.com/public/courses/330182/cover/e15823cf-d096-43b5-a182-a2345d1fcd7b/330182-eng.jpg",
      "lectureTitle": "독하게 되새기는 C 프로그래밍\n대시보드",
      "lectureFee": 110000,
      "lectureDescription": "중급자를 위해 준비한\n[프로그래밍 언어, 시스템] 강의입니다.\n이 강의는 컴파일러 이론, 스택프레임 구조, 멀티스레드, 가상메모리 구조, 보안 취약점과 시큐어 코딩 등 C언어 기초 공부가 끝난 분들을 위한 주제를 다룹니다. C/C++ 계열 전문가를 희망하거나 CS 전공자 혹은 그에 준하는 실력을 원하는 분들에게 강력히 권합니다!\n✍️\n이런 걸\n배워요!\nC언어 입문/초급을 넘어서고 싶은 개발자\n컴파일러, 컴퓨터 구조, 운영체제와 연계한 C언어 구조\n메모리 디버깅 기법 및 스택프레임 원리와 구조\n보안 취약점의 의미와 시큐어 코딩의 핵심 원리\n멀티스레드 코딩 기법\nC 프로그래밍, 독하게 더 강력하게! 💥\n코딩 언어 문법만 안다고 \n개발 ‘잘’ 할 수 있을까요?\n😥 “컴파일러가 뭔지 이해하기 어려워요.”\n🥲 “전공자만큼 C언어 잘하고 싶은데, 뭔가 부족해요.”\n🤔 “이제 와서 CS 공부를 다시 하긴 힘들텐데...”\n코딩 열풍으로 누구나 프로그래머가 될 수 있는 세상이 열렸습니다. 그러나 정작 기업에서는 인력이 부족하다고 아우성이고, 많은 예비 개발자들이 취업을 걱정합니다. 왜 그럴까요? 소위 '제대로' 배운 사람이 적기 때문입니다. 누구나 프로그래밍 언어를 배우고 문법을 익힙니다. 그러나 왜 그런 형태가 됐는지, 어떤 원리로 작동하는지 깊이 고민하지 않거나 알지 못합니다. \n가령 컴파일러(Compiler)에 대해서는 어떨까요? 이미 현직에 있는 프로그래머라 해도 CS전공자가 아닌 이상 컴파일러에 대한 이야기는 잘 알지 못합니다. 그동안 몰라도 됐기 때문입니다. 그러나 개발자가 한 단계 발전하기 위해서는 꼭 알아야 할 이론 중 하나는 바로 컴파일러에 대한 것입니다. 하지만, 그렇다고 이제와 CS 전공 공부를 다시 하기는 쉽지 않게 느껴집니다.\n“사실은 4년이 걸리는 일입니다!”\n컴퓨터공학을 전공한 분들은 4년이라는 긴 시간을 쏟아부어 개발자가 됩니다. 누구나 할 수 있다는 그 코딩이, 사실은 4년이 넘는 긴 학습 시간을 요구한다는 사실을 우리는 생각보다 쉽게 간과합니다. \n때문에 초보자가 그 다음 단계로 넘어가기 위해서는 컴파일러의 작동 원리, 언어의 문법 관계, 컴퓨터 구조와 연결된 프로그래밍 이론(가상 메모리, 멀티스레드), 보안(원격코드 실행 취약점), 시큐어 코딩 등의 이론들을 익히는 노력이 필요합니다.\n따라서 이 강의의 주제와 핵심 목표는 그러한 이론과 원리를 익히고, 경쟁력을 확보하는 것입니다.\n한 단계 도약하고 싶은\nC언어 개발자라면!\n목표는 하나, CS 전공자 수준을 넘어서는 C 프로그래밍 능력 확보입니다!\n✅ 이미 C언어 기초 문법을 공부했지만 무언가 부족하다고 느끼는 분\n✅ CS 전공에 앞서 학과 공부를 미리 해보고 싶은 예비 전공자 (단, C언어 및 자료구조를 알고 있는 분)\n✅ 컴파일러 이론을 경험해보고, 프로그래밍 언어에 대한 더 깊은 이해를 얻으려는 개발자\n✅ “누구나 할 수 있는” 코딩이 아니라, 개발자로서의 경쟁력을 갖추고 싶은 취준생\nC/C++ 계열 개발자는 JAVA 계열과 비교해 개발자 1명을 양성하기 위해 보통 2~3배 이상의 시간과 노력이 필요하다고 합니다. 그러나 자바 전문가도 트러블 슈팅이나 고급 이론들을 다루려면 결국 C/C++ 계열 전문가와 동등한 수준의 노력(혹은 그 이상)이 필요합니다. 결국 다른 분야로 출발할 뿐 어느 수준에서는 모든 이론들이 모이는 접점이 있다고 할 수 있습니다.\n이 강의의 주제와 핵심 목표는 그 접점에 해당하는 본질적 이론들을 이해하는 것입니다. \n실무 개발자라면 꼭 알아야 할 \n핵심 내용을 다룹니다.\n💡 C언어 개발자로서 CS 전공 지식에 대한 부족함을 느끼지만 막상 학습하기에는 부담을 느끼시는 분들이 간략하게라도 컴파일러 이론과 시스템 이론 등 CS 전공 핵심 이론을 이해하는 데 도움을 줍니다. 차별화 혹은 다음 단계로의 도약을 원하는 초급 개발자 분들에게 적절한 방향을 제시합니다.\nC언어 기본이론 재정리\n컴파일러, 컴퓨터 구조\n스택프레임 구조와 원리를 포함한 함수\n동기/비동기 파일 입/출력\n멀티스레드\n변수와 상수에 대한 고급이론\n컴파일러 최적화와 함수에 관한 중급이론\n정적/동적 라이브러리 개발\n보안과 시큐어 코딩\n이 강의는 총 10개의 섹션으로 구성되어 있습니다. C언어에 대한 이해와 컴파일러로 시작해 시스템 프로그래밍 이론과 시큐어 코딩에 이르기까지 모든 실무 개발자가 반드시 학습해야 할 내용으로 구성하였습니다. \n컴파일러 구성 요소 中\n추상 구문 트리(AST)와 IR 中\n선수 지식을 확인해주세요!\nC언어 문법 및 자료구조에 대한 기본적인 이해가 필요합니다.\n이 강의는 입문자~초보자를 위한 강의가 아닙니다. C언어 기본 문법 및 이론(포인터 등)과 자료구조에 대한 기본적인 이해가 있다는 전제로 진행되는 중급 과정입니다. 아울러 강의 ‘넓고 얕게 외워서 컴공 전공자 되기’ 강의에서 언급하는 이론 정도는 알고 있다고 가정합니다.\nQ&A 💭\nQ. C언어 문법은 다루지 않나요?\n네, 이미 C언어와 자료구조를 배운 분들을 위한 강의입니다. 입문자 수준의 이론은 다루지 않습니다.\nQ. 자바(Java) 프로그래머가 들어도 상관 없나요?\nC언어를 배워본 경험이 있고 Pointer에 대해 일정 수준의 지식을 갖췄다면 상관 없습니다.\nQ. macOS, Linux 환경에서도 실습이 가능한가요?\n이론을 듣는 것은 문제 없으나 도구 사용방법을 구체적으로 다루기 때문에 반드시 Windows 10 + Visual studio 2022 개발환경을 사용하는 것이 좋습니다.\n💾 실습 환경 & 학습 자료 안내\n강의는 Windows 10 운영체제에서 Visual Studio 2022 Community 버전을 사용하여 진행됩니다. 다른 환경에서도 이론 수업을 수강하는 데는 문제가 없으나, 구체적인 도구 사용 방법을 다루기 때문에 반드시 해당 환경을 통해 수강하시는 것을 권장합니다. \n자료구조 및 C언어 기본 문법 및 이론(포인터 등)을 설명하지 않는 중급 과정입니다.\n수업 PPT 자료 및 각 수업에 사용된 예제 파일을 제공합니다.\n함께 보면 더 좋은 강의 모음 📺\n널널한 개발자\n넓고 얕게 외워서 컴공 전공자 되기\n66,000원\n5.0\n(\n38\n)\n+900명\n널널한 개발자\n외워서 끝내는 네트워크 핵심이론 - 기초\n77,000원\n5.0\n(\n72\n)\n+1700명\n널널한 개발자\n외워서 끝내는 네트워크 핵심이론 - 응용\n66,000원\n4.9\n(\n13\n)\n+900명\n지식공유자가 알려주는\n강의 수강 꿀팁!\n🎓\n이런 분들께\n추천드려요!\nC언어를 이미 공부했으나 부족하다고 느끼는 사람\n전공자 수준으로 제대로 C언어를 배우고 싶은 사람\n리버싱 공부에 앞서 배경이론을 얻고 싶은 개발자\n📚\n선수 지식,\n필요한가요?\n'넓고 얕게 외워서 컴공 전공자 되기' 과정에서 언급한 이론들\nC언어 기본 문법 및 포인터에 대한 이해\n자료구조에 대한 이해",
      "lectureDifficulty": "중급자"
    }
  },
  {
    "model": "lectures.lecture",
    "fields": {
      "thumbnail": "https://cdn.inflearn.com/public/courses/329984/cover/4c667dbf-3d9f-4ff5-b00e-b467a2b2397d/329984-eng.png",
      "lectureTitle": "백엔드 개발자 취업 토탈 가이드 (back-end. 멘토링 경험기반)\n대시보드",
      "lectureFee": 31900,
      "lectureDescription": "입문자를 위해 준비한\n[취업 · 이직, 백엔드] 강의입니다.\n제조업 웹 개발자에서 커머스, K사 포털 서비스회사 back-end 개발자가 되기까지 겪은 시행착오와 노하우를 모두 알려드려요. 여러분은 같은 시행착오를 겪지 마세요!\n✍️\n이런 걸\n배워요!\n실전 기술 면접 맛보기\n이력서 템플릿 제공\n프로젝트에 차별성은 어떻게\n가이드 후 200-300만원을 더 올린 신입 연봉 협상 TIP\n인프런 멘토링 및 특강을 통한 멘토링 노하우\n눈에 들어오는 포트폴리오 작성법\n제조업에서 포털 서비스회사로 이직하면서 겪은 시행착오 및 노하우,\n인프런 멘토링을 통해 쌓은 경험 및 노하우를 모두 공개합니다! 💡\n안녕하세요!\n인프런 멘토링 멘토이자 유튜브에서 개발자 인큐티비로 활동하고 있는 인큐입니다.\n제조업 웹 개발자에서 포털 서비스 백엔드 개발자가 되기까지 겪은 경험으로 인프런에서 멘토링을 시작했습니다. 멘토링을 하면서 놀란 점은 제가 취업준비/이직준비를 하면서 겪었던 시행착오와 고민을 취준생 분들이 그대로 하고 있다는 것이었습니다.\n이미 제가 겪었던 시행착오로 더 이상 시간낭비를 하지 않았으면 하는 마음에 멘토링과 특강 등에서 겪은 경험을 더 많은 분들에게 전하고자 강의를 준비했습니다.\n🏆\n정말 감사하게도 많은 분들이 제 멘토링을 듣고\n좋은 소식과 결과를 공유해주셨습니다.\n  Point만 핵심적으로!\n포트폴리오 템플릿 기술면접 질문 리스트멘토링\n  1. 포트폴리오 템플릿 제공, 그리고 서비스회사에서 자주 물어보는 기술 질문 리스트까지!\n포트폴리오에는 어떻게 작성해야 할까? 포트폴리오 포맷으로 시간낭비, 고민하지 마세요. 템플릿을 공유드립니다.\n2. 기술면접에서 자주 물어보는 질문, 정해져있다!\n인프런, 취업 서비스 사이트 라이브 클래스, 대학교 멘토링을 통해 쌓은 경험을 가감없이 공유드립니다.\n3. 멘토링은 계속되고, 정보를 제공하는 자료는 계속 최신화됩니다!\n인프런 멘토링, 실무자와 함께 하는 모의면접 등 운영하는 멘토링 경험을 자료에 계속 업데이트할 예정입니다.\n이런 분들께 추천드려요! 💪\n☑️\n백엔드\nJAVA기반의\n백엔드 업무 지원 희망자\n☑️\n신입/주니어 지원자\n취업에 전체적인 방향을\n그리고 싶은 분\n☑️\n취업준비생\n포트폴리오 작성,\n면접 준비를 시작한 분\n  이런 걸 배워요! 🤗\n#1.\n어떤 프로젝트를\n해보는 게 좋을까요?\n취업을 준비하는 많은 분들이 기능 개발 위주로 프로젝트를 하고 포트폴리오를 준비합니다. 프로젝트에 차별성을 넣어주기 위해 어떤 부분들을 체크하고 생각해보면 좋을지 알아봅니다.\n#2.\n어떤 이력서가\n기억에 남을까요?\n유명하지 않은 유니콘 기업도 대략 7~9명을 뽑는 신입공채에도 지원자만 최소 1000명이 넘습니다. 수많은 지원자에 이력서중에 어떤 이력서가 기억에 남고 실무자분들이 궁금증을 가질까요? 이력서 작성에 대해 같이 알아봅니다.\n#3.\n면접대비 맛보기\n프로젝트도 마무리하고 포트폴리오도 완성하고 백엔드 기술면접에서는 어떤 것들을 물어볼까요? 기술면접에 대해 맛보겠습니다.\n#4.\n신입 개발자도\n처우 협상 도전!\n신입 개발자도 처우 협상이 가능하다고? 도전해보고 안되면 그만, 기대없이 도전해보세요. 물론 안되는 경우도 있었습니다. 하지만 인상해주는 경우도 있었습니다. 이메일 한번으로 200~300 만원 인상하여 매달 15만원~30만원 더 풍족하게 생활하세요!\n지식공유자가 알려주는\n강의 수강 꿀팁!\n🎓\n이런 분들께\n추천드려요!\n포트폴리오에 어떤 내용을 적어야 할지 고민이신 분\n어떤 프로젝트를 해야하는지 고민중이신 분\nback-end 개발자 취업에 전반적인 흐름을 그리고 싶으신 분\n백엔드 개발자로 취업에 시챙착오를 줄이고 싶으신분\n신입 연봉 협상을 이야기에 대해 궁금하신 분",
      "lectureDifficulty": "입문자"
    }
  },
  {
    "model": "lectures.lecture",
    "fields": {
      "thumbnail": "https://cdn.inflearn.com/public/courses/329679/cover/6fb271d2-3acc-4b86-97a8-7a0a58f7c684/329679-eng.jpg",
      "lectureTitle": "곰책으로 쉽게 배우는 최소한의 운영체제론\n대시보드",
      "lectureFee": 11000,
      "lectureDescription": "입문자를 위해 준비한\n[개발 · 프로그래밍, 시스템] 강의입니다.\n'넓고 얕게 외워서 컴공 전공자 되기' 강의를 끝낸 분들이 운영체제에 대해 좀 더 깊이 있는 공부를 할 수 있도록 제공되는 강의입니다.\n✍️\n이런 걸\n배워요!\n운영체제론\nDMA, DirectX의 의미와 원리\nCPU 작동과 캐시 메모리\n프로세스와 스레드\n가상 메모리 시스템\n운영체제도 널널한 개발자와 함께! 👨‍💻\n꼭 알아야 할 IT 지식의 기반을 다져드립니다.\n수강 전 확인해주세요!\nYouTube에서 무료로 제공되는 강의입니다!\n이 강의는 널널한 개발자 TV에서 \n모두 무료로 볼 수 있도록 공개되어 있습니다.\n그럼에도 불구하고 유료화하는 이유 ✅\n많은 수강생들이 무료 강의에 대해서 아무래도 느슨해집니다. 마치 늘 그 자리를 지켜주는 동네 운동기구처럼 말이죠. 사실 어떻게 보면 돈을 들이지 않아도 운동을 할 수 있는 방법은 많습니다. 그럼에도 불구하고 많은 사람들이 굳이 돈을 내고 헬스장에 갑니다. 그런 이유 때문에 강의를 유료화 했습니다.\n이 강의를 구매하시는 분들은 낸 돈이 아까워서라도 꼭 끝까지 완강하시기를 진심으로 바랍니다!\n인프런 환경을 통해 광고 없이 좀 더 편하게 공부할 수 있습니다.\n앞으로 YouTube에 없는 수업들이 몇 가지 추가될 예정입니다.\n꼭 알아야 할 운영체제, \n최대한 쉽고 가볍게! 💪\n‘넓고 얕게 외워서 컴공 전공자 되기’ 강의를 완강하신 분들을 위해 준비한 강의입니다. 운영체제에 대한 이론은 컴퓨터 공학의 전공 필수 과목인 만큼, IT 기술 전반을 이해하는 데 있어 토대가 되어줄 핵심 기반 이론입니다. 따라서 IT 기술 분야 엔지니어 및 개발자를 희망하시는 분들은 반드시 알아야 합니다. \n운영체제, 복잡하고 낯설다고요? \n누구나 CS 전공자처럼 익힐 수 있습니다.  \n컴퓨터공학 전공자들이 배우는 운영체제 이론을 \n최대한 쉽고, 빠르고, 가볍게 알려드립니다. \n더 이상 말이 필요없는 OS의 핵심! 👨‍🎓\n지난 ‘넓고 얕게 외워서 컴공 전공자 되기’ 강의를 학습한 이후 한 단계 깊은 기반 이론을 다지고 싶으신가요? 기초 수준을 넘어 본격적으로 IT 세계에 뛰어들려는 모든 분들이 반드시 알아야 할 운영체제 핵심 이론을 다룹니다.\n전공 여부를 막론하고, 우리나라 모든 개발자들이 컴퓨터 공학 전공자에 준하는 기반 지식을 쌓을 수 있기를 바라는 마음으로 최대한 쉽고 가볍게 알려드립니다. 함께 도전해봅시다!\n널널한 개발자의 ‘외워서 끝내는’ CS 풀세트 📚\n널널한 개발자\n넓고 얕게 외워서 컴공 전공자 되기\n66,000원\n5.0\n(\n38\n)\n+900명\n널널한 개발자\n곰책으로 쉽게 배우는 최소한의 운영체제론\n11,000원\n5.0\n(\n9\n)\n+600명\n널널한 개발자\n외워서 끝내는 네트워크 핵심이론 - 기초\n77,000원\n5.0\n(\n72\n)\n+1700명\n운영체제 베스트셀러 \n널널한 개발자와 쉽게 읽기 📖\n이번 강의는 이른바 ‘곰책’으로 알려진 책 『쉽게 배우는 운영체제』(한빛아카데미, 조성호 저)를 활용해 제작된 운영체제론 강의입니다. 시스템 프로그래머가 아니더라도 IT 전문가라면 누구나 알아야 할 이론들에 대해 최대한 쉽게 설명했습니다.\n복잡한 운영체제론에 대해서 쉽게 설명합니다.\n프로세스와 스레드에 대해 더 깊이 이해할 수 있습니다.\n운영체제의 자원관리 및 스케줄링 개념에 대해 더 깊이 이해할 수 있습니다.\n가상 메모리 시스템을 제대로 이해할 수 있습니다.\n3.5만 유튜버, 베스트셀러 개발 도서 저자의 생생한 노하우 📺\n낯선 OS 개념을 쉽고 자세한 설명으로 풀어서 알려드립니다.\n더 자세한 설명이 필요한 부분은 예제를 통해 알려드립니다.\n이 강의를 만든 \n지식공유자는 👨‍💻\n널널한 개발자 TV의 ‘널널한 개발자’ 최호성입니다.\n(모두가 싫어하는) 국내 최초 PC 방화벽 개발자\n1992년부터 C언어를 공부한 30년 묵은 C/C++ 개발자\n다수 국책과제 수행 경험자이자 15년 이상 개발 강의 경력을 함께 보유한 아저씨!\nC언어 인기 입문서 『독하게 시작하는 C 프로그래밍』 저자\n3만 명 이상이 구독하는 \"널널한 개발자 TV\" 유튜브 채널을 운영하고 있습니다. (바로가기)\n📢 수강 전 확인해주세요!\n본 강의와 동일한 영상을 유튜브 널널한 개발자 TV에서 무료로 시청하실 수 있습니다. \n인프런 환경을 통해 광고 없이 시청 가능하며, 유튜브에 없는 수업들이 몇 가지 추가될 예정입니다.\n지식공유자가 알려주는\n강의 수강 꿀팁!\n🎓\n이런 분들께\n추천드려요!\nIT기술을 배우려는 모든 비전공자\n운영체제에 대해 잘 몰랐던 초보자\n넓고 얕게 외워서 컴공 전공자 되기 수업을 끝내고 더 깊이 배우고 싶은 분",
      "lectureDifficulty": "입문자"
    }
  },
  {
    "model": "lectures.lecture",
    "fields": {
      "thumbnail": "https://cdn.inflearn.com/public/courses/329248/cover/302bbe7f-5c3d-49f2-b23a-16f4f51e6ede/329248-eng2.png",
      "lectureTitle": "실전! 코틀린과 스프링 부트로 도서관리 애플리케이션 개발하기 (Java 프로젝트 리팩토링)\n대시보드",
      "lectureFee": 77000,
      "lectureDescription": "초급자를 위해 준비한\n[백엔드, 프로그래밍 언어] 강의입니다.\nJava + Spring Boot로 만들어진 웹 애플리케이션을 Kotlin + Spring Boot로 리팩토링 하고 추가 요구사항을 구현합니다. 이 과정에서 Junit5, SQL, JPA, Querydsl 을 사용할 뿐 아니라, 설계 및 구현 관점에서 다양한 방법의 장단점을 다루게 됩니다.\n✍️\n이런 걸\n배워요!\nKotlin + Spring Boot + JPA를 함께 사용하는 방법\nKotlin을 이용한 테스트 기초(Junit5)와 Querydsl 사용법\n요구사항을 구현하는 다양한 방법과 Trade-Off 지점에 대한 이해\n떠오르는 대세, 코틀린 백엔드! 👩‍💻 \n자바 + 스프링부트 리팩토링으로 배워보세요.\n지금, 왜 코틀린(Kotlin)일까요?\n쉽고 간결한 \n코드 \n확연히 좋아진 \nNull 안정성 \n기존 자바와의 \n완벽 호환 \n이미 네카라쿠배는 코틀린 도입 중! \n자바를 대체할 매력적인 서버 개발 언어로 코틀린이 떠오르고 있습니다.\n이 강의에서는 🔥\nJava + Spring Boot로 미리 만들어진 도서 관리 애플리케이션을 Kotlin + Spring Boot로 완전히 리팩토링합니다. 모든 리팩토링이 끝나면 다음 세 가지 비즈니스 요구사항과 한 가지 기술적 요구사항을 코틀린 서버 위에 추가로 구현해 봅니다.\n이러한 과정을 통해 설계 및 구현 관점에 필요한 다양한 고민을 해볼 수 있고, 여러 방법의 Trade-Off 및 장단점과 추가적인 기술에 대해 배울 수 있습니다. 앞서나가고 싶은 백엔드 개발자라면 함께 도전해봅시다!\n강의에서 도전하는 요구사항 4-Step ✅\n첫 번째 추가 요구사항\n책 등록 시 분야를 구분, 선택할 수 있도록 합니다.\n두 번째 추가 요구사항\n유저 대출 현황 및 기록 조회를 보여줍니다.\n세 번째 추가 요구사항\n현재 대여 중인 책, 등록된 책에 대한 통계를 보여줍니다.\n네 번째 추가 요구사항\nJPQL을 대체하여 QueryDSL을 적용해 봅니다.\n이런 분들께 \n추천합니다 👩‍💻\n✅ Java + Spring Boot + JPA로 매우 간단한 CRUD API를 한 번 정도 만들어보신 분!\n✅ Kotlin 기초 문법을 알고 계신 분!\n서버 개발자가 갖춰야 할 지식과 기술은 정말 다양합니다. 그러나 일반적인 강의에서는 ‘특정 주제’를 집중해서 다루고 있어 어느 부분의 역량을 다루고 있는지, 추가로 습득해야 하는 역량은 무엇인지 파악하기가 어렵습니다. 본 강의에서는 강의를 듣기 위해 필수적인 선수 지식을 제외하고는 모두 강의 내용에 녹일 수 있도록 노력하였습니다.\n향후 로드맵에 추가되는 강의에서도 이전 강의의 내용을 중복해서 담지는 않되, 이전 강의에서 다룬 적이 없는 내용은 처음부터 차근차근 설명할 수 있도록 구성할 예정입니다. \n보다 자세한 이야기는 무료로 열려 있는 “강의 소개 영상”을 확인해주세요~! 😊\n커리큘럼을 \n확인해보세요 📚\nSection #1.\nKotlin Spring Junit5 \nKotlin을 사용하기 위해 필요한 설정 방법을 알아봅니다.\n테스트란 무엇이고, 왜 중요한지 살펴봅니다.\nJunit5의 기초 사용법을 익히고, Junit5와 Spring Boot를 함께 사용해 테스트를 작성하는 방법을 다룹니다.\n도서 관리 애플리케이션 API에 대한 테스트를 작성해 봅니다.\nSection #2.\nKotlin Spring JPA (1) \nJava Spring Boot를 Kotlin Spring Boot로 리팩토링하며 다양한 리팩토링 방법을 배웁니다.\nKotlin + Spring + JPA를 함께 사용하는 방법과 주의할 점을 알아봅니다.\nSpring Application에서 Kotlin의 언어적 특성을 활용하는 방법을 다룹니다.\nSection #3.\nKotlin Spring JPA (2) \nType, Status 등을 서버에서 관리하는 두 가지 방법과 각각의 장단점을 살펴봅니다.\nText Fixture의 필요성과 구성 방법을 다룹니다.\nKotlin에서 Enum + JPA + Spring Boot를 활용할 수 있는 방법을 알아봅니다.\nSection #4.\nKotlin Spring JPA SQL\n새로운 기능을 추가할 때 위치에 관한 고민과, 각각의 선택에 따른 장단점을 알아봅니다.\n복잡한 기능을 추가할 때 테스트 코드를 작성하는 방법을 배웁니다.\nSQL의 inner join, left join을 이해하고, N + 1 문제를 해결하기 위해 fetch join을 사용해 봅니다.\nSection #5.\nKotlin Spring SQL\nSQL의 다양한 기능을 이해하고, 간결한 함수형 프로그래밍 기법에 익숙해져 봅니다.\n동일한 기능을 애플리케이션과 DB로 구현해 보고, 특징과 장단점에 대해 이해합니다.\nSection #6.\nKotlin Spring QueryDSL\nJPQL과 QueryDSL의 장단점을 알아봅니다.\nQueryDSL을 Kotlin + Spring Boot와 함께 이해하고, 2가지 방식의 장단점을 이해합니다.\nQueryDSL의 기본적인 사용법을 익힙니다.\nQueryDSL을 사용해 기존 Repository를 리팩토링해봅니다.\n수강생 여러분을 위해 준비한 \n이 강의만의 키 포인트 🔑\nPoint 1\n무한 복습을 위한 강의 자료 \n강의 내용을 완벽하게 정리한 142페이지 분량의 핸드북과 468페이지 분량의 PPT를 드립니다.\nPoint 2\n서버 개발에 집중하세요 \n서버 개발에만 집중할 수 있도록 도서 관리 애플리케이션을 위한 웹 UI를 제공해드립니다.\nPoint 3\n이해를 돕는 꼼꼼한 설명\n강의 내용 이해를 돕기 위해 다양한 시각 자료를 준비했습니다!\nPoint 4\n실전 서버 개발 레벨 업! \n실습형 수업에 걸맞게 함께 코드를 작성합니다. \n리팩토링은 물론 추가 요구사항 구현까지 완성해 나갑니다! \n함께 보면 좋은 강의 📺\n자바 개발자를 위한 코틀린 입문(Java to Kotlin Starter Guide)\nKotlin\nJava\n객체지향\n(84)\n₩55,000\n평균 별점 5.0! 생생한 수강평을 확인해보세요 🚩\n이번 강의에서도 Java + Spring Boot가 Kotlin + Spring Boot에서 어떻게 변경되고, 어떤 의미를 갖는지 꼼꼼하게 담았습니다. 여러분의 성공적인 코틀린 서버 개발 입문을 응원합니다! 💪\n지식공유자가 알려주는\n강의 수강 꿀팁!\n🎓\n이런 분들께\n추천드려요!\nKotlin으로 웹 애플리케이션 개발을 해보고 싶으신 분\n웹 애플리케이션 개발 과정에서 다양한 선택지와 각각의 장단점을 알아가고 싶으신 분\n📚\n선수 지식,\n필요한가요?\nJava, Kotlin 기초 문법을 알고 계셔야 합니다!\nSpring Boot로 아주 간단한 CRUD API를 만들어 보셨어야 합니다!\n필수적인 선수지식 외의 내용은 모두 설명드립니다!",
      "lectureDifficulty": "초급자"
    }
  },
  {
    "model": "lectures.lecture",
    "fields": {
      "thumbnail": "https://cdn.inflearn.com/public/courses/328990/cover/9a948ec2-300a-48f8-98ce-3b71863d03c0/328990-eng.png",
      "lectureTitle": "스프링 DB 2편 - 데이터 접근 활용 기술\n대시보드",
      "lectureFee": 99000,
      "lectureDescription": "초급자를 위해 준비한\n[백엔드] 강의입니다.\n백엔드 개발에 필요한 DB 데이터 접근 기술을 활용하고, 완성할 수 있습니다. 스프링 DB 접근 기술의 원리와 구조를 이해하고, 더 깊이있는 백엔드 개발자로 성장할 수 있습니다.\n✍️\n이런 걸\n배워요!\n스프링을 통해 DB를 사용하는 내부 원리\n스프링을 통해 DB를 사용하는 다양한 방법\n스프링 DB 접근 기술\n백엔드 개발자라면 반드시 알아야하는\n스프링 데이터 접근 기술 Part.2\n📣 확인해주세요!\n본 강의는 자바 스프링 완전 정복 시리즈의 7번째 강의입니다. 우아한형제들 최연소 기술이사 김영한의 스프링 완전 정복 로드맵을 먼저 확인해주세요.\n• 로드맵 링크: https://www.inflearn.com/roadmaps/373 (클릭하면 바로가기)\n김영한의 스프링 DB\n데이터 접근 기술 완성하기\n백엔드 웹 애플리케이션을 제대로 개발하려면 HTTP를 기반으로 한 MVC와 DB를 기반으로 한 데이터 접근 기술이라는 2가지 큰 축을 완성해야 합니다. 우리는 앞선 강의를 통해 HTTP와 스프링 MVC를 완성했으니, 이제 남은 하나의 축인 스프링 DB 데이터 접근 기술을 완성해야 합니다.\n✅ 선수 지식을 확인해주세요.\n지난 강의인 <스프링 DB 1편> 를 통해 스프링 DB의 원리와 구조를 이해했는지 확인해 주세요. \n스프링 DB 1편\n- 데이터 접근 핵심 원리선수 지식\n1. 스프링 데이터 접근 기술 기본 원리 이해\n2. 실무에서 활용되는 코드로 직접 개발\n스프링 DB 1편 강의를 통해 DB 접근 기술의 핵심 원리와 구조를 이해했습니다. 이번 스프링 DB 2편에서는 1편의 기반 위에 실무에 꼭 필요한 다양한 활용 기술들을 학습합니다. 2편은 크게 3부분으로 나뉘어 있습니다.\n1) 다양한 데이터 접근 기술 이해\nJdbcTemplate, MyBatis, JPA, Spring Data JPA, Querydsl 같은 실무에서 주로 사용하는 다양한 데이터 접근 기술들을 실전 예제를 통해 점진적으로 발전시키면서 학습합니다. 이 과정을 통해 각각의 기술들이 왜 필요한지, 그리고 각 기술들의 장단점을 코드로 개발하면서 자연스럽게 이해할 수 있습니다.\n2) 데이터 접근 기술과 테스트\n데이터 접근 기술은 결국 데이터베이스에 데이터를 관리하는 목적으로 사용됩니다. 따라서 데이터 접근 기술이 실제 데이터베이스에 데이터를 잘 저장하고 조회할 수 있는지 확인해야 합니다. 강의에서는 데이터베이스를 연동하는 상황에서 테스트를 어떻게 하는 것이 좋은지 단계적으로 설명합니다.\n3) 스프링 트랜잭션의 깊은 이해\n스프링 DB 1편에서는 스프링이 제공하는 트랜잭션 기능이 왜 필요하고, 어떻게 동작하는지 내부 원리를 알아보았습니다. 이번 시간에는 스프링 트랜잭션을 매우 깊이 있게 학습하고, 실무 활용 방안을 알아봅니다.\n트랜잭션 AOP 사용 시 실무 주의사항\n스프링 트랜잭션의 다양한 옵션\n예외 처리와 스프링 트랜잭션이 커밋되고 롤백되는 내부 원리\n트랜잭션 전파 옵션과 내부 동작 방식\n강의 목표\n목표: 실무 백엔드 애플리케이션을 개발할 때 필요한 방대한 DB 데이터 접근 기술을 완성하는 것이 이 강의의 목표입니다.\n기초부터 실무까지: 실무 개발을 위한 내용이 많지만, 웹 애플리케이션 개발 경험이 없는 개발자도 적응할 수 있게 단계적으로 구성하였습니다. 참고로 스프링 DB 1편을 먼저 듣고 스프링 DB 2편을 학습해야 합니다.\n실무 예제 중심: 실무에서 스프링으로 백엔드 애플리케이션을 개발할 때 필요한 데이터 접근 기술을 예제를 통해 자연스럽게 학습하며, 실무에서의 Best Practice를 전수해 드립니다.\n간결함: 실무에서 사용하지 않는 오래된 기능은 과감하게 제외했습니다. 최신 실무에 주로 사용하는 내용을 위주로 설명합니다.\n강의 내용\n데이터 접근 기술 - JdbcTemplate\nSQL을 직접 사용할 때 스프링이 제공하는 JdbcTemplate은 좋은 선택입니다. 이 기술은 JDBC를 매우 편리하게 사용할 수 있게 도와줍니다. 그리고 JDBC를 직접 사용할 때 발생하는 대부분의 반복 작업을 대신 처리해 줍니다.\n* 개발자는 SQL을 작성하고, 전달할 파라미터를 정의하고, 응답 값을 매핑하기만 하면 됩니다.\n* 실제 동작하는 웹 애플리케이션에 JdbcTemplate을 적용하면서 해당 기술의 장단점을 이해합니다.\n데이터 접근 기술 - MyBatis\nMyBatis는 앞서 설명한 JdbcTemplate보다 더 많은 기능을 제공합니다. JdbcTemplate과 비교해서 MyBatis의 가장 매력적인 점은 SQL을 XML에 편리하게 작성할 수 있고 또 동적 쿼리를 매우 편리하게 작성할 수 있다는 점입니다. 강의에서는 실제 동작하는 웹 애플리케이션에 MyBatis를 직접 코드로 적용하면서 해당 기술의 장단점을 이해할 수 있습니다.\n데이터 접근 기술 - JPA\n스프링과 JPA는 자바 엔터프라이즈(기업) 시장의 주력 기술입니다. 스프링이 DI 컨테이너를 포함한 애플리케이션 전반의 다양한 기능을 제공한다면, JPA는 ORM 데이터 접근 기술을 제공합니다. JPA는 스프링 만큼이나 방대하고, 학습해야할 분량도 많지만, 한번 배워두면 데이터 접근 기술에서 매우 큰 생산성을 향상을 얻을 수 있습니다. 여기서는 해당 기술들의 기본 기능과, 해당 기술을 왜 사용해야 하는지 각각의 장단점과 전체 큰 그림을 알아봅니다.\n데이터 접근 기술 - 스프링 데이터 JPA\n스프링 데이터 JPA는 JPA를 더욱 편리하게 사용하도록 도와주는 기술입니다. 쉽게 이야기해서 기본적인 CRUD 기능들을 모두 제공하기 때문에 개발자가 작성해야 하는 개발 코드를 혁신적으로 줄일 수 있습니다. 강의에서는 실제 동작하는 웹 애플리케이션에 스프링 데이터 JPA를 직접 코드로 적용하면서 해당 기술의 장단점을 이해할 수 있습니다.\n데이터 접근 기술 - Querydsl\nJPA는 복잡한 쿼리나, 동적 쿼리를 처리하기 어렵습니다. Querydsl을 사용하면 이런 문제를 매우 편리하게 해결할 수 있습니다. 실무에서 JPA를 사용한다면 꼭 사용해야 하는 추천 기술입니다. 강의에서는 실제 동작하는 웹 애플리케이션에 Querydsl를 직접 코드로 적용하면서 해당 기술의 장단점을 이해할 수 있습니다.\n데이터 접근 기술 - 테스트\n데이터 접근 기술은 결국 데이터베이스에 데이터를 관리하는 목적으로 사용됩니다. 따라서 데이터 접근 기술이 실제 데이터베이스에 데이터를 잘 저장하고 조회할 수 있는지 확인해야 합니다. 강의에서는 데이터베이스를 연동하는 상황에서 테스트를 어떻게 하는 것이 좋은지 단계적으로 설명합니다. 예를 들어서 데이터베이스에 연동하는 테스트를 어떻게 구성하는지 설명하고, @Transactional, 임베디드 모드 DB가 어떻게 동작하는지 코드로 알아봅니다.\n스프링 트랜잭션 이해\nDB 1편에서는 스프링이 제공하는 트랜잭션 기능이 왜 필요하고, 어떻게 동작하는지 내부 원리를 알아보았습니다. 이번 시간에는 스프링 트랜잭션 AOP 사용 시 실무 주의사항, 스프링 트랜잭션의 다양한 옵션, 예외가 발생했을 때 스프링 트랜잭션이 커밋되고 롤백되는 내부 원리와 같이 스프링 트랜잭션이 제공하는 다양한 기능들을 깊이 있게 자세히 알아봅니다.\n스프링 트랜잭션 전파\n스프링의 트랜잭션 전파를 매우 깊이 있게 다룹니다. 트랜잭션 전파가 왜 필요한지 이해하고, 다양한 트랜잭션 전파 옵션, 전파 옵션에 따른 예외 처리, 실무에서 트랜잭션 전파 옵션을 사용할 때의 주의점을 다룹니다.\n지식공유자\n김영한님의 한마디\n백엔드 개발자는 MVC와 DB 접근 기술이라는 2가지 큰 축을 꼭 완성해야 합니다. 여러분이 두 가지 축을 완성하고, 단단한 백엔드 개발자로 성장할 수 있도록 도와드리겠습니다. 감사합니다.\n강의 순서\n스프링 입문 - 코드로 배우는 스프링 부트, 웹 MVC, DB 접근 기술 \n스프링 핵심 원리 - 기본편\n모든 개발자를 위한 HTTP 웹 기본 지식 \n스프링 MVC 1편 - 백엔드 웹 개발 핵심 기술\n스프링 MVC 2편 - 백엔드 웹 개발 활용 기술\n스프링 DB 1편 - 데이터 접근 핵심 원리\n스프링 DB 2편 - 데이터 접근 활용 기술  현재 강의  \n스프링 핵심 원리 - 고급편\n실전! 스프링 부트   출시 예정   \n연관 로드맵\n스프링 완전 정복 시리즈 \n스프링 똑똑하게 시작하기, 핵심 원리부터 실전 활용\n스프링 부트 + JPA 실무 완전 정복 \n최신 실무 기술로 웹 앱을 만들며 학습  실전 심화 단계 \n지식공유자가 알려주는\n강의 수강 꿀팁!\n🎓\n이런 분들께\n추천드려요!\n스프링을 통해 DB에 접근하고, 데이터를 관리하고 싶은 개발자\n개발자 취업 준비생\n스프링 DB 접근 기술을 깊이있게 이해하고 싶은 현업 개발자\n스프링으로 웹 애플리케이션을 만들고 싶은 개발자\n📚\n선수 지식,\n필요한가요?\n자바 언어\n스프링 기본 지식\nDB 기본 지식",
      "lectureDifficulty": "초급자"
    }
  },
  {
    "model": "lectures.lecture",
    "fields": {
      "thumbnail": "https://cdn.inflearn.com/public/courses/328066/cover/c65c9f84-9bcf-4cb3-8939-d7df2fa9a3c4/328066-eng.jpg",
      "lectureTitle": "스파크 머신러닝 완벽 가이드 - Part 1\n대시보드",
      "lectureFee": 99000,
      "lectureDescription": "중급자를 위해 준비한\n[데이터 분석, 인공지능] 강의입니다.\n스파크(Spark) 머신러닝의 핵심 Framework에 대한 이해, 난이도 높은 실전 문제를 통한 SQL 기반의 데이터 가공, 업무 도메인 분석을 통한 데이터 분석과 최적화된 머신러닝 모델 구현 능력까지, 대용량 데이터 기반에서 머신러닝 전문가로 인정 받고 싶다면 이 강의와 함께 하십시요.\n✍️\n이런 걸\n배워요!\n스파크에서 머신러닝 모델 구현하기\n스파크의 데이터 처리 기반인 DataFrame에 대한 상세한 이해\n스파크 머신러닝 Framework을 구성하는 다양한 기술 요소 이해\n스파크의 머신러닝 파이프 라인 익히기\n데이터 분석을 위한 SQL 활용 능력\nSQL 기반의 Feature Engineering 기법\n스파크에서 XGBoost와 LightGBM으로 모델 구현하기\n베이지안 최적화 기반의 모델 하이퍼 파라미터 튜닝 방법\n난이도 높은 실전 문제를 통해 데이터 분석과 ML 모델 구현 실력을 동시에 향상\n분석 도메인 기반의 데이터 분석 방법\n여러가지 데이터 시각화 기법\n데이터 분석 + 피처 엔지니어링 + ML 구현, \n세 가지 역량을 한번에 잡아보세요.\nApache Spark와\n머신러닝의 만남.\n오픈 소스 대용량 분산 처리 솔루션의 최강자인 Apache Spark(아파치 스파크)와 Machine Learning이 만났습니다. \n국내 많은 대기업과 금융기관에서 Apache Spark를 활용하여 대용량 데이터를 분석하고 머신 러닝 모델을 만들고 있습니다. Spark는 분산 데이터 처리 프레임을 기반으로 하고 있기 때문에 적게는 수 대부터 많게는 수십 대의 서버 위에서 용량을 확장해 가면서 대용량 데이터를 처리하고 ML 모델을 만들 수 있습니다. 때문에 한 대의 서버에서만 머신러닝 모델 구현이 가능한 사이킷런의 한계를 벗어날 수 있습니다.  \n데이터 가공/분석에도 능한\n머신러닝 전문가로\n성장시켜 드리겠습니다.\n'스파크 머신러닝 완벽 가이드 - Part 1' 강의는 스파크(Spark)에서 머신러닝 모델을 구현하는 방법을 익히는 것을 넘어서 데이터 가공과 분석에도 능한 머신러닝 전문가로 여러분을 성장시켜 드릴것입니다. \n진정한 머신러닝 전문가로 성장하기 위해서는 비단 ML 구현 능력 뿐만 아니라 업무 데이터를 어떻게 가공하고 조합하여 ML 모델을 만들어 내는 능력 역시 매우 중요합니다. 이를 위해 실무에서 대용량 데이터 처리에 가장 많이 사용되는 SQL을 활용하여 데이터를 가공하는 법과 업무 도메인 분석에 기반한 데이터 분석 기법을 실습을 통해서 익히시게 될 것입니다. \n상세한 이론 설명 및 실습을 통해 데이터 가공/분석 및 ML 구현 역량을 키울 수 있도록 구성하였습니다.\n여러분이 직면할 문제를 \n해결해드립니다.\n스파크 기반에서 머신러닝 모델을 구현하기는 쉽지 않습니다. 바로 스파크 아키텍처 특수성에 기반한 독특한 머신러닝 API와 프레임워크, 그리고 SQL에 기반한 데이터 처리 등 기존 데이터 사이언티스트나 머신 러닝 전문가들이 겪어보지 못한 많은 문제에 봉착하기 때문입니다.\n본 강의, 스파크 머신러닝 완벽 가이드를 통해 여러분이 봉착한 문제를 해결하는 능력을 길러드리겠습니다.\n'스파크 머신러닝 완벽 가이드 - Part 1' 강의 전반부는\n강의 전반부는 스파크 Machine Learning Framework을 구성하는 다양한 요소들인 DataFrame, SQL, Estimator, Transformer, Pipeline, Evaluator 등에 대해서 상세한 이론 설명과 풍부한 실습으로 구성되어 있습니다. 이를 통해 여러분은 Spark에서 ML 모델을 쉽고 빠르게 구현하실 수 있을 것입니다.\n또한 스파크에서 XGBoost와 LightGB을 사용하는 방법, 베이지안 최적화에 기반한 HyperOpt를 이용하여 하이퍼 파라미터를 튜닝하는 방법에 대해서 자세히 설명 드리겠습니다. \n'스파크 머신러닝 완벽 가이드 - Part 1' 강의 후반부는\n강의 후반부는 캐글의 Instacart Market Basket Analysis 경연 대회 실습을 통해서 여러분의 실전 데이터 가공/분석 능력과 머신러닝 모델 구현 능력을 동시에 향상 시켜 드릴 것입니다. 캐글 Instacart 경연대회는 난이도 높은 경연이며, 특히 데이터 세트가 전자 상거래의 주문 처리 테이블들(상품, 주문, 주문 상품)로 구성되어 있습니다.\n해당 데이터 세트를 통해 SQL 기반에서 업무 데이터를 어떻게 가공하고 분석하며 Feature Engineering을 수행하는지, 또한 업무에서 분석 도메인을 어떻게 도출하는지, 그리고 이렇게 도출된 Feature 들을 기반으로 어떻게 모델을 생성하는 지에 대해서 상세하게 배우시게 될 것 입니다.   \n이번에 출시하는 '스파크 머신러닝 완벽 가이드' 강의는 Part 1입니다. Part 2 강의는 추후에 출시 예정이며, 텍스트 분석, 추천(Recommendation), 그리고 TimeSeries 분석을 다룰 예정입니다.\n💻 수강 전 확인해주세요!\n본 강의의 실습 코드는 모두 Python 기반으로 되어 있습니다. Scala는 다루지 않으니 강의 선택 전 참조 부탁드립니다. \n실습 환경을 \n확인해주세요. \n실습은 Databricks(데이터브릭스)를 이용합니다. Databricks는 Spark를 설치하지 않고도 클라우드 상에서 Spark 기반의 애플리케이션을 만들 수 있는 노트북 환경을 제공합니다.\nDatabricks는 Community 버전으로 공식적으로 14일간 무료 사용이 가능합니다.\n그리고 섹션 0의 'Databricks에서 Spark 클러스터 관리하기 및 가입 2주 후에도 Databricks 사용하기' 강의 영상에서 14일 이후에도 무료로 계속 사용할 수 있는 방법에 대해서 말씀드리고 있으니 꼬~옥 해당 영상을 확인 부탁드립니다(Databricks Community 버전에 대한 설명은 링크를 참조해 주십시오).\n강의 실습 코드와 강의 설명 자료는 '실습코드와 설명자료 다운로드 받기'에서 다운로드 받으실 수 있습니다.\n선수 지식이 \n필요한 강의입니다.\n본 강의는 수강생 분들이 파이썬 머신러닝 완벽 가이드의 5장(회귀) 또는 이에 준하는 지식을 가지고 있는 것으로, 또한 SQL에 대한 매우 기본적인 부분은 아시는 것으로 간주하고 구성되었으니 강의 선택시 위 사항 참조 부탁드립니다.\nSpark는 기본적인 부분을 아시면 좋지만, 몰라도 강의를 따라가시는 데 문제가 없으실 것입니다.   \n선수 강의를 확인해주세요!\n파이썬 머신러닝 완벽 가이드\n이론 위주의 머신러닝 강의는 그만,\n머신러닝의 핵심 개념부터 실전 역량까지 쉽고 정확하게.\n지식공유자의 인터뷰가 궁금하다면? (클릭)\n지식공유자가 알려주는\n강의 수강 꿀팁!\n🎓\n이런 분들께\n추천드려요!\n스파크를 이용하여 머신러닝을 구현하고자 하시는 분\n대용량 데이터 기반에서 머신러닝을 구현하고자 하시는 분\nSQL을 이용하여 머신러닝을 위한 데이터 처리 기법을 향상시키기를 원하시는 분\n실전에서 원하는 형태로 데이터를 가공하고 이를 기반으로 ML 모델을 생성하는 모든 과정을 익히기 원하시는 분\n데이터 분석과 Feature Engineering 능력 그리고 ML 구현을 함께 향상시키고 싶으신 분\n📚\n선수 지식,\n필요한가요?\n파이썬 머신러닝 완벽가이드의 5장(회귀) 까지 이해 또는 이에 준하는 선수 지식\nSQL 기본 이해",
      "lectureDifficulty": "중급자"
    }
  },
  {
    "model": "lectures.lecture",
    "fields": {
      "thumbnail": "https://cdn.inflearn.com/public/courses/327136/cover/c951bb2b-1692-45e1-970c-01cd7843fb9c/327136-eng-resize.png",
      "lectureTitle": "ElasticSearch Essential\n대시보드",
      "lectureFee": 33000,
      "lectureDescription": "초급자를 위해 준비한\n[데브옵스 · 인프라, 데이터 수집 · 처리] 강의입니다.\nElasticSearch 클러스터를 운영하기 위해 꼭 알아야 할 내부 동작에 대한 이해, 모니터링하는 방법, 사례를 기반으로 한 트러블 슈팅 방법을 알려주는 강의입니다. 이 강의를 통해 ElasticSearch 클러스터를 더 안정적으로 운영할 수 있습니다.\n✍️\n이런 걸\n배워요!\nElasticSearch 기본 개념\nElasticSearch 모니터링\nElasticSearch 동작 이해\nElasticSearch 트러블 슈팅\nElasticSearch, 제대로 활용하고 싶다면?\n원리 + 모니터링 + 트러블슈팅을 한번에!\nElasticSearch 클러스터 \n현업을 위한 핵심 노하우.\n오픈소스 분산 검색 엔진, Elasticsearch\nRPM을 이용한 쉬운 설치와 Rest API 기반의 사용법을 기반으로 ElasticSearch는 금세 인지도 높은 오픈 소스 계열에 합류했습니다. 특히 쿠버네티스 기반 컨테이너 환경으로의 전환이 가속화 되면서 빠르고 안정적으로 로그를 수집하고 조회할 수 있는 시스템이 필요해졌고, ElasticSearch가 좋은 대안으로 함께 각광받기 시작했습니다.\n누구나 쉽고 빠르게 시작할 수 있다는 장점 때문에 ElasticSearch 기반으로 로그 수집 시스템을 구축해서 운영하는 서비스가 많이 있습니다. 하지만, 쉽고 빠르게 시작한 만큼 서비스가 일정 규모 이상으로 커지게 되면 미처 생각하지 못한 다양한 이슈들이 발생하게 됩니다.\nElasticSearch는 클러스터로 구축할 수 있습니다. 때문에 용도에 맞게 올바르게 클러스터로 구축한다면 원하는 만큼의 성능을 보여줄 수 있으며, 노드 한두 대의 장애가 발생하더라도 서비스에 영향이 없을 만큼 안정적으로 운영할 수 있습니다. 이렇게 ElasticSearch를 클러스터로 구축하기 위해서는 그 기반이 되는 개념과 기술을 잘 알아야 합니다.\n우리의 목표는 ElasticSearch의 ‘핵심 동작’을 파악하는 것입니다.\nElasticSearch는 빠르게 발전하고 있으며 버전 업그레이드 주기 역시 그만큼 빠릅니다. 하지만 버전이 업그레이드되더라도 변하지 않는 내부 동작들이 있습니다. 안정적인 운영을 위해서는 바로 이런 내부 동작에 대한 이해가 필수적입니다. 특히 색인과 검색이 어떻게 이루어지는지, 샤드의 개수를 적절하게 설정하는 것이 왜 중요한지에 대해 이해하고 있어야 클러스터에 문제가 생기거나 성능 부족 현상이 발생할 때 적절하게 대처할 수 있습니다.\n그래서 이 강의에서는 ElasticSearch 특정 버전을 다루지 않습니다. 그 대신 모든 버전을 통틀어 동일하게 적용되는 핵심 동작을 설명하고, 클러스터를 운영하기 위해 필요한 모니터링 방법 및 문제가 발생할 때 어떻게 처리해야 하는지 등을 사례를 통해 살펴봅니다. 어떤 버전의 ElasticSearch를 운영하고 있더라도 적용하고, 응용할 수 있는 내부 원리를 탄탄하게 다져보시기 바랍니다.\n실무 ElasticSearch 활용에 대한 \n근본적인 고민을 해결합니다.\n이런 고민 있었다면 주목해주세요!\nElasticSearch 클러스터를 이미 구축해서 사용하고 있으신 분\nElasticSearch 클러스터의 잦은 장애로 서비스 안정성에 문제를 겪고 계신 분\nElasticSearch를 프로젝트 또는 서비스에 도입하려고 고민하고 계신 분\n💬 “ElasticSearch를 안정적으로 운영하고 싶은데 ElasticSearch에 대한 기반 지식이 부족해요.”\nElasticSearch의 색인 및 검색이 어떻게 동작하는지 알아야 왜 샤드의 개수가 중요한지를 이해할 수 있습니다. 이런 운영에 필요한 기반 지식들을 알려 드립니다.\n💬 “ElasticSearch 클러스터에서 자꾸 문제가 발생하는데, 원인 파악이 어렵고 대처하기 힘들어요.”\n내부 동작 원리를 알면 문제가 발생했을 때 어디에서 문제가 발생하는지 원인을 찾아내기 쉬워집니다. 이 강의를 통해서 트러블 슈팅을 할 수 있는 기본 지식들을 습득할 수 있습니다.\nElasticSearch Essential \n핵심을 잡는 4-Step\nStep #1\nElasticSearch에 대해 살펴봅니다.\nElasticSearch의 전반적인 특징과 운영을 위해 필요한 필수 개념들을 살펴봅니다. 클러스터란 무엇인지, 노드란 무엇인지 그리고 클러스터로서 가지는 ElasticSearch의 특징 등을 살펴보고, 인덱스, 샤드, 매핑 등과 같은 기본 개념들에 대해서 배우게 됩니다.\n✅ ElasticSearch 운영을 위해 알아야 할 필수 개념들을 이해할 수 있습니다.\nStep #2\nElasticSearch의 내부 동작을 이해합니다.\nElasticSearch 내부에서 색인/검색이 어떻게 처리되는지, 샤드의 개수가 왜 중요한지 살펴보고 주의해야 할 것들에 대해서 알아봅니다. text와 keyword 타입 필드의 차이점을 이해하고 언제 어떻게 활용하면 좋을지 익힐 수 있습니다.\n✅ ElasticSearch 내부에서 색인과 검색이 어떻게 동작하는지 이해할 수 있습니다.\nStep #3\nElasticSearch를 모니터링하는 방안을 학습합니다.\nElasticSearch는 CAT API를 통해 다양한 정보를 볼 수 있는 인터페이스를 제공합니다. CAT API 중 가장 많이 사용되는 CAT health, nodes, indices, shards 등에 대해 살펴 보고 각각을 언제 활용하면 좋을지 학습합니다. ElasticSearch 클러스터를 모니터링할 때 어떤 지표들을 살펴봐야 하는지, 그리고 그 지표들이 의미하는 것이 무엇인지 알 수 있습니다.\n✅ ElasticSearch 클러스터를 모니터링할 수 있는 방법을 알고, 주요 모니터링 지표들이 의미하는 바가 무엇인지 이해할 수 있습니다.\nStep #4\nElasticSearch 클러스터에서 발생하는 장애 사례의 해결 방법을 찾습니다.\nElasticSearch 클러스터를 운영하다 보면 상황에 따라 다양한 장애가 발생할 수 있습니다. 이 중 가장 빈번하게 발생하는 장애 상황들을 사례별로 살펴보며, 장애 원인을 파악하고 문제를 해결하는 과정을 통해 ElasticSearch 클러스터의 트러블 슈팅 과정을 학습합니다.\n✅ ElasticSearch 클러스터에서 발생하는 문제를 찾아내고 해결할 수 있습니다.\n현업에서 경험한 ElasticSearch 노하우를 전합니다.\n카카오에서 3년 이상 ElasticSearch 클러스터 구축 및 운영 업무를 진행하였으며, 책 『기초부터 다지는 ElasticSearch 운영 노하우』를 집필했습니다.\n현재는 당근마켓에서 SRE로 일하며 브런치 및 티스토리를 통해 다양한 지식을 공유하고 있으며, ElasticSearch와 관련된 오픈 소스를 만들기도 합니다.\n이 강의를 통해 많은 분들이 ElasticSearch를 이용하는 데 도움을 드릴 수 있기를 바랍니다 🙂\nQ&A 💬\nQ. ElasticSearch를 전혀 몰라도 들을 수 있나요?\n아닙니다. 본 강의에서는 ElasticSearch를 구축하는 과정은 다루지 않기 때문에 기본적인 수준의 경험을 필요로 합니다.\nQ. ElasticSearch 클러스터에 대한 운영 경험은 어느 정도로 가지고 있어야 하나요?\n큰 규모가 아니더라도, 기본적인 클러스터를 구축하고 문서를 색인해 본 경험 정도만 있어도 충분합니다.\n지식공유자가 알려주는\n강의 수강 꿀팁!\n🎓\n이런 분들께\n추천드려요!\nElasticSearch를 현업에 사용하려고 하는 사람\nElasticSearch에 대한 경험이 있으며 기초를 더 탄탄하게 하고 싶은 사람\n📚\n선수 지식,\n필요한가요?\n기본적인 리눅스 명령어\n기본적인 ElasticSearch 구축 경험",
      "lectureDifficulty": "초급자"
    }
  },
  {
    "model": "lectures.lecture",
    "fields": {
      "thumbnail": "https://cdn.inflearn.com/public/courses/326865/cover/62ef33f6-9205-4cc9-89aa-43dfc6173a8f/326865-eng.png",
      "lectureTitle": "딥러닝 CNN 완벽 가이드 - Fundamental 편\n대시보드",
      "lectureFee": 110000,
      "lectureDescription": "초급자를 위해 준비한\n[인공지능, 데이터 사이언스] 강의입니다.\n딥러닝·CNN 핵심 이론부터 다양한 CNN 모델 구현 방법, 실전 문제를 통한 실무 딥러닝 개발 노하우까지, 딥러닝 CNN 기술 전문가로 거듭나고 싶다면 이 강의와 함께하세요 :)\n✍️\n이런 걸\n배워요!\n딥러닝, CNN을 이루는 핵심 기술 요소\nTensorflow, Keras를 구성하는 중요 기반 Framework\nCNN 분류 모델의 성능을 향상하는 튜닝 노하우\nCNN을 활용한 이미지 분류 구현\n다양한 이미지 Augmentation 기법과 이를 활용한 모델 성능 향상 기법\nKeras ImageDataGenerator와 Sequence의 상세 메커니즘\n딥러닝 CNN을 위한 이미지 데이터 전처리(Preprocessing) 기법\nAlexNet, VGGNet, Inception, ResNet 등 핵심 CNN 모델\nXception과 EfficientNet 등의 최신 모델 적용\nPretrained 모델의 미세 조정(Fine Tuning) 학습 이해와 적용\n다양한 Learning Rate Scheduler 기법을 활용한 모델 성능 향상 방안\n이미지 전처리, 데이터 가공, 모델 생성, 최적 성능 개선, 성능 평가 등 실무 딥러닝 개발 방법\n제가 이 강의를 만든 이유 😚\n가장 빠르게 발전하는 딥러닝 분야, CNN\n딥러닝의 활용 분야중 딥러닝 CNN 기반의 컴퓨터 비전 영역은 가장 급격히 성장하고 있으며, 또한 가장 빠르게 변화하고 있는 분야입니다. 따라서 딥러닝 기반 컴퓨터 비전 분야에서 전문가로 성장하기 위해선 CNN에 대한 실전 구현 능력과 핵심 역량을 갖추는 것이 필수가 되었습니다. 이를 위해 '딥러닝 CNN 완벽 가이드 - Fundamental 편\"' 강의를 출시하게 되었습니다. 그리고 보다 Advance한 주제를 담아 '딥러닝 CNN 완벽 가이드 - Advance 편' 을 추후에 출시할 예정입니다.\n이번 강의에서 배우는 것\n이번에 출시한 '딥러닝 CNN 완벽 가이드 - Fundamental' 편은 딥러닝과 CNN의 핵심 기술 요소에 대한 깊이 있는 이론과 실습부터 CNN 이미지 분류 모델 구축을 위한 다양한 구현 기술과 모델 성능 최적화 방법을 제공해 드립니다. 그리고 많은 실습 예제들을 따라해 보면서 이미지 전처리, 데이터 로딩, tf.keras 프레임웍의 이해, 최신 CNN 모델의 내부 아키텍처 그리고 실전에서 활용될 수 있는 모델 성능 튜닝법등을 체득할 수 있게 도와드려 여러분을 딥러닝 CNN 기술 전문가로 성장시켜 드릴 것입니다.\n딥러닝 CNN 강의, 이 강의로 종결.\n130강, 30시간의 강의를 통해 CNN 이해에 필요한 모든 내용을 심도 깊게 담았습니다.\n아래 배우는 내용과 강의자료 일부를 확인해 보세요.\n강의자료를 미리 확인해 보세요 🙂\n이 강의의 특징\n1. 딥러닝과 CNN을 이루는 핵심 기술 요소에 대한 깊이 있는 이론과 실습\n딥러닝과 CNN의 핵심 기반 지식을 깊이 있는 이론과 실습을 통해 여러분의 머리 속에 인스톨시켜 드립니다.\n2. Tensorflow.Keras를 구성하는 핵심 Framework 이해\nTensorflow.Keras를 구성하는 핵심 Framework에 대한 상세한 설명과 실습을 통해 보다 유연하고 확장성 높은 강력한 Keras기반 CNN 애플리케이션을 구현할 수 있도록 도와드립니다.\n3. 이미지 전처리 부터 CNN 모델 최적 성능 튜닝까지!\n이미지 분류 모델 구현의 A-Z를 다양한 실습 예제를 통해 익히며 실전 능력 극대화\n딥러닝 기반 컴퓨터 비전 전문가로 성장하기 위해서는 이미지 처리를 위한 기반 기술을 함께 갖추어야 합니다. 이미지 전처리 방법, 이미지 배열과 특성, 이미지 라이브러리 활용법, Albumentations와 같은 전용 툴을 활용한 Augmentation 기법등 딥러닝 이미지 판별 모델 구현을 위한 이미지 처리 기반 기술을 상세하게 설명 드립니다.\n다양한 데이터 세트와 난이도 있는 실전 문제를 통해서 자유자재로 CNN 이미지 분류 모델 구현할 수 있는 능력은 물론이고 Augmentation과 Learning Rate 최적화, 그리고 EfficientNet등의 최신 모델을 활용한 이미지 분류 모델의 최적 성능 튜닝 기법을 익힐 수 있습니다. \n4. Modern CNN의 발전에 중요한 기틀이 된 핵심 CNN 모델을 소스 코드 레벨로 상세하게 설명합니다.\nCNN을 이미지 분류 모델을 넘어 더욱 확장된 Application에 사용하려면 Modern CNN 모델이 어떻게 발전되어 왔고, 이들을 이루는 핵심 기술이 무엇인지 이해하는 것이 중요합니다. 이를 위해 AlexNet, VGGNet, GoogLeNet(Inception), ResNet등 중요 핵심 CNN 모델의 아키텍처와 특성, 그리고 이들 모델들의 구현을 소스 코드 레벨로 상세히 설명 드립니다.\n실습 환경 안내\n실습 환경은 Kaggle에서 제공하는 notebook 커널로 수행합니다. Kaggle에 가입 하신 후 Code 메뉴를 선택하시면 Colab과 유사한 Jupyter Notebook 환경을 이용 하실 수 있습니다.\n\nKaggle Notebook 커널은 GPU P-100 VM을 무료로 제공합니다. 또한 수려한 UI환경과 Kaggle 의 다양한 데이터와도 쉽게 연동되어 매우 편리하게 실습을 진행할 수 있습니다. 실습 코드는 Tensorflow 2.4의 tf.keras 기반으로 작성되었습니다. 보다 자세한 실습 환경 설명은 세션0 의 실습 환경 소개 동영상을 참조해 주세요.\n강의 자료와 실습 코드는 '섹션 0: 강의 소개' 와 실습환경 소개의 강의자료와 실습코드 다운로드 받기에서 받으실 수 있습니다.\n여러분의 노력이 얼마나 소중한지 알기에.\n어떤 분야든 노력 없이는 전문가가 될 수 없습니다. 아니, 노력 없이 전문가가 되었다면 그건 전문가가 아닙니다. 여러분이 딥러닝 분야의 전문가가 되고 싶은 열망을 잘 알기에, 그리고 거기에 쏟는 노력의 소중함을 잘 알기에, 여러분이 딥러닝 공부에 투자하는 조금의 시간이라도 헛된 시간이 되지 않도록 심혈을 기울여 딥러닝 CNN 완벽 가이드 강의를 만들었습니다.\n본 강의는 여러분이 딥러닝 전문가로 성장할 수 있는 소중한 디딤돌이 되어 드릴 것입니다. \n  미리 배우면 도움이 되는 강의 ✨\n권철민 지식공유자님의, '머신러닝' 강의 시리즈\n1\n파이썬 머신러닝 완벽 가이드\n인프런이 만난 사람\n권철민님의 인터뷰를 만나보세요! | 보러 가기\n지식공유자가 알려주는\n강의 수강 꿀팁!\n🎓\n이런 분들께\n추천드려요!\n딥러닝과 CNN에 대한 기본 역량을 크게 향상시키고 싶은 분\nCNN에 대한 확실한 이해가 필요한 분\n컴퓨터 비전 분야에서 딥러닝 이미지 분류 모델을 활용하고자 하시는 분\nKaggle이나 데이콘의 이미지 분류 경진대회를 준비하시는 분\n기타 딥러닝 학습에 관심이 있으신 분\n📚\n선수 지식,\n필요한가요?\nPython 기본 구현 능력과 Numpy, Pandas에 대한 기초 이해가 필요합니다.\n머신 러닝에 대한 기초적인 이해도가 있으셔야 합니다. (오버 피팅이나 왜 학습/검증/테스트 데이터 세트가 필요한지 등)",
      "lectureDifficulty": "초급자"
    }
  },
  {
    "model": "lectures.lecture",
    "fields": {
      "thumbnail": "https://cdn.inflearn.com/public/courses/326673/cover/e430860b-4ad4-4b01-b4c7-64dccfc64b3a",
      "lectureTitle": "Slack 클론 코딩[실시간 채팅 with React]\n대시보드",
      "lectureFee": 39600,
      "lectureDescription": "중급자를 위해 준비한\n[웹 개발, 프론트엔드] 강의입니다.\nSlack 서비스를 따라 만들며 본격적인 리액트 웹 개발을 시작해봅시다! 회원가입, 로그인, 방 만들기, 실시간 채팅까지!\n✍️\n이런 걸\n배워요!\n리액트 웹 개발\n프론트 초기 세팅(CRA 없이)\nSWR(리덕스 대체)\nEmotion(스타일드 컴포넌트)\nSocket.io 실시간 채팅\n내 손으로 만드는 채팅 애플리케이션, \n효과적으로, 더 간단하게! 💬\n이 강의에서는?\nSlack(슬랙) 서비스를 따라 만들며 \n본격적인 리액트 웹 개발을 시작해봅시다!\n(슬랙+리액트, 일명 Sleact!)\n리액트 웹 개발, \n어떻게 배워야 하는 걸까요?\n요즘 리덕스를 잘 안 쓰는 추세라던데... \n자바스크립트에서 타입스크립트로 넘어가고 있다던데...\n진짜인가요?\n이런 말 많이 들어보셨나요? 슬프게도 사실입니다. 그래서 이 강의에서도 리덕스(Redux)를 걷어내고, 자바스크립트 대신 타입스크립트를 적용했습니다. 리덕스 없이도 리액트 앱 개발이 가능하고, 타입스크립트도 생각보다 어렵지 않다는 걸 보여드릴게요!\n이런 분들에게 추천드려요!\nReact 웹 개발 방법을 배워보고 싶은 분\nTypeScript를 새로 배워보고 싶은 분\n클론코딩을 통해 프론트엔드 파트를 구현해보고 싶은 분\n제로초 슬랙 클론,\n프론트엔드 고민 완벽 해결!\n최신 프론트엔드 트렌드에 맞춰 타입스크립트로 서비스를 제작합니다. 단, 타입스크립트가 꺼려지는 분들을 위해 자바스크립트로도 진행할 수 있게끔 강의를 구성했습니다. (자바스크립트 소스 코드 제공!)\n리덕스를 사용하지 않습니다. SWR이라는 라이브러리를 대신 사용합니다.\n회원가입, 로그인, 채팅방 생성, 사용자 초대, 실시간 채팅, 사용자 멘션, 이미지 업로드 등 채팅 애플리케이션 구현에 필요한 기능을 모두 구현합니다.\n강의에서 설명하지는 않지만, 백엔드 소스 코드도 함께 제공합니다.\n이런 스킬을 배워요.\nReact\nSWR\nSocket.io\nEmotion\nTypeScript\nWebpack+Babel\n직접 만들어보세요!\n회원가입, 로그인, 워크스페이스\n각종 워크스페이스 기능 구현\n실시간 채팅 및 온라인 리스트\n#1\n소스 코드를 \n제공합니다.\nhttps://github.com/zerocho/sleact (바로가기)\n#2\n질문에 빠르게\n대답해 드립니다.\n제 강좌의 장점은 Q&A입니다. 질문하시면 하루 안에 답변드려요.\n강좌 관련 내용을 자유롭게 질문하시면서 능동적으로 공부해 보세요.\n내용을 이해하기에 더 도움이 될 거예요!\n지식공유자를 소개합니다.\n제로초 블로그 및\n유튜브 채널 운영\n웹개발 베스트셀러\n<Node.js 교과서> 저자\n주식회사 오늘의픽업\nCTO\n자주 묻는 질문 💬\nQ. 타입스크립트, 꼭 알아야 하나요?\n개인적으로 타입스크립트를 배우시는 것을 추천드립니다. 자바스크립트 생태계는 점점 타입스크립트로 옮겨가고 있습니다. 다만 이 강좌에서는 자바스크립트 소스코드를 제공하고, 영상에서 타입스크립트를 적용하는 부분을 알려드리므로, 자바스크립트만으로도 진행하실 수 있습니다. (tsx, ts 파일을 jsx, js로 바꾸고 :타입, <타입> 부분을 지우면 끝입니다. 엄청 간단합니다)\nQ. SWR은 검증된 라이브러리인가요?\nNext.js와 now.sh를 만든 Vercel(구 Zeit)에서 만든 라이브러리입니다. 믿고 사용하셔도 됩니다. 깃헙 스타가 16,000개예요~\nQ. 세팅할 때 CRA를 쓰지 않은 이유가 있나요?\n저는 항상 강의에서 CRA를 하지 않고 수동으로 세팅하는 것을 원칙으로 하고 있습니다. 수동으로 세팅하는 법을 알아야 CRA의 원리도 알 수 있으니까요. 원리를 알고 나서 CRA를 쓰는 것을 추천드립니다.\n수강 전 참고해주세요!\nSocket.io는 2버전을 사용합니다. 2버전을 설치하셔야 합니다.\n실제 배포된 서비스는 sleact.nodebird.com 에서 확인 가능합니다.\n자주 묻는 질문은 FAQ로 정리해서 인프런 블로그에 올리겠습니다.\n영상이나 내용에 문제가 있는 경우 문의하시면 재편집해서 올립니다.\n강의에 없는데 구현이 궁금하신 것이 있는 경우, 많은 분들이 질문하시면 보너스 영상을 제작합니다.\n선수 지식 & 연계 강의\n필수 선수 지식\n웹 게임을 만들며 배우는 React무료 강의\n웹게임 여덟 개로 리액트, 바벨, 웹팩까지!\n타입스크립트를 더 배우시려면!\n웹 게임을 만들며 배우는 TypeScript\n요즘 대세! JS보다 안정적인 TS의 세계\n다른 클론 코딩 강의가 궁금하다면?\n[리뉴얼] React로 NodeBird SNS 만들기\n어마어마한 22시간 트위터 클론!\n  지식공유자가 알려주는\n강의 수강 꿀팁!\n🎓\n이런 분들께\n추천드려요!\n리액트 문법을 배우고 본격적으로 웹 개발을 하고 싶은 분\n단순한 튜토리얼 대신 제대로 된 서비스를 따라 만들고 싶은 분\n타입스크립트로 안정성을 높인 개발을 배우고 싶은 분\n📚\n선수 지식,\n필요한가요?\nHTML/CSS\nJS 기초 지식\nReact 기본 문법(무료 강좌 듣고 오세요)",
      "lectureDifficulty": "중급자"
    }
  },
  {
    "model": "lectures.lecture",
    "fields": {
      "thumbnail": "https://cdn.inflearn.com/public/courses/326364/cover/99d3cdc2-e6fe-44f5-a235-0563c951bfde/326364-eng.jpg",
      "lectureTitle": "지브러시 세계로 떠나는 여행자 가이드 (Zbrush)\n대시보드",
      "lectureFee": 66000,
      "lectureDescription": "입문자를 위해 준비한\n[CAD · 3D 모델링, 게임 아트 · 그래픽] 강의입니다.\n지브러시를 처음 접하는 입문자도 알기 쉽게 지브러시의 핵심 기능의 사용법을 학습하고 다양한 형태의 오브젝트와 캐릭터를 제작 하면서 digital sculpting 작업 프로세스를 익히는 과정입니다.\n✍️\n이런 걸\n배워요!\n지브러시 작업과정의 이해\n필수 기능 학습\n지브러시를 활용한 캐릭터 제작\n지브러스를 활용한 다양한 형태의 오브젝트 제작하기\n강의 하나로 지브러시 초보 탈출! 🚩\n3D 그래픽의 첫발을 내딛어 보세요.\n디지털 아티스트를 위한 \nZbrush 3D 그래픽,\n기초부터 활용까지 ✨\n3D 그래픽 툴을 활용한 캐릭터 제작 분야는 전문가와 비전문가의 경계가 희미해지고 누구나 상상하는 것을 만들어 창작 활동이 가능하도록 기술이 빠르게 발전하고 있습니다. 하지만 여전히 처음 접하는 분들에겐 낯설고 쉽게 적응이 어려운 분야이기도 합니다.\n는\n누구나 쉽게 점토를 자르고 문지르듯 \n가상의 공간에서 상상한 아이디어를 \n만들어볼 수 있는 3D그래픽 툴입니다.\n다양한 아이디어를 놀이처럼 만들어볼 수 있고, 누구나 쉽게 형태를 조절할 수 있기 때문에 지브러시(Zbrush)는 분야와 상관없이 거의 모든 디지털 창작자들이 사용하는 필수 툴이 되어가고 있습니다.\n이 강의는 지브러시를 처음 접하는 분들 혹은 지브러시의 작업 방식에 적응이 어려운 분들에게 가장 효율적인 작업 프로세스를 소개하고, 필수 기능들을 하나씩 활용해가면서 지브러시의 장점을 활용하고 적응할 수 있도록 돕고자 이번 강의를 마련했습니다. \n이런 분들께 추천합니다 🔍\n지브러시 학습을 \n시작한 뒤 \n적응에 어려움을 \n겪는 분\n2D 작업을 주로 하지만\n지브러시를 활용한\n3D 그래픽에\n관심이 있는 원화가\n3D 프린터를 활용해서 \n아이디어를 구체화하고 \n나만의 캐릭터를 \n만들어보고 싶은 초보자 \n지브러시를 활용해 \n더욱 복잡한 디테일을 \n표현해보고 싶은 \n3D 아티스트 \n조각, 조소, 설치 미술,\n디오라마 등 작품에\n지브러시 디지털 작업을 \n활용해보고픈 아티스트\n자신만의 캐릭터를 \n3D로 구현해보고 \n만들어 보고 싶은 \n모든 분 \n3D 공간에서 작업이 처음인 초급자분들도 쉽게 지브러시 핵심 기능의 활용 방법을 이해하고 3차원 공간에서 자유롭게 원하는 형태를 만들어 가는 작업 과정에 익숙해질 수 있습니다. \n초심자에게 가장 어려운 것은 새로운 환경과 새로운 도구에 익숙해지는 과정입니다. 지브러시는 그런 면에서 더욱 생소할 수 있습니다. 특히나 가장 힘든 것이 정보가 부족한 것이 아니고 어떤 정보가 나에게 필요한지 정확하게 알 수 없다는 점입니다. 수없이 많은 정보 중에서 나에게 꼭 필요한 것을 구분하고 학습 단계에 맞는 정보를 찾는 일은 정말 어렵고 많은 시간이 필요합니다. \n본 수업은 오랜 시간 지브러시를 활용해서 작업해오면서 경험으로 확인한 가장 합리적인 학습 방법을 제안합니다. 효율적인 작업 프로세스 및 필수 학습 내용을 녹여 초심자가 한 단계씩 따라오면서 자연스럽게 적응할 수 있도록 커리큘럼을 설계했습니다.\n지브러시의 작업 프로세스를 정확하게 이해하고 필수 기능의 활용법을 확실하게 재정비하고 싶은 분들에게 꼭 필요한 내용을 짧고 간결하게, 순차적으로 확인하고 반복 학습하여 익숙해지도록 준비했습니다. 급하지 않게 매일 조금씩 한 단계 한 단계 학습해 나가면 어느새 지브러시를 활용해 다양한 형태를 다양한 캐릭터를 만들고 있는 자신을 발견할 수 있을 것입니다. \n이 강의만의\n핵심 장점 네 가지! 📌\n하나. 생생한 3D 그래픽 실무 노하우\n오랜 시간 3D 그래픽 분야에서 지브러시를 활용하면서 체험한 효과적인 작업 과정과 노하우를 공유합니다. \n둘. 영상 + 글 + 그림으로 더 쉽게\n작업 과정에서 꼭 필요한 기능을 영상으로 나눠서 제공합니다. 경우에 따라 학습 내용을 글과 그림으로 제공해서 영상과 함께 상황에 따라 쉽게 공부할 수 있도록 수업을 구성하였습니다.\n셋. 실무 예제로 레벨 업!\n필수 기능 학습은 물론, 학습한 기능을 활용해서 다양한 예제를 제작하는 과정까지 다룹니다.\n넷. 피드백으로 만들어가는 살아있는 강의\n지브러시 업그레이드를 통해 추가된 기능 중 테스트를 통해 효과적인 기능을 확인하고 검증된 기능을 지속적으로 추가할 예정입니다. 학습자의 학습 과정과 피드백을 확인하면서 보완할 내용을 추가하여 학습에 도움을 드리려 합니다.\n영상 수업뿐만 아니라 글, 그림, 자막으로 쉬운 이해를 돕습니다.\n더 자세한 내용을 \n확인해보세요 📚\n처음 만나는 Zbrush\n지브러시 화면 구성에 대해 이해하고, 지브러시의 독특한 작업 방식에 적응하는 시간입니다. \nZbrush 활용을 위한 필수 기능 학습 01\n오브젝트에 미세한 디테일을 추가하기 위해 밀도를 높여야 하는 이유를 이해하고 밀도를 높이기 위한 기능을 학습합니다. 브러시의 스타일을 변경하고 오브젝트 표면에 다양한 형태를 표현해 봅니다.\nZbrush 활용을 위한 필수 기능 학습 02\n오브젝트 표면의 밀도 조절을 위해 가장 중요한 기능 중 하나인 Dynamesh 기능과 대칭 작업을 위해서 꼭 필요한 symmetry 기능을 이해하고 적용해서 간단한 대칭의 캐릭터를 만들어 봅니다.\nZbrush 활용을 위한 필수 기능 학습 03\nMask(마스크) 기능의 활용 방법을 이해하고 Mask를 활용해서 오브젝트의 특정 부분을 변형하는 방법을 연습합니다. 다양한 도형을 더해서 형태를 변형하고 오브젝트의 밀도를 조절하면서 효율적인 작업을 진행하는 과정을 살펴봅니다. \n작업 효율성을 높이기 위한 기능 학습\n작업 과정의 효율을 높여주는 기능과 활용 방법을 학습합니다. Polygroup 기능을 이해하고 오브젝트의 특정 부분을 Polygroup으로 지정해서 작업을 효율성을 높이는 방법을 학습합니다.\n오브젝트 추가하고 변형하기 1\n하나 이상의 여러 오브젝트를 추가하고 이동/회전/크기 조절을 통해 변형해 보며, 다양한 오브젝트를 서브툴에 등록하고 관리하는 방법을 학습힙니다.\n기초를 배웠다면, 실습까지 OK.\n기초 내용을 바탕으로 제시하는 형태를 직접 만들어 보며 익히는 시간입니다. 화면을 멈추어 가면서 집중해서 제시한 형태를 만들어 보고 스스로 다양한 형태를 추가 제작해보길 바랍니다.\n오브젝트 추가하고 변형하기 \n같은 오브젝트를 좌우 대칭 되도록 추가하거나 비대칭 오브젝트를 대칭이 되도록 수정하는 방법을 학습합니다.\n오브젝트 추가하고 변형하기 \n캐릭터에 오브젝트 추가 작업하는 과정을 확인하고 각자 직접 작업해 보는 시간입니다.\nZremesher를 오브젝트 최적화하기\n오브젝트 Mesh 구조를 최적화하는 이유를 이해하고 Zremesher(지리메셔)를 활용해서 복잡한 형태의 오브젝트를 최적화 하는 과정을 학습합니다.\nZremesher를 오브젝트 최적화하기\nZremesher(지리메셔)를 실행한 후 Project를 활용해 원본의 디테일을 가져옵니다.\nEdge loop 기능을 활용한 오브젝트 변형 학습하기\nEdge loop(엣지 루프)는 지브러시에서 가장 활용도 높은 기능 중 하나입니다. Edge loop에 포함한 기능을 학습하고 앞서 학습한 다양한 기능을 함께 살펴보며 다양한 오브젝트를 추가하는 과정을 익혀봅니다.\n오브젝트 모서리 날카로움 조절하기_ Crease\nCrease(크리즈)를 적용해서 날카롭게 표현한 모서리를 성절하고 Bevel(베벨)을 추가 적용해서 Crease가 적용된 모서리의 기울기와 날카로운 정도를 수정합니다.\n오브젝트(캐릭터) 표면을 따라 새로운 오브젝트 추가 연습\n학습한 내용을 다양하게 활용해서 오브젝트 혹은 캐릭터의 표면에 다양한 오브젝트를 추가하고 최적화하는 과정을 연습합니다.\n생성한 오브젝트의 표면을 따라 새로운 오브젝트를 추가하는 다양한 방법\n오브젝트의 표면을 따라 다양한 형태를 추가하는 방법을 학습하고 직접 다양한 형태를 추가하면서 연습해 봅니다. \nBrush 직접 제작해서 활용하기\n자주 사용하게 될 형태나 반복해서 사용할 복잡한 형태를 미리 만들어서 활용하는 방법을 학습힙니다. \nBrush 스타일 변경해서 활용하기_ Slice brush\nBrush의 스타일을 변경해서 형태를 변형하는 다양한 방법을 학습합니다. \nBrush 스타일 변경해서 활용하기_ Slice brush\n브러시의 스타일을 변경해서 형태를 변형하는 다양한 방법을 학습합니다.\nCurve brush를 활용해서 오브젝트 추가 생성하기\n다양한 Curve brush(커브 브러시)를 활용해서 길게 이어지는 오브젝트를 표현하는 방법과 오브젝트의 경계면을 몰딩 처리하는 방법을 학습합니다.\n특별한 지식공유자를 \n소개합니다 👨‍💻\n닥터후\n현 청강문화산업대학교 게임콘텐츠스쿨 교수 \n3D 캐릭터 제작, 게임 제작 프로젝트, Digital sculpting(디지털 스컬프팅) \n유튜브 채널 - https://www.youtube.com/c/zetfree101/videos\n저서\n3D 모델링 마스터 클래스\n3DS Max 베이직 클래스\nZbrush 베이직 클래스\n서브스턴스 3D 베이직 클래스\n지식공유자의 생생한 포트폴리오를 확인하세요! 💻\n자주 묻는 질문 💬\nQ. 비전공자도 들을 수 있는 강의인가요? \n비전공자는 물론 3D를 전혀 경험해보지 않은 초심자도 충분히 따라올 수 있도록 학습 단계가 구성되어 있습니다. \nQ. 지브러시를 배워야 하는 이유가 뭘까요? \n디지털 스컬프팅은 이제 선택이 아닌 필수가 되어가고 있습니다. 찰흙을 빚고 돌을 깎듯이 직관적으로 형태를 변형할 수 있는 조소 작업을 가상의 공간에서 입체적으로 작업하면서 형태를 파악하고 조형감을 익히는 도구로도 활용할 수 있고, 다양한 작업에 광범위하게 활용할 수 있기 때문입니다.\n그중에서도 지브러시는 전세계적으로 가장 많이 보급되어 많은 아티스트가 활용하고 있습니다. 게임, 애니메이션, 영화 영상의 캐릭터나 배경 제작에도 빠질 수 없는 툴이 되었고 3D 프린팅을 활용한 피규어 제작에도 광범위하게 사용되고 있는 글로벌 스탠다드 툴입니다. 전문가가 되고 싶은 분뿐 아니라 3D 그래픽을 취미로 하고 싶은 분 혹은 원화가를 목표로 형태감을 좀 더 깊이 있게 학습, 표현하고 싶은 모든 분들이 목표에 다가가기 위해 지브러시를 활용해 보기길 적극 권해드립니다. \nQ. 지브러시를 활용하는 분야가 많이 있나요? \n게임 제작, 영화, 각종 영상, 애니메이션 등 거의 전 분야에서 활용되고 있습니다. 캐릭터 개발, 피규어 제작 등 3D프린터를 활용해서 실제 제품을 생산하는 곳에서도 필수로 사용하는 툴입니다. \nQ. 수강 관련 참고 사항(갖춰야 할 환경, 기타 유의사항 등)이 있나요?\n고사양 컴퓨터를 요구하지는 않지만 그래픽카드가 장착되어 있는 컴퓨터 추천 사양은 다음과 같습니다. \nOS: 64-bit editions of Windows Vista or newer.\ncpu: Intel i5/Xeon technology and newer or AMD Ryzen/Threadripper and newer\nRAM: 8GB required for working with multi-million poly models. (16+GB preferred.)\nHDD: 100GB of free hard drive space for ZBrush and its scratch disk. (SSD drive highly recommended.)\nMonitor: 1920x1080 monitor resolution or higher with 32-bit color.\nVideo card: Most cards manufactured 2008 or newer. Must support OpenGL 3.3 or higher.\n타블렛: 펜타블렛 또는 액정타블렛 (와콤, XP-Pen, 휴이온 등)\nQ. 지브러시를 배우면 어떤 일을 할 수 있나요? \n상상으로 그려보던 다양한 캐릭터를 점토를 붙이거나 조각하듯이 놀이처럼 만들어 가는 과정을 확인할 수 있습니다. 직접 디자인한 형태를 3D 프린터로 출력할 수도 있고, 한 장의 이미지로 저장해서 완성할 수 있습니다. 지브러시를 활용해서 피부와 천 가죽 등 표면의 디테일을 추가하고 복잡한 패턴을 적용한 후 게임이나 영상에 등장할 캐릭터나 배경에 적용해서 높은 퀄리티의 작업물을 제작할 수 있습니다. \nQ. 강의를 듣기 전 어떤 준비를 해야 하나요? \npixologic.com에서 무료 트라이얼 버전을 다운 받을 수 있고 선택에 따라서 월정액 혹은 영구 소장 버전을 구입할 수 있습니다. 컴퓨터에 학습에 필요한 지브러시를 설치하고 타블렛을 연결해서 문제 없이 동작하도록 준비합니다. \nQ. 수업 내용은 어느 수준까지 다루나요? \n지브러시를 처음 접하는 입문자를 기준으로 지브러시의 특징을 이해하고 필수 기능을 학습하는 것은 물론, 학습한 기능을 활용해 효율적인 프로세스와 다양한 형태를 실제와 유사한 작업 과정을 통해 따라해봄으로써 지브러시 핵심 기능과 작업 과정 전반을 이해할 수 있습니다. \n청강문화산업대학교는\n청강이 가면 길이 됩니다. 대학 건학이념 청강문화산업대학교는 남양알로에(現유니베라) 창업자인 故이연호 선생이 자연사랑, 인간사랑, 문화사랑의 교육이념 위에 사람을 사랑하며 참사랑을 키워내는 숭고한 교육이념을 실천하고자 설립한 학교입니다.\nwww.ck.ac.kr\n지식공유자가 알려주는\n강의 수강 꿀팁!\n🎓\n이런 분들께\n추천드려요!\n3D모델링과 스컬프팅에 관심이 있는 초보 창작자\n자신만의 캐릭터를 만들어 보고 싶은 모든 사람\n초급을 넘어가는 학습자중와 작업 프로세스, 핵심 기능 활용 형태를 잡아가는 다양한 방법과 기능의 학습 외에 중요한 기본기 까지 전반적으로 기초를 탄탄하게 잡고 싶은 분\n2D 원화를 지망하시는 분들 중 지브러시를 활용해서 입체적인 조형감을 익혀보고 싶은 분\n📚\n선수 지식,\n필요한가요?\n3d그래픽 혹은 캐릭터 제작에 대한 관심",
      "lectureDifficulty": "입문자"
    }
  },
  {
    "model": "lectures.lecture",
    "fields": {
      "thumbnail": "https://cdn.inflearn.com/public/courses/326174/cover/b0536120-7de3-4aa8-8266-97cf3881e87d",
      "lectureTitle": "비전공자를 위한 진짜 입문 올인원 개발 부트캠프\n대시보드",
      "lectureFee": 143000,
      "lectureDescription": "입문자를 위해 준비한\n[웹 개발, 취업 · 이직] 강의입니다.\n왕초보도 할 수 있는 웹, 서버, 모바일 앱, 머신러닝까지 익히는 끝판왕 풀스택 강의!! 개발을 어디서부터 시작할지 막막했다면 이 강의를 강력 추천할게요. Javascript 하나로 진행합니다!\n✍️\n이런 걸\n배워요!\nHTML, CSS, JS 기본\n웹 개발 (React)\n모바일 앱 개발 (React Native)\n서버 개발 (Node.js)\n머신러닝 개발 (Tensorflow js)\nGit\n클라우드\n필수 개발 지식\n쉽고 다양하게 활용되는 Javascript 로 공부해요!\nJavascript(자바스크립트)는 웹을 시작으로 서버, 모바일, 머신러닝, 블록체인 등 다양한 분야에서 사용되는 프로그래밍 언어예요.\n상대적으로 쉬운 난이도로 입문자가 배우기에 적합하고 모든 분야에서 활용될 수 있어요!!\n    이런 걸 만들 거예요👀\n상품을 사고 팔 수 있는 '그랩마켓' 서비스를 단계별로 구축합니다.\n\n      궁금해요 🙋‍♂️🙋‍♀️\nQ. 이 강의에서 무엇을 배울 수 있나요?\n프론트엔드\nHTML, CSS, FlexBox\nJavascript, ES6\nReact 라이브러리\nAntd, React-Router 라이브러리\nPostman\n반응형 웹 등\n백엔드\nNode.js\nExpress 프레임워크\nSqlite 데이터베이스 + Sequelize ORM\n이미지 파일 처리(multer)\n클라우드(Vercel, Heroku)\n상품 추천 API\n머신러닝\nTensorflow.js\n머신러닝, 딥러닝 메카니즘\nMobilenet\n모바일 앱\nReact Native\nExpo\nReact Navigation\nngrok\n기타\nGit & Github 버전관리\n추가 개발 지식 (REST API, JSON 등)\nQ. 개발을 모르는 비전공자인데 할 수 있을까요?\n비전공자도 충분히 학습할 수 있도록 심혈을 기울여 만들었어요! \n한 강의에 많은 걸 알려주지 않습니다. 배운 내용을 계단 삼아 단계별로 학습합니다.\n어려운 개념은 반복적으로 설명 및 활용합니다.\n저 그랩은 이미 수많은 비전공자를 대상으로 글을 쓰고 강의를 진행했어요 :)\n클래스 101 - 개발자가 되고 싶은 당신을 위해, 개발자가 되는 로드맵 A to Z\n인프런 - IT 회사에서 살아남기 위한 모든 개발 지식 A to Z 강의\n블로그 - IT 회사에서 살아남기 위한 모든 개발 지식 A to Z\n리디셀렉트 - 비전공자를 위한 IT 싱크 맞추기\n뉴스레터 - 그랩의 IT 뉴스레터\n유튜브 - 그랩의 IT 열차\n궁금한 점은 실시간으로 빠르게 답변드려요!\nQ. 완강하고 난 다음에 뭘 해야 할까요?\n본 강의를 들었다고 풀스택 개발자가 되는 것은 아닙니다. (절대!!) \n가장 먼저 지금까지 배운 지식을 토대로 본인이 관심 있는 분야를 정해서 전문성을 쌓는 걸 추천드립니다. 프론트엔드, 백엔드, 모바일 앱, 머신러닝 모두 좋아요. 그래도 헷갈리신다면 질문을 남겨주세요. 빠르게 답변드릴게요!\n\n개인 프로젝트, 스터디, 온라인 강의 등을 활용해서 한 분야의 전문성을 쌓으세요. 여러분이 꿈꾸는 모습으로 한 걸음씩 전진하다 보면 어느새 전문가가 되어있을 겁니다.💪🏼\n마지막으로 드리고 싶은 말\n배우고자 하는 의지와 꾸준함만 있다면 여러분들 모두 충분히 하실 수 있어요! 저 그랩과 함께 느리더라도 꾸준히 하다 보면 어느 순간 개발 커리어의 초석을 쌓을 수 있을 거예요.\n수업 때 다시 인사드리도록 할게요.😄 감사합니다.\n다른 추천 강의 🙂\nIT 회사에서 살아남기 위한 모든 개발 지식 A to Z\nIT 기업의 개발자들이 실제로 하는 일을 배워보세요.\n실제 업무 관점의 전반적인 프로세스를 통해 큰 그림을 그려드려요.\n  지식공유자가 알려주는\n강의 수강 꿀팁!\n🎓\n이런 분들께\n추천드려요!\n개발을 배우고 싶은 비전공자\n다양한 개발 분야를 배워보고 싶은 분들\n어려웠던 코딩 수업에 지친 분들\nIT 회사에서 개발자와 긴밀하게 협업하는 분들\n📚\n선수 지식,\n필요한가요?\n진심으로 배우고자 하는 열정",
      "lectureDifficulty": "입문자"
    }
  },
  {
    "model": "lectures.lecture",
    "fields": {
      "thumbnail": "https://cdn.inflearn.com/public/courses/326082/cover/c6519e92-f334-46ac-8a31-6290db19b32a",
      "lectureTitle": "타입스크립트 입문 - 기초부터 실전까지\n대시보드",
      "lectureFee": 55000,
      "lectureDescription": "초급자를 위해 준비한\n[프론트엔드, 프로그래밍 언어] 강의입니다.\n타입스크립트를 시작하는 분들을 위한 강의입니다. 최신 자바스크립트 문법을 모르는 분들도 쉽게 배울 수 있도록 교과 과정을 구성하였습니다. 어렵게만 느껴지는 타입스크립트를 입문자 관점에서 쉽고 재밌게 배워보겠습니다 😄\n✍️\n이런 걸\n배워요!\n타입스크립트 개발\n자바스크립트에 타입스크립트를 적용하는 방법\n타입 시스템\n프런트엔드 개발\nES6\n자바스크립트 프로젝트에 적용하며 익히는,\n쉽고 재밌게 배우는 타입스크립트 입문!\n\n이제, 타입스크립트 배울 시간! 🔔\n타입스크립트는 프론트엔드 개발 실무자라면 꼭 알아야하는 언어입니다. 구현한 기능에서 버그가 덜 나오게 도와주고, 유지 보수 관점에서도 코드의 역할을 더 빠르게 파악할 수 있습니다.\n그럼에도 타입스크립트는 막연하게 두려움의 대상이 되고 있습니다. 타입스크립트의 공식 문서가 난해할 뿐만 아니라, 쉽게 학습할 수 있는 자료가 많지 않기 때문입니다. 혹은 \"최신 자바스크립트도 익숙하지 않은데 타입스크립트라뇨?\"라고 생각하실 수 있습니다.\n이 강의는 최신 자바스크립트를 모르더라도 자바스크립트의 기초적인 개념만 알고 계신 분들도 학습하실 수 있게 구성되었습니다. 짧은 개념 설명과 실습 중심의 강의로 타입스크립트를 재밌게 입문하실 수 있도록 도와드릴게요.\n강의 구성 📚\n타입스크립트를 썼을 때의 장점과 자바스크립트를 타입스크립트처럼 코딩하는 방법\n타입스크립트의 기본 개념 (기본 타입부터 제네릭, 고급 타입까지)\n자바스크립트 프로젝트에 타입스크립트를 점진적으로 적용해나가는 방법\n타입스크립트의 내부 동작 방식과 타입 (Type) 추론을 이뤄나가는 과정\n\n강의에서 다루는 애플리케이션들 🎲\n여러분의 학습을 재밌게 해줄 프로젝트를 소개합니다.\n(실습 프로젝트 1 - 실습 프로젝트 2)\n실습 프로젝트 1\n할 일 관리 애플리케이션\n(To-Do App)\n  실습 프로젝트 2\n전화번호부 애플리케이션\n\n강의 관련 예상 질문 🙋🏻‍♂️\nQ. 프론트엔드 개발에 익숙하지 않은데 들어도 될까요?\nA. 이 강의는 자바스크립트의 기초적인 개념 (변수, 함수, 객체, 반복문, DOM 조작 등)을 알고 계신 분을 대상으로 구성한 강좌입니다. 자바스크립트의 기본 문법을 전혀 모르시는 분들께는 적합하지 않은 강좌니 아래의 사이트로 선수 학습을 하신 후에 수강하시는 것을 추천드립니다.\n자바스크립트 기초 문법\n자바스크립트 기본기 다지기\n자바스크립트 - 생활코딩\nQ. 강의 교안은 어디에 있나요?\n강의 교안은 아래 링크에서 확인하실 수 있습니다.\n타입스크립트 핸드북 바로가기\nQ. 실무에서 자바스크립트만으로도 잘 개발하는데 타입스크립트도 학습해야 할까요?\n복잡한 웹 애플리케이션을 여러 명이서 개발해보신 경험이 있다면 아마 문서화가 잘 된 코드, 가독성이 높고 한눈에 의미를 파악하기 쉬운 코드를 선호하실 거라고 생각합니다. 타입스크립트는 이러한 장점들을 극대화 시킬뿐만 아니라 코드를 쉽게 작성하도록 도와주고 향후 애플리케이션을 실행했을 때의 버그도 미리 줄여줄 수 있습니다. 학습해 보시면 개발하는 게 더 편해지실 거에요 😄\nQ. 이 강의를 들으면 바로 실무에 적용할 수 있나요?\n강의의 전체적인 흐름은 이미 구현된 자바스크립트 코드에 점진적으로 학습한 내용을 적용하면서 타입스크립트 프로젝트로 변환해 나가는 방향으로 설계되었습니다. 2개의 실습 프로젝트를 통해 배운 내용을 실제 프로젝트에 적용할 수 있는 경험과 자신감을 기를 수 있을 겁니다.\nQ. 강의를 듣기 위해 React나 Vue를 알아야하나요?\nReact나 Vue와 같은 대중적인 프레임워크 지식이 없어도 수강하실 수 있습니다. 언어의 전반적인 개념을 잡는데 집중한 강의라 프레임워크 지식은 없으셔도 됩니다.t-end, javascript, typescript, FE\n연관 로드맵 🚎\nVue.js와 TypeScript로 정복하는 프론트엔드 개발\n캡틴판교님의 뷰 + 타입스크립트로 한 번에\n배우는 강의들로 구성된 로드맵입니다.이 강의 포함\n\n지식공유자 소개 👨‍🏫\n장기효 (캡틴판교)\n현 프론트엔드 개발자\n\"Do it! Vue.js 입문\" 저자\n네이버, 이베이코리아, 삼성, LG, SK그룹 등 Vue.js 강의\n패스트캠퍼스 Vue.js 정복캠프 강의\nGoogle 웹 기술 공식 사이트 번역자\n기술 블로그, Github\n\"인프런이 만난 사람\" 인터뷰\n1편 _ 결국엔 '같이 간다'는 마음으로\n2편 _ 지금이 웹 개발하기엔 '참 좋은 시기'\n“강의 수익으로 Vue.js 오픈소스 +\n생활코딩을 후원합니다 😁”\n강의 할인을 제공합니다!\n시리즈 \"Vue.js로 완성하는 프론트엔드\n개발자 로드맵\" 25% 할인 (클릭)\n수입이 없는 중·고등학생,\n대학생을 위한 학생 50% 할인 (클릭)\n지식공유자가 알려주는\n강의 수강 꿀팁!\n🎓\n이런 분들께\n추천드려요!\n타입스크립트를 처음 시작하시는 분들\n타입스크립트 입문자\n자바스크립트에 타입스크립트를 적용하고 싶은 분들\n프런트엔드 개발자\n자바스크립트의 기본 문법을 알고 있는 웹 개발자\n타입스크립트로 되어 있는 프로젝트에서 퍼블리싱을 해야 하는 퍼블리셔",
      "lectureDifficulty": "초급자"
    }
  },
  {
    "model": "lectures.lecture",
    "fields": {
      "thumbnail": "https://cdn.inflearn.com/public/courses/325450/course_cover/a15141ac-4d33-4f6d-a38b-3a0b5773031c/webdesign-cover-03.png",
      "lectureTitle": "HTML+CSS+JS 포트폴리오 실전 퍼블리싱(시즌1)\n대시보드",
      "lectureFee": 46200,
      "lectureDescription": "초급자를 위해 준비한\n[웹 퍼블리싱, 프론트엔드] 강의입니다.\nHTML+CSS+JQUERY 초중급 퍼블리싱으로 다양한 실전 예제 학습을 통해 퍼블리싱 중급 실력을 위한 퍼블리싱 기본기를 익히시게 됩니다. 특히, 다양한 실전 예제를 통해 충분한 설명과 실전 작업으로 경험하고 퍼블리싱에 자신감을 생깁니다. 35시간이 넘는 충분한 학습량을 제공하는 퍼블리싱 수업입니다. (코딩웍스 유튜브 퍼블리싱 채널에 CSS 중급이론 학습을 병행하시면 더욱 효과적입니다.)\n✍️\n이런 걸\n배워요!\nHTML+CSS+JQUERY 핵심이론으로 퍼블리싱 기본기 향상\n웹사이트 퍼블리싱 실력과 노하우 향상\n블럭요소와 인라인요소에 대한 정확한 개념과 활용\nposition 속성에 대한 정확한 개념과 활용\nhover before after checked active 가상클래스에 대한 이해와 활용\n텍스트에디터 Brackets와 Emmet 사용법\n텍스트에디터 Visual Studio Code와 Emmet 사용법\nFlex 활용과 Transform 속성 개념과 활용\n인접선택자,속성선택자,checked 가상클래스 이해와 활용\n다양한 마우스 호버 이펙트\n폰트어썸 이해하고 활용하기\nCSS 탭 메뉴 콘텐츠, JQUERY 탭 메뉴 콘텐츠 제작 능력\n자바스크립트(JavaScript) 변수(var)와 조건문(if) 이해와 활용\n     코딩웍스, HTML+CSS+JQUERY 포트폴리오 중급 실전 퍼블리싱 강의 \n'퍼블리싱 필수이론과 실전예제 총 89개 강의 영상'\n'총 38시간 이상의 실전 퍼블리싱 강의 영상'\n'퍼블리셔 취업을 위한 Skill Up 필수 코스'\n'실무 퍼블리싱 진짜 실력을 위한 하드코딩 수업'\n\n▲ 위의 수강생분처럼 힘든 독학이지만 항상 열심히 하시는 분들 보면 뿌듯하고 고맙습니다.\n🙋🏻‍♂️ 질문하시기 전에 꼭! 읽어주세요~!!\n학습하시면서 궁금하신 사항이 있으시면 질문해주세요. 질문 주실 때는 안되는 내용과 코드 그리고 브라우저 결과 화면 캡쳐를 올려주셔야 합니다. 코드의 경우 HTML, CSS, JS 코드 모두 올려주셔야 정확한 답변을 드릴 수 있습니다. 그리고 코드를 올려주실 때는 비주얼 스튜디오 코드 캡쳐 익스텐션, CodeSnap을 사용하시면 편리합니다. 비주얼 스튜디오 코드 캡쳐 익스텐션, CodeSnap 사용법은 아래 코딩웍스 블로그에 있는 내용을 참고하세요.\n■ 코드 캡쳐 익스텐션 CodeSnap 사용법 : https://www.inflearn.com/blogs/1672\n  ⚡ 효과적인 학습을 위해 꼭! 코딩웍스 퍼블리싱 유튜브를 참고해주세요.\n\n코딩웍스 퍼블리싱 유튜브 채널에서 이론 영상 강의와 병행하시기 바랍니다. 물론 모든 이론 영상이 유튜브 채널에 있는건 아니지만 중요한 이론 영상은 거의 다 있습니다. 영상이 많으니까 영상을 찾는 방법은 아래 예시처럼 검색하시는게 좋습니다.\n코딩웍스 퍼블리싱 유튜브 채널 : https://www.youtube.com/codingworks\n  ▲ 국비지원 퍼블리싱 과정 저한테 4개월 반 정도 배운 학생인데, 취업했다고 카톡이 왔습니다. 뿌듯합니다~! \n여러분도 열심히 하셔서 꼭 좋은 결과 있길 기원합니다.\n▼ 코딩웍스 수강생께서 퍼블리셔 취업 후 보내 주신 이메일(2021.10.13)\n선생님 안녕하세요 :) \n선생님 인프런 강의 듣던 학생 김O정입니다.\n이번 여름 개인포트폴리오 관련해서 조언 얻고자 이메일 보냈던 학생입니다. \n기억나실련지요?ㅎㅎ \n다름이 아니라,\n선생님께 조언 얻었던 포트폴리오로 퍼블리셔 취업 성공했다는 소식을 전하고자 메일 보내요!\n심지어!! \n사람인에 올려둔 포트폴리오를 보고 회사쪽에서 먼저 연락이 왔고, 줌으로 면접을 보고 합격했습니다! \n회사쪽에선 희망연봉을 맞춰줬고 디자인, 개발 업무를 하지 않는 정말 퍼블리셔! 업무만 할 수 있는 회사에 들어오게 되었습니다.\n경력직 퍼블리셔를 구하는 회사였는데, 신입인 저에게 연락이 와서 왜 저에게 연락을 주셨냐고 물어보니\n다른 사람들 포트폴리오도 엄청 많이 봤는데, 제 포트폴리오에서 본 \"기능정의서\"가 눈에 띄어서 연락을 주셨다고합니다 \n이게 다 선생님의 강의 덕분이라고 생각합니다.\n선생님 강의를 듣지않았다면 저 역시 그냥 평범한 포트폴리오가 되었을텐데 선생님께서 말씀해주신 꿀팁들로 취업에 성공 할 수 있었습니다! \n비록 실제로 뵌적은 없지만,\n포트폴리오를 만드는 내내 선생님 강의 보면서 엄청 의지하고 믿고 열심히 만들었습니다! \n학원에서 긴 시간 수업을 들으면서 쌓았던 실력보다 선생님 강의를 듣고 포트폴리오를 만든 3달동안 실력이 엄청 상승했다는게 느껴집니다\n간절히 원했고,\n선생님이 말씀해주신대로 믿고 했더니 정말 좋은 결과가 나왔습니다.\n정말 감사드립니다!\n코로나 조심하시구요\n또 좋은 강의로 만나고싶습니다 :) \n▼ 코딩웍스 수강생께서 퍼블리셔 취업 후 보내 주신 이메일(2021.11.26)\n코딩웍스 선생님, 인프런 강의 수강자입니다~ \n선생님 안녕하세요~ 인프런 수강생 OOO이에요~ 선생님 메일 주소는 다른 수강생 답변보고 알았습니다..ㅎㅎ\n감사 인사 전해드리려구요 ㅎㅎ\n지금까지 선생님 강의 수강하고 2주 정도 이력서 내보면서 고생 좀 했는데요..\n회사 한 곳 면접 합격하여 출근하기로 했습니다.. 정말 감사드립니다..ㅠㅠ\n사실 제가 나이가 32살이라 걱정이 많았습니다 이력서를 많이 넣었는데 연락도 잘 안오고..\n근데 이 회사 인사담당자가 본인은 학원 출신은 안좋아한다고 하더라구요 ㅎㅎ\n제가 입사하기로 한 회사는 작지만 개발자도 있고 웹디자이너도 있습니다.\n3개월동안 교육시키고 실무에 투입하는 식이더라구요.\n거리도 좀 있고 연봉도 낮긴하지만.. 열심히 배워서 연봉을 올려보려구요~ ㅎㅎ\n그 동안 정말 감사했습니다. 질문 답변도 잘해주시고 이렇게 온라인으로 강의를 들어서 취업이 되니까 너무 신기하네요..\n앞으로도 선생님 강의 들으면서 실력 더 키우면서 공부하겠습니다. 화이팅~!\n        📔 하드코딩(Hard Coding) 실력이 진짜 퍼블리싱 실력입니다.\n제이쿼리 플러그인 사용해서 역동적이고 화려하게 꾸미는 퍼블리싱은 진짜 퍼블리싱이 아닙니다.\n진짜 퍼블리싱 실력은 HTML로 레이아웃 설계를 꼼꼼히 잘하고, CSS로 배치와 상세 디자인하고,  직접 작성한 제이쿼리(JQUERY)로  상호작용까지 만들 수 있는 것이 진짜 퍼블리싱 실력입니다.\n당장의 화려함에 제이쿼리 플러그인 사용에 의존하고 기본기 학습을 충실히 하지 않으면 웹 퍼블리셔로 취업하기 쉽지 않습니다. 설령 취업해서 실무에서 일하게 되더라도 퍼블리셔로서 어려운 하루 하루가 될 가능성이 높습니다.\n코드 한줄 한줄 직접 코딩하는 곧, 하드 코딩할 수 있는게 진짜 퍼블리싱 실력입니다.\n코딩웍스의 강의는 꼼꼼하고 정확합니다.\n1. 퍼블리싱! 너무 겁먹지 마세요. 자신감 갖고 시작하세요. 시작이 반입니다.\n2. 퍼블리싱! 궤도에 오르는 게 쉽다고 말할 수는 없지만, 반드시 보상으로 돌아옵니다.\n3. 퍼블리셔 취업을 위해 HTML+CSS+JQUERY 하드코딩 기본기가 중요합니다.\n코딩웍스 퍼블리싱 강의는 수강생을 이해시킬 수 없는 코드는 사용하지 않습니다. 수강생에게 원리를 이해시킬 수 있는 강의가 좋은 강의라 생각하고, 코딩웍스 강의는 그렇게 제작되었습니다.\n웹 코딩을 처음 시작하는 분들을 위해 쉽고 친절하게 강의 된 핵심이론과 실전예제를 통해서 퍼블리싱의 자신감을 가지시기 바랍니다.\nHTML+CSS+JQUERY 퍼블리싱을 시작하시는 분들께 드리고 싶은 말씀이 있습니다.\n볼만한 웹사이트를 하드코딩으로 혼자서 잘 만드는 퍼블리싱 실력을 갖추는 건 쉬운 일은 아닙니다. 정확히는 어렵습니다.\n알아야 할 이론도 많고 이론을 바탕으로 실전 제작해본 경험도 충분해야 합니다. 그리고 포토샵 UI 디자인 실력도 어느 정도 갖추고 있어야 합니다. 그러면 비로소 볼만한 웹사이트를 혼자서 잘 만드는 실력자가 될 수 있습니다.\n다만, 위에서 말씀드린 충실한 이론 학습과 이론을 활용한 예제 제작을 통해 실력이 확장되지 않은 상태에서 '포트폴리오 웹사이트 제작 따라하기'를 하시면 안 됩니다. \n물론 부지런히 따라 하면 '남의 것을 복사한 클론(clone) 포트폴리오'라는 결과물은 나오겠지만, 진짜 실력으로 이어지지 않습니다.\n여러분이 웹 퍼블리셔 취업을 위해 또는 디자이너가 웹 퍼블리싱 능력을 갖춰서 경쟁력을 갖기 위해서는 반드시 개인 포트폴리오 웹사이트가 필요합니다. 앞서 말씀드린 충실한 이론학습과 실전 제작 경험을 갖추지 않고  따라 하기만으로 개인  홈페이지를 만들더라도, 하드코딩 실력이 받쳐주지 않으면 취업하셨더라도 실무에서 금세 부족한 기본기가 티가 납니다.\n개인 포트폴리오 웹사이트 제작 전에 충분한 이론학습과 이론을 활용한 여러 퍼블리싱 예제 제작 경험을 쌓기 바랍니다.\n📔 학습방법 안내\n제가 생각하는 '퍼블리싱 실력 키우기' 방법은... \n실전 퍼블리싱 예제 제작할 때 처음에 어떻게 만드는지 부담없이 시청만 하시고, 두번째는 보면서 따라하면서 만드시고, 세번째는 안보고 스스로 하시다가 정말 생각 안날 때 영상 참고하셔서 제작하세요. 그래야만 진짜 자신의 실력으로 남습니다.\n※ 퍼블리싱 실전예제 제작 공부하실 때 추천 학습방법\n1회차 - 그냥 아무생각 없이 영상을 끝까지 봅니다.(제작하는 흐름 정도 이해하시는게 목적)\n2회차 - 영상 보면서 따라하다가 멈추고 본인 코드 작성하고 브라우저 확인하고 다시 재생하고 이런 식으로 하세요.\n3회차 - 영상을 보지 않고 소스 파일(이미지, 텍스트)만 준비해서 영상의 도움없이 스스로 만드세요. (정말 생각 안나면 잠깐 보시구요.)\n🙋🏻‍♂️ 강의 관련 예상되는 질문과 필독사항\nQ. 예제 제작하면서 나오는 중급 CSS 이론 설명 영상이 있나요?\nA. '예제 제작하는데 기초이론에 나오지 않은 중급이론이 많이 나오는데 중급 이론 수업은 어디서 듣나요?' 이런 질문이 게시판에 자주 올라옵니다.\n지금 과정은 초급 퍼블리싱 예제 제작을 하는 과정은 아닙니다. 초급~중급 퍼블리싱 예제를 제작하는 과정입니다. 그래서 CSS 초중급 이론은 어느 정도 알고 있으셔야 합니다. 그렇다고 꼭 잘 아실 필요는 없습니다. CSS 초중급 이론은 예제를 제작하면서 지속적으로 반복합니다. 그리고 코딩웍스 유튜브 퍼블리싱 채널에 [중급이론] CSS 중급이론 이라는 재생 목록에 예제 제작에 필요한 필수 중급 이론 영상이 자세히 있으니, 지금 과정을 들으시면서 중급 이론을 병행하시면 좋습니다.\nQ. 이 과정 수강하면 실무에서 퍼블리셔로 일할 수 있을까요?\nA. 이 과정에 있는 퍼블리싱 내용을 모두 이해하고 잘 활용할 수 있다면 가능합니다. 하지만 퍼블리싱이라는게 충분한 경험이 있어야 실무에서 일할 수 있습니다. 지금 과정과 같은 것들을 몇개 더 공부하시고 전체 웹사이트 제작 과정을 몇개 공부하시면 될 거라 생각됩니다. 물론 개인 포트폴리오 홈페이지 제작도 하셔야 됩니다. 퍼블리싱이 진입장벽이 생각보다 높은 편입니다. 영상 한번 보신다고 그 안에 내용과 노하우가 모두 학생에게 전해지는건 아니기 때문에 위에 설명한 학습방법을 통해서 내 것으로 만드는 과정을 하시기 바랍니다.\nQ. 실전 예제  제작하면서 이론 파트에 설명이 안된 부분이 있는데요? \nA. 입문 초급을 위한 기본 이론 영상을 올려놓은 것은 혹시 부족하다고 생각하시는 이론이 있으면 참고하라는 의미로 올린 영상들입니다.  실전 예제 제작 영상에서 이론 파트에 없는 내용이 나오는데 이론 파트에 없는 내용이 예제 제작에서 왜 나오냐고 질문글을 올리시면 제가 답변 드리기가 곤란합니다.\nQ. 공부하다가 모르는게 있으면 질문은 어디에 하나요? \nA. 질문이 있으시면 [질문&답변] 게시판에 글을 남기시면 바로는 아니어도 확인되면 답변을 드립니다. 그리고 질문은 최대한 구체적으로 해주세요. 질문이 구체적이지 않았을 때 충분한 답변이  좀처럼 쉽지 않습니다. 그래서 질문하실 때는 궁금하신 내용과 함께 작성 중이신 HTML, CSS, JQUERY 코딩 화면 캡처해서 첨부해 주시면 답변드리기가 훨씬 수월합니다.\nQ. 반응형 웹사이트 제작 강의가 있던데 어떤 것을 먼저 들어야 하나요? \nA. 반응형 웹사이트 전체를 제작하는 과정을 듣기 전에 지금 과정에서 충분히 이론과 실전 예제 제작에 대한 실력을 높이시고 반응형 웹사이트 전체 제작 과정으로 오시는 것을 추천드립니다. 반응형 웹사이트 전체 제작 과정이라 지금 과정처럼 부분 부분 상세하게 다루기가 어렵기 때문에 실전 퍼블리싱 과정에서 충분히 훈련되고 웹사이트 전체 제작과정으로 오시면 이해도가 훨씬 높을거라 생각됩니다.\nQ. 강사님 수업 중에 퍼블리셔 취업 진짜 실전 가이드를 먼저 보면 좋을까요? \nA. 퍼블리싱 스킬를 더 익히는 것도 중요하지만 먼저 퍼블리셔로서 기본기를 갖추는 것이 우선되어야 합니다. 퍼블리셔 취업 실전가이드 전자책(PDF)에서는 퍼블리싱 기본기란 바람직한 코딩습관과 원칙, 경력자 처럼 퍼블리싱 하기 등 퍼블리셔로서 반드시 알아야 하는 내용을 꼼꼼히 정리했습니다. 퍼블리셔 취업 실전가이드 전자책(PDF)을 먼저 보시고 퍼블리싱 기본기에 대한 이해도를 충분히 갖고 학습하시기를 권해드립니다. 아래 이미지를 클릭하시면 수업 소개 내용을 보실 수 있습니다.\n📔 업데이트 안내\n[업데이트 안내, 학습방법 안내] HTML+CSS+JQUERY 포트폴리오 퍼블리싱 필수 이론 및 실전 예제 제작 강좌\n코딩웍스, HTML+CSS+JQUERY 포트폴리오 퍼블리싱 필수 이론 및 실전 예제 제작 강좌를 수강해주셔 감사드립니다. 그리고 앞으로 수강하실 많은 분들께도 미리 감사드립니다..^^\n본 강좌는 당분간 지속적으로 업데이트가 있을 예정입니다. 업데이트가 있으면 '인프런 새소식'을 통해 알림을 드립니다. 최종 업데이트 전까지 기존에 있는 이론과 실전 퍼블리싱을 잘 따라오시면 서 제작하시기 바랍니다.^^\n📔 섹션 4. HTML+CSS 실전 퍼블리싱 제작(Part 2) - 업데이트 완료(2020.08.18)\n  01.가상클래스 hover 활용한 실전 예제 제작 (기본형 드롭다운 네비게이션)\n02.before after 가상클래스 활용한 실전 예제 제작 (네비게이션 호버이펙트 - Border)\n03.before after 가상클래스 활용한 실전 예제 제작 (네비게이션 호버이펙트 - content attr)\n04.before after 가상클래스 활용한 실전 예제 제작 (네비게이션 호버이펙트 – Rotate)\n05.라디오버튼과 체크박스를 커스텀 체크박스로 스타일링 (배경이미지를 사용)\n06.라디오버튼과 체크박스를 커스텀 체크박스로 스타일링 (폰트어썸 아이콘을 사용)\n07.순서 체크 가상클래스 활용한 실전 예제 제작 (개인 프로필 카드 UI 호버 이펙트)\n08.폼 관련 가상클래스를 활용한 실전 퍼블리싱 (배경 이미지 풀스크린 검색창)\n09.폼 관련 가상클래스를 활용한 실전 퍼블리싱 (로그인 화면)\n📔 중고급 레벨 Jump Up 퍼블리싱 이론과 팁(Tip) 예정 목록\n실전 예제  제작에 꼭 필요한 이론 뿐만 아니라 퍼블리싱 Skill Up을 위해 필요한 핵심이론과 팁을 지속적으로 업데이트합니다. Skill Up을 위해 필요한 핵심이론과 팁 영상이 업데이트가 있으면 새소식을 통해서 알려드립니다.\nSkill Up을 위해 필요한 핵심이론과 팁 영상은 섹션 7에 순차적으로 업데이트됩니다. 새소식을 받지 못하셨더라도 섹션 7에 오셔서 학습이 필요한 영상이 있는지 체크해주시기 바랍니다. 화이팅~^^\n※ Jump Up 퍼블리싱 이론과 팁 영상에서 공부하시는 학습 예제 완성본은 해당 영상의 우측 상단에 수업자료를 누르시면 zip파일을 받으실 수 있습니다.\n섹션 7. 중고급 레벨 Jump Up 퍼블리싱 이론과 팁(Tip)\n웹 퍼블리셔를 위한 크롬 확장 프로그램 추천(6가지)  (완료, 2020.05.31)\na태그 앵커로 원하는 부분 부드럽게 찾아가는 2가지 방법 (제이쿼리 플러그인, CSS 속성) (완료, 2020.07.25)\nbody 안에 또 다른 html 불러와서 보여주는 iframe 활용하기 (완료, 2020.07.25)\ninput 태그의  :checked와 확장선택자(인접선택자, 형제선택자, 속성선택자)로 만드는 CSS 클릭 이벤트 (완료, 2020.07.25)\n인라인 자바스크립트 활용하기(div에 href 링크걸기, 뒤로가기, 앞으로가기, 새로고침, 창닫기)  (완료, 2020.07.26)\n퍼블리싱 강사가 강의를 잘하는지 못하는지 구분하기(display 속성의 이해도) (완료, 2020.08.2)\n상대적인 폰트 크기 em 단위와 rem 단위 이해하기 (완료, 2020.08.2)\n웹사이트 제작 시 반드시 알아야 하는 폴더 파일 경로 이해하기(절대주소 vs  상대주소) (예정)\n제너레이터에 의존하지 않고 직접 좌표를 찾아 직접 코딩하는 이미지맵(Image Map) 제작 (예정)\n요소의 앞뒤를 디자인하는 가상클래스의 꽃(before, after) 완벽 이해하기 (예정)\n📔 실전 퍼블리싱 예제 업데이트 완료 목록\n탭 메뉴 콘텐츠 퍼블리싱 with JQUERY (스타일 01) (완료, 2020.05.30)\n퍼블리셔로서 꼭! 알아야 하는 자바스크립트, 변수(var)와 조건문(if) - 20세 성인 체크 (완료, 2020.06.02)\n자바스크립트 변수와 조건문을 이용한 별점 주기 실전 퍼블리싱 with jQuery (완료, 2020.06.02)\n비주얼 스튜디오 코드(Visual Studio Code)와 Emmet 사용법 (완료, 2020.06.05)\n탭 메뉴 콘텐츠- 스타일 02(프로토타입) with jQuery  (완료, 2020.06.07)\n탭 메뉴 콘텐츠- 스타일 02(실전 제작) with jQuery  (완료, 2020.06.07)\n마우스 올리면 배경이미지 변경하기 퍼블리싱 프로토타입 with jQuery (완료, 2020.06.07)\n쇼핑몰 아이템 UI 호버 이펙트 with jQuery (완료, 2020.06.07)\n코딩웍스 강의특징 어코디언 콘텐츠 슬라이드 with jQuery (완료, 2020.06.10)\n  💡 섹션 6. 로그인 화면 UI 디자인 (완료, 2020.06.20)\n[Part 01] 로그인 화면 UI 디자인(제작노트, HTML 구조 설계하기, 파비콘 넣기)\n[Part 02] 로그인 화면 UI 디자인(CSS 디자인 - 크기조절하기 및 배치하기)\n[Part 03] 로그인 화면 UI 디자인(CSS 디자인 - 버튼 디자인 및 체크박스와 Label)\n[Part 04] 로그인 화면 UI 디자인(CSS 디자인 - before after로 구분선 디자인)\n로그인 UI 디자인 실전 웹페이지 퍼블리싱 영상이 업데이트 되었습니다. 이번에 업데이트된 강의 영상은 섹션 7에 총 4개 파트로 되어 있습니다. 다운로드할 수 있도록 완성본도 업로드 되었습니다.  연습하실 때 완성본을 다운로드 하시고 index.html과 style.css를 삭제하시고 영상 처음부터 천천히 따라오시면 됩니다.\n로그인 UI 디자인 퍼블리싱은 제이쿼리 상호작용은 없는 정적인 퍼블리싱이지만 CSS의 핵심 속성인 박스모델, 보더, 백그라운드 이미지, 색상, checkbox와 label 사용하기 등 전반에 걸친 모든 CSS 속성을 공부하시기에는 최적의 예제라고 생각됩니다.\n💡 Pure CSS 콘텐츠 슬라이더 프로토타입 (완료, 2020.06.16)\n자바스크립트 또는 제이쿼리를 사용하지 않은 순수 CSS 제작하는 풀스크린 탭 메뉴 콘텐츠\n배경색을 이용한 프로토타입 제작 후 배경이미지와 텍스트 애니메이션을 활용한 응용 실전 예제\n  ▼ Pure CSS 콘텐츠 슬라이더 프로토타입 01 (풀스크린 탭 콘텐츠 슬라이더 프로토타입)\n▼ Pure CSS 콘텐츠 슬라이더 프로토타입 02 (풀스크린 탭 콘텐츠 슬라이더 응용)\n💡 비디오 백그라운드를 활용한 랜딩페이지 실전 퍼블리싱 with jQuery (완료, 2020.06.14)\n비디오를 배경으로 사용해서 body에 가득 채우고 은은한 배경 음악 깔고 볼륨 조절하기\n시작할 때 콘텐츠에 서서히 나타나는 CSS 키프레임 애니메이션 만들기\n구글 웹폰트로 다양하게 텍스트 서식 꾸미기, CSS로 예쁜 버튼 디자인 만들기\n풀스크린 네비게이션 작동시키는 애니메이션 햄버거 버튼 CSS로 만들기\n제이쿼리로 풀스크린 네비게이션 띄우기(toggleClass, fadeToggle)\n가상클래스 :before로 비디오 프레임에 그라디언트 오버레이 씌우기\n완성본 미리보기 : https://youtu.be/tuVTiZtii0s\n완성본 제작노트 : https://youtu.be/LcIKADuM7TA\n▼ 탭 메뉴 콘텐츠 퍼블리싱 with JQUERY (스타일 01) (완료)\n▼ 퍼블리셔라로서 꼭! 알아야 하는 자바스크립트, 변수(var)와 조건문(if) - 20세 성인 체크 (완료)\n자바스크립트 변수(var)와 조건문(if)의 개념이해 수업\n▼ 자바스크립트 변수와 조건문을 이용한 별점 주기 실전 퍼블리싱 with jQuery (완료)\n자바스크립트 변수(var)와 조건문(if)의 개념을 활용한 실전 퍼블리싱\n제이쿼리 메서드 : addClass() removeClass() text() html() val() prevAll() nextAll() index()\n▼ 비주얼 스튜디오 코드(Visual Studio Code)와 Emmet 사용법 (완료)\n▼ 탭 메뉴 콘텐츠 퍼블리싱(스타일 02) with jQuery (완료)\n검색창 placeholder  텍스트 디자인 변경\n검색창 클릭하면(:focus) placeholder 서서히 사라지고 클릭 빠지면 서서히 나타나게 하기\nCSS로 탭 메뉴 콘텐츠 디자인 하기(특히 보더 디자인)\n제이쿼리 탭 메뉴 콘텐츠 기능을 위한 스크립트 작성하기 - addClass(), removeClass(), siblings(), 사용자 정의속성 data-alt, var, attr() 메서드로 속성 가져오기\n프로토타입 제작과 실전 제작 2개로 나뉘어 있으니, 프로토타입 먼저 학습하시고 실전 영상 보세요.\n▼ 마우스 올리면 배경이미지 변경되는 퍼블리싱 프로토타입 with jQuery  (완료)\nCSS로 배경이미지 넣기(backgorund 속성)\n가상클래스 :before의 content: attr()을 활용해서 채워지는 텍스트 네비게이션 만들기\n제이쿼리 mouseenter와 mouseleave로 사용자 정의 속성에 있는 값을 attr()로 불러와서 CSS로 배경이미지 교체하기\n  ▼ 쇼핑몰 아이템 UI 호버 이펙트 with jQuery (완료)\nCSS로 부모요소 자식요서 배치하고 상세 디자인하기\n마우스 오버하면 상품상세 보여주면서 CSS filter 속성으로 이미지 블러 처리\nSize 선택과 Color 선택하면 디자인 변경하기(addClass, removeClass)\n좋아요 버튼 누르면 가상클래스 :before의 content 내용 폰트어썸 유니코드로 변경하기(toggleClass)\n▼ 코딩웍스 강의특징 어코디언 콘텐츠 슬라이드 with jQuery (완료)\nflex로 수평 수직 중앙배치하기\n가상클래스 :after로 카톡 로고 원하는 위치에 정확히 위치시키기\n타이틀에 오버되면 디자인 변경되면서 화살표 폰트어썸 아이콘 디자인 변경되면서 회전시키기\n타이틀을 클릭하면 타이틀의 디자인이 변경되면서 해당되는 콘텐츠를 슬라이딩으로 보이기(addClass, removeClass, slideDown, slideUp)\n타이틀 클릭하면 오른쪽에 이미지 타이틀의 사용자 정의 속성에 지정된 data-image의 값을 attr()을 통해 교체하기\n▼ 제이쿼리 반응형 애니메이션 모달(Modal)\n💡 HTML+CSS 실전 퍼블리싱 강좌 결과물 미리보기\n  ▼ 01. CSS 키프레임 애니메이션 활용한 실전 예제 제작 01(원형 크기 변경 로딩 애니메이션)\n▼ 02. CSS 키프레임 애니메이션 활용한 실전 예제 제작 02(사각형 좌표 변경 로딩 애니메이션)\n  ▼ 03. CSS 키프레임 애니메이션 활용한 실전 퍼블리싱 03(더블 보더 레디어스 애니메이션)\n▼ 04. 가상클래스 hover 활용한 실전 퍼블리싱 01(오버하면 상세설명 나타나는 상품목록)\n▼ 05. 가상클래스 hover 활용한 실전 퍼블리싱 02(마우스 오버되면 나타나는 툴팁 만들기)\n▼ 06. 가상클래스 hover 활용한 실전 퍼블리싱 03(오버한 메뉴 외 나머지 흐려지는 네비게이션)\n▼ 07. 가상클래스 hover 활용한 실전 퍼블리싱 04(위아래로 분리되는 호버 네비게이션 이펙트)\n▼ 08. 가상클래스 hover 활용한 실전 퍼블리싱 05(앱 UI 레이어 3D 호버 에니메이션)\n▼ 09. 가상클래스 before after 활용한 실전 퍼블리싱 01(before after 기본 사용법)\n▼ 10. 가상클래스 before after 활용한 실전 퍼블리싱 02(애니메이션 호버 네비게이션 이펙트)\n▼ 11. 가상클래스 before after 활용한 실전 퍼블리싱 03(SNS 아이콘 애니메이션)\n▼ 12. 가상클래스 before after 활용한 실전 퍼블리싱 04(content attr을 활용한 텍스트 네비게이션)\n▼ 13. 입력 필드 디자인을 꾸미는 가상클래스 활용한 실전 퍼블리싱(폰트어썸 사용한 입력 필드)\n▼ 14~15. 순서 체크 가상클래스 활용한 실전 퍼블리싱 01(애니메이션 스킬 프로그래스, delay)\n▼ 16. 순서 체크 가상클래스 활용한 실전 퍼블리싱 03(Flexbox 활용한 갤러리 이미지 어코디언 네비게이션)\n▼ 17. 확장선택자와 함께 가상클래스 checked 실전 퍼블리싱 01(애니메이션 햄버거 버튼 만들기)\n▼ 18. 확장선택자와 함께 가상클래스 checked 실전 퍼블리싱 02(애니메이션 사이드메뉴 만들기)\n▼ 19. 확장선택자와 함께 가상클래스 checked 실전 퍼블리싱 03(탭 메뉴 콘텐츠 만들기)\n▼ 20. 확장선택자와 함께 가상클래스 checked 실전 퍼블리싱 04(탭 콘텐츠 - Opacity)\n▼ 21. 확장선택자와 함께 가상클래스 checked 실전 퍼블리싱 05(탭 콘텐츠 – Opacity 응용)\n▼ 22. 확장선택자와 함께 가상클래스 checked 실전 퍼블리싱 06(탭 콘텐츠 - Slide)\n▼ 23. 확장선택자와 함께 가상클래스 checked 실전 퍼블리싱 04(Testimonial 탭 슬라이더)\n▼ 어코디언(Accordion)with jQuery\n▼ 모달(Modal) with jQuery & :target\n  💡 학습 전 필독사항\n학습 전 CSS 필수이론 및 CSS 중급이론 먼저 학습이 필요합니다.\n해당 강좌는 예제를 중심으로 학습하는 과정입니다. CSS 필수이론 및 CSS 중급이론 먼저 학습이 필요합니다. 그렇기 때문에 최소한 CSS 필수이론은 알고 예제 제작 학습을 하셔야 합니다. 예제를 계속 학습하시면 예제의 난이도가 지속적으로 올라갑니다. 그래서 모르는 이론이 계속 늘어나기 때문에 부담스러울 수 있습니다.\n너무 기초적인 질문을 하시게 되면 앞으로 정말 많은 질문글을 올리시게 됩니다. 답변하는 사람으로서도 구글에서 검색하면 어렵지 않게 알 수 있는 내용을 질문하시면 답변 드릴 때도 흥이 나지 않습니다.\n기초적인 질문을 하지 마시라는 말이 아닙니다. 저도 독학했지만 독학하는거 어려운 일입니다. 막힐 때 물어볼 사람도 없고 답답하죠. 하지만 막히고 궁금한 점이 있으면 먼저 구글링해서 알아보세요. 한국인 블로거가 잘 설명해 놓은 내용이 정말 많습니다. 검색해서 공부했는데 궁금한 내용이 풀리지 않는 부분을 질문하시면 언제라도 제가 알고 있는 선에서 자세히 말씀드릴거에요.\n앞으로 실력 향상을 위해서 퍼블리싱 학습하시면서 정말 많은 것들을 알아가야 합니다.\n스스로 알아가는 과정에서 실력이 많이 늘게 됩니다. 하지만 스스로 찾아보고 이해하려해도 어려운 부분이 있을 수 있습니다. 그런 부분을 제가 도와드리겠습니다. 그리고 해당 강좌의 예제 제작에서 나온 코드의 내용에 관한 궁금한 내용은 질문하셔도 됩니다.\n혹시나해서 첨언하자면 지금 예제를 하시기 보다는 코딩웍스 유튜브 채널에서 CSS 필수이론 및 중급 이론을 먼저 학습하시고 예제를 하시기를 추천드립니다.\n🌏 코딩웍스 유튜브 채널 재생목록 - CSS 필수이론\nhttps://www.youtube.com/watch?v=-1_e38zLCXw&list=PLv_UUi9AVBVsziY1nF_9LxA6c_oaUdQ99\n🌏 코딩웍스 유튜브 채널 재생목록 - CSS 중급이론\nhttps://www.youtube.com/watch?v=PLrDCRrXdRk&list=PLv_UUi9AVBVvr9gODWpz6aZUS6VNvdsYq\n참고로 코딩웍스 강의 중에 [중상급 퍼블리싱을 위한 CSS3의 모든 것]이라는 강의가 있습니다. 해당 강의를 들으시면 완벽한 CSS 이론을 갖추실 수 있습니다. 이후 다른 예제 제작 및 웹사이트 제작 과정으로 오시면 학습 내용의 거의 대부분을 이해하시면서 학습하실 수 있기 때문에 학습 효율이 굉장히 좋을거라 생각됩니다. \n\n⚡코딩웍스 멘토링 소개 및 신청 : https://inf.run/wfoh\n  👨🏼‍🏫 강사소개\n(현재) 프리랜서 프론트엔드 퍼블리셔\n더조은 컴퓨터아카데미 웹 퍼블리싱 강사\n이젠 컴퓨터아카데미 웹 퍼블리싱 강사\n프론트엔드 퍼블리셔, 프론트엔드 퍼블리싱 전문강사\n이젠 컴퓨터아카데미 웹디자인 기능사 실기 자격증반\n라크피아 ICT 트레이닝 센터프론트엔드 퍼블리싱 마스터 코스 강사\n이지앤에듀프론트엔드 퍼블리싱, UI/UX 디자인\nHTML+CSS+JQUERY 퍼블리싱 유튜브 채널 '코딩웍스' 운영\n⚡ 코딩웍스 퍼블리싱 유튜브 채널 - https://www.youtube.com/codingworks\n  💡 커리큘럼\n※ 기본적인 퍼블리싱 이론을 알고 있으면 실전 퍼블리싱 제작을 학습하셔도 됩니다.\n※ 실전 퍼블리싱 제작 학습하다가 필요할 때 필수 이론을 참고하시면 됩니다.\n섹션 0. [미리보기] HTML+CSS 실전 퍼블리싱 예제 완성본 미리보기\n[완성본 미리보기] HTML+CSS 실전 퍼블리싱 제작\n[완성본 제작노트] HTML+CSS 실전 퍼블리싱 제작\n[완성본 제작노트] HTML+CSS 실전 퍼블리싱 제작 with jQuery\n[완성본 제작노트] 비디오 백그라운드를 활용한 랜딩페이지 실전 퍼블리싱 with jQuery\n섹션 1. 블라켓츠(Brackets) 및 비주얼 스튜디오 코드(Visual Studio Code) 사용법\n블라켓츠(Brackets) 사용법 및 단축키 활용\n블라켓츠(Brackets)에서 에밋(Emmet) 사용법 및 단축키 활용)\n블라켓츠(Brackets) 실시간 미리보기(폴더 구조 만들기)\n비주얼 스튜디오 코드(Visual Studio Code) 사용법 및 환경설정\n비주얼 스튜디오 코드(Visual Studio Code)에서 에밋(Emmet) 사용법\n섹션 2. 섹션01. HTML+CSS+JQUERY 퍼블리싱 필수 이론\nHTML5 핵심 태그 사용법(문단, 텍스트 서식)\nHTML5 핵심 태그 사용법(목록 만들기)\nHTML5 핵심 태그의 사용법(링크, 이미지)\nCSS 핵심이론(CSS란, CSS 링크하기, 기본 문법)\nCSS 핵심이론(선택자, 선택자 적용 우선순위)\nCSS 서식관련 속성(텍스트 스타일)\nCSS 서식관련 속성(목록 스타일)\nCSS 자손선택자 vs 자식선택자, 부모요소 vs 자식요소\n상세 디자인을 위한 CSS 박스모델(border, border-radius)\n상세 디자인을 위한 CSS 박스모델(width, height, padding, margin, box-sizing)\n상세 디자인을 위한 CSS 박스모델(box-shadow, text-shadow)\n퍼블리싱의 모든 것! HTML 인라인 요소, 블록 요소, 인라인블록 요소\nCSS로 HTML 가로 배치하기(float, overflow, clear, inline-block)\nHTML5 시멘틱 태그로 CSS 레이아웃 설계하기(부모요소, 자식요소, 형제요소)\nCSS 포지션 속성 완벽하게 이해하기(1편) – 부모요소 vs 자식요소\nCSS 포지션 속성 완벽하게 이해하기(2편) – 자동으로 수평 수직 중앙 위치시키기\nCSS 포지션 속성 완벽하게 이해하기(3편) – 부모요소 밖으로 위치시키기\nCSS 필수 가상클래스 – 마우스 오버 효과(hover, transition)\nCSS 필수 가상클래스 – 순서를 만드는 가상클래스 (nth-child, nth-of-type)\nCSS 필수 가상클래스 – 순서를 만드는 가상클래스 (first-child, last-child)\n제이쿼리(jQuery) 시작하기(폴더구조, 링크방법)\n제이쿼리(jQuery) 필수 핵심이론(기본 구문 만들기, 선택자)\n제이쿼리(jQuery) 필수 핵심이론(함수)\n제이쿼리(jQuery) 필수 핵심이론(메서드)\n제이쿼리(jQuery) 필수 핵심이론(효과 메서드 –slideDown, slideUp, fadeIn, fadeOut)\n제이쿼리(jQuery) 필수 핵심이론(클래스 제어 메서드 – addClass, removeClass, toggleClass)\n제이쿼리(jQuery) 필수 핵심이론(요소탐색 메서드 – children, siblings)\n섹션 3. HTML+CSS+JQUERY 실전 퍼블리싱 제작\nCSS 키프레임 애니메이션 활용한 실전 퍼블리싱 01(원형 크기 변경 로딩 애니메이션)\nCSS 키프레임 애니메이션 활용한 실전 퍼블리싱 02(사각형 좌표 변경 로딩 애니메이션)\nCSS 키프레임 애니메이션 활용한 실전 퍼블리싱 03(더블 보더 레디어스 애니메이션)\n가상클래스 hover 활용한 실전 퍼블리싱 01(오버하면 상세설명 나타나는 상품목록)\n가상클래스 hover 활용한 실전 퍼블리싱 02(마우스 오버되면 나타나는 툴팁 만들기)\n가상클래스 hover 활용한 실전 퍼블리싱 03(오버한 메뉴 외 나머지 흐려지는 네비게이션)\n가상클래스 hover 활용한 실전 퍼블리싱 04(위아래로 분리되는 호버 네비게이션 이펙트)\n가상클래스 hover 활용한 실전 퍼블리싱 05(앱 UI 레이어 3D 호버 에니메이션)\n가상클래스 before after 활용한 실전 퍼블리싱 01(before after 기본 사용법)\n가상클래스 before after 활용한 실전 퍼블리싱 02(애니메이션 호버 네비게이션 이펙트)\n가상클래스 before after 활용한 실전 퍼블리싱 03(SNS 아이콘 애니메이션)\n가상클래스 before after 활용한 실전 퍼블리싱 04(content attr을 활용한 텍스트 네비게이션)\n입력 필드 디자인을 꾸미는 가상클래스 활용한 실전 퍼블리싱(폰트어썸 사용한 입력 필드)\n순서 체크 가상클래스 활용한 실전 퍼블리싱 01(애니메이션 스킬 프로그래스)\n순서 체크 가상클래스 활용한 실전 퍼블리싱 02(애니메이션 스킬 프로그래스, delay)\n순서 체크 가상클래스 활용한 실전 퍼블리싱 03(Flexbox 활용한 갤러리 이미지 어코디언 네비게이션)\n확장선택자와 함께 가상클래스 checked 실전 퍼블리싱 01(애니메이션 햄버거 버튼 만들기)\n확장선택자와 함께 가상클래스 checked 실전 퍼블리싱 02(애니메이션 사이드메뉴 만들기)\n확장선택자와 함께 가상클래스 checked 실전 퍼블리싱 03(탭 메뉴 콘텐츠 만들기)\n확장선택자와 함께 가상클래스 checked 실전 퍼블리싱 04(탭 콘텐츠 - Opacity)\n확장선택자와 함께 가상클래스 checked 실전 퍼블리싱 05(탭 콘텐츠 – Opacity 응용)\n확장선택자와 함께 가상클래스 checked 실전 퍼블리싱 06(탭 콘텐츠 - Slide)\n확장선택자와 함께 가상클래스 checked 실전 퍼블리싱 07(Testimonial 탭 슬라이더)\nPure CSS 콘텐츠 슬라이더 프로토타입 01 (풀스크린 탭 콘텐츠 슬라이더 프로토타입)\nPure CSS 콘텐츠 슬라이더 프로토타입 02 (풀스크린 탭 콘텐츠 슬라이더 응용)\n섹션 4. HTML+CSS 실전 퍼블리싱 제작 with JQUERY\nHTML+CSS 실전 퍼블리싱 제작 with JQUERY - 탭 메뉴 콘텐츠(스타일 01)\n퍼블리셔라로서 꼭! 알아야 하는 자바스크립트, 변수(var)와 조건문(if) - 20세 성인 체크\n자바스크립트 변수와 조건문을 이용한 별점 주기 실전 퍼블리싱 with JQUERY\n탭 메뉴 콘텐츠- 스타일 02(프로토타입) with jQuery\n탭 메뉴 콘텐츠- 스타일 02(실전 제작) with jQuery\n마우스 올리면 배경이미지 변경하기 with jQuery\n[Part 01] 쇼핑몰 아이템 UI 호버 이펙트 - 와이어프레임 설계, 중요 기능 제작\n[Part 02] 쇼핑몰 아이템 UI 호버 이펙트 - 세부 HTML 작성 및 상세 CSS 디자인\n[Part 03] 쇼핑몰 아이템 UI 호버 이펙트 - 제이쿼리 상호작용 만들기\n[Part 01] 어코디언 콘텐츠 슬라이드 - 와이어프레임 설계\n[Part 02] 어코디언 콘텐츠 슬라이드 - 상세 내용 퍼블리싱\n[Part 03] 어코디언 콘텐츠 슬라이드 - 상호작용 제이쿼리\n섹션 5. 비디오 백그라운드를 활용한 랜딩페이지 실전 퍼블리싱 with jQuery\n[Part 01] 비디오 백그라운드를 활용한 랜딩페이지 - 웹폰트, 동영상 제어하기, 로고\n[Part 02] 비디오 백그라운드를 활용한 랜딩페이지 - 애니메이션 콘텐츠 제작\n[Part 03] 비디오 백그라운드를 활용한 랜딩페이지 - 풀스크린 네비게이션(트리거, 모달 디자인)\n[Part 04] 비디오 백그라운드를 활용한 랜딩페이지 - 풀스크린 네비게이션(모달창 제이쿼리 상호작용)\n[Part 05] 비디오 백그라운드를 활용한 랜딩페이지 - 비디오 오버레이 씌우기, 오디오 넣고 볼륨 조절\n섹션 6. 실전 웹페이지 퍼블리싱 - 로그인 화면 UI 디자인\n[Part 01] 로그인 화면 UI 디자인(제작노트, HTML 구조 설계하기, 파비콘 넣기)\n[Part 02] 로그인 화면 UI 디자인(CSS 디자인 - 크기조절하기 및 배치하기)\n[Part 03] 로그인 화면 UI 디자인(CSS 디자인 - 버튼 디자인 및 체크박스와 Label)\n[Part 04] 로그인 화면 UI 디자인(CSS 디자인 - before after로 구분선 디자인)\n섹션 7. 중고급 레벨 Jump Up 퍼블리싱 이론과 팁(Tip)\n웹 퍼블리셔를 위한 크롬 확장 프로그램 추천(6가지)\na태그 앵커 만들고 2가지 방식으로 Smooth Scrolling 하기(제이쿼리 플러그인, CSS 속성)\nbody 안에 또 다른 html 불러오는 iframe 활용하기\ninput과 checked를 활용한 확장선택자(인접선택자, 형제선택자, 속성선택자)\n인라인 자바스크립트 활용하기(onclick 자바스크립트 이벤트)\n퍼블리싱 강사가 강의를 잘하는지 못하는지 구분하기(display 속성의 이해도)\n상대적인 폰트 크기 em 단위와 rem 단위 이해하기\n부모요소의 값을 상속하는 inherit 이해하기\nCSS calc() 산술식(사칙연산)\nCSS에서 변수 var() 사용하기\n가상클래스의 꽃(:before :after) 사용법\n하드코딩으로 이미지맵(image map) 만들기\n섹션 8. [다운로드] 예제 제작에 사용된 소스파일 및 완성본\n[완성본] HTML+CSS 실전 퍼블리싱\n[완성본] HTML+CSS 실전 퍼블리싱 with jQuery\n[완성본] 비디오 백그라운드를 활용한 랜딩페이지 실전 퍼블리싱 with jQuery\n[완성본] 실전 웹페이지 퍼블리싱 - 로그인 화면 UI 디자인\n[다운로드] 비주얼 스튜디오 코드(Visual Studio Code) 및 에밋(Emmet)\n    면접과 취업을 부르는 퍼블리셔 개인 포트폴리오 홈페이지 제작, scss, sass, flex, grid, html, css, html/css,  website, 웹 퍼블리셔, 퍼블리셔 취업, 웹사이트, 코딩, coding, jquery, javascript, 제이쿼리, 자바스크립트, 레이아웃, 인터렉티브웹, interactive web, web design, 웹디자인, 포트폴리오,  퍼블리싱, 반응형 웹, 웹디자인기능사 실기시험, bootstrap, 부트스트랩, css frameworks, 프레임워크\n지식공유자가 알려주는\n강의 수강 꿀팁!\n🎓\n이런 분들께\n추천드려요!\n웹 코딩을 처음 시작하시는 분\n웹사이트 유지보수 수정보완을 자체적으로 하고자 하시는 분\n웹디자인에서 웹퍼블리셔로 직업을 전환하거나 HTML+CSS+JQUERY 퍼블리싱 강화하려는 분\n웹 퍼블리싱에 대한 이해도를 높이고 싶은 웹 기획자\n프론트엔드 퍼블리싱에 대한 이해도를 높이고 싶은 개발자\n웹디자인 기능사 실기시험을 준비하시는 분\n📚\n선수 지식,\n필요한가요?\n기본적인 컴퓨터 활용능력과 인터넷 브라우저 사용능력\n코딩(Coding)을 위한 기본적인 영어타자 능력",
      "lectureDifficulty": "초급자"
    }
  },
  {
    "model": "lectures.lecture",
    "fields": {
      "thumbnail": "https://cdn.inflearn.com/public/courses/325035/cover/d69f088c-41c2-4023-a416-fdcb35567ae4/325035-eng.png",
      "lectureTitle": "[개정판] 딥러닝 컴퓨터 비전 완벽 가이드\n대시보드",
      "lectureFee": 121000,
      "lectureDescription": "중급자를 위해 준비한\n[인공지능, 데이터 사이언스] 강의입니다.\n본 강의는 Object Detection과 Segmentation에 대한 깊이 있는 이론 설명과 현업에서 바로 사용될 수 있는 수준의 실습 예제를 통해 여러분을 현장에서 필요한 딥러닝 기반의 컴퓨터 비전 전문가로 발돋움시켜 드릴 것입니다.\n✍️\n이런 걸\n배워요!\n딥러닝 기반의 Object Detection과 Segmentation의 이해\nRCNN 계열, SSD, YOLO, RetinaNet, EfficientDet, Mask RCNN에 대한 깊이 있는 이론 학습\nMMDetection, Ultralytics Yolo, AutoML EfficientDet등 Object Detection과 Segmentation의 대표적인 구현 패키지들 활용법 익히기\nOpenCV와 Tensorflow Hub를 이용하여 이미지/영상 Object Detection/Segmentation 수행하기\n실무에 Object Detection/Segmentation을 직접 적용할 수 있는 수준에 이를 수 있도록 난이도 있는 다양한 실전 예제 익히기\nObject Detection/Segmentation을 구성하는 다양한 기반 지식 습득\n다양한 구현 패키지를 활용하여 Custom 데이터 세트를 Training 하고 나만의 모델 생성하기\n다양한 Object Detection/Segmentation 모델에 대한 장단점을 실습 예제를 통해 직접 체득\nPascal VOC, MS-COCO등 주요 데이터 세트를 다루고 TFRecord 변환하기\nCVAT Tool을 이용하여 데이터 세트에 Annotation을 적용하고 직접 학습 데이터 만들기\n허들은 낮추고, 핵심은 더욱 깊게!\n딥러닝 CNN 실무 전문가가 되어보세요.\n최신 개정판으로 만나는\n딥러닝 컴퓨터 비전 학습.\n평균 별점 4.9★ 수강생 1,300+명이 선택한,\n인프런 베스트셀러 2021 전면 리뉴얼!\n안녕하십니까, 권철민입니다.\n많은 분들의 성원에 힘입어 이번에 ‘딥러닝 컴퓨터 비전 완벽 가이드’의 개정판을 출시하게 되었습니다. \n기존 강의에서 90% 정도의 영상을 새로 만들었으며, 더욱 향상되고 추가된 내용을 소개해드릴 것입니다.  \n그동안 강의에 보내주신 Feedback을 기반으로 아래와 같은 사항에 중점을 두고 개정판을 만들었습니다.\n그동안 수강생 질문이 많았던 내용에 대한 보다 자세한 이론 설명\n최신/최고 성능을 가진 Object Detection/Segmentation 패키지 기반 실습\nObject Detection/Segmentation의 최신 트렌드 반영\n보다 유연하고, 다양하고, 확장성 있는 실습 코드 작성 + 더욱 상세한 설명\n기타 다양한 추가 수업\n개정판 강의는 단언컨대 초판 강의보다 보다 더 뛰어나고, 더 상세한 내용으로 구성되어 있습니다. 여러분을 최신 딥러닝 기반의 Object Detection과 Segmentation 영역으로 안내해드릴 것입니다.\n강의 소개 📝\n딥러닝 컴퓨터 비전 기술의 중심이 Object Detection과 Segmentation으로 급격하게 이동하고 있습니다.\n▲지능형 영상 정보 인식 ▲AI 비전 검사 스마트 팩토리 ▲의료 이미지 자동 진단 ▲로보틱스 ▲자율 주행차량 등, 많은 분야에서 딥러닝 기반의 Object Detection과 Segmentation 기술이 확산되고 있습니다. 이에 따라 국내외 굴지의 AI 선두 기업 역시 해당 분야에 대한 투자를 아끼지 않으며, 개발 인력에 대한 확보를 모색하고 있습니다. \n드디어 만난 두 대세, Object Detection & Segmentation\n최근 몇 년 간 Object Detection과 Segmentation 분야가 급속하게 발전하면서 관련 실무 역량을 갖춘 인재에 대한 수요가 늘고 있습니다. 그럼에도 불구하고 딥러닝을 응용한 최신 분야인 만큼 학습을 위한 책, 자료, 강의등이 부족해 적절한 인력 양성이 어려운 현실입니다.\n딥러닝 컴퓨터 비전 전문가로\n거듭날 수 있게끔 이끌어 드립니다.\n본 강의는 Object Detection과 Segmentation에 대한 깊이있는 이론 설명과 현업에서 바로 사용될 수 있는 많은 실습 예제들로 구성되어 있으며, 여러분을 현장에서 필요한 딥러닝 기반의 컴퓨터 비전 전문가로 발돋움시켜 드릴 것입니다.\n쉬운 개념 설명부터\n깊이있는 이론까지.\n방대한 Object Detection/Segmentation 분야에 대해 쉬운 개념부터 RCNN계열, SSD, YOLO, RetinaNet, EfficientDet, Mask RCCN등에 대한 깊이있는 이론까지 명료하게 설명해 드립니다.\n꼼꼼한 강의 장표와 함께 개념을 충실히 익힐 수 있습니다.\n실습 예제를 통한\n딥러닝 실전 능력 극대화.\n직접 코딩을 하면서 구현해 보는 것보다 실전 능력을 높일 수 있는 방법은 없습니다.\n본 강의는 많은 실습 예제로 구성되어 있으며, 이를 통해 여러분의 Object Detection과 Segmentation 구현 실전 능력을 극대화시켜 드릴 것입니다.\n©SLAM DUNK\n이런 분들께\n추천합니다.\n딥러닝 CNN이 어떻게\n실무에 적용될 수 있을지\n고민하셨던 분\n딥러닝 기반\n컴퓨터 비전 솔루션\n개발을 원하시는 분\n딥러닝 이미지분류 역량\n최신 CV 기술까지\n넓히고픈 분\n인공지능 대학원 진학,\n딥러닝 기반 CV 분야\n취업/이직 준비생\n선수 지식을 확인해주세요.\n파이썬(Python) 프로그래밍 경험 및 딥러닝 CNN에 대한 기본 이해가 필요합니다.\n그밖에 TF.Keras 또는 Pytorch에 대한 약간의 경험이 있다면 더욱 좋습니다.\n어디서도 보기 힘든\n최신 CV 기술을 한번에.\n매우 뛰어난 성능의\n최신 Object Detection/Segmentation 구현\n패키지를 활용한 실습\nMMDetection, Ultralytics Yolo, AutoML EfficientDet 등\n범용적인 OpenCV DNN과 Tensorflow Hub를 활용한 Inference 실습\n다양한 이미지와 영상에 대한\nObject Detection/Segmentation 실습\n실제로 컴퓨터 비전 기술을 활용하는 다양한 사례\n여러 Custom 데이터 세트로\n모델 Training 실습\n다양한 커스텀 데이터 세트\n딥러닝 컴퓨터 비전 전문가라면 여러 Custom 데이터 세트로 모델을 Training하여 자신만의 Object Detection/Segmentation 모델을 낼 수 있어야 합니다. 또 이 모델의 성능을 개선하고 Evaluation 할 수 있어야 합니다.\n본 강의는 여러분에게 여러가지 구현 패키지를 활용하여 Custom 데이터 세트를 Training 하고 최적의 Inference 모델을 생성하는 능력을 배양해 드릴 것입니다.\n직접 제작한 Training용 데이터 세트로\nCustom 모델 Training / Inference 실습\n직접 제작한 Training용 데이터 세트를 통한 실습\nAnnotation(어노테이션) 툴인 CVAT를 이용해 일반 이미지에 바운딩 박스 Annotation을 적용한 Training용 데이터 세트를 직접 제작하고, 이렇게 만든 데이터 세트를 이용하여 Custom 모델 Training 및 Inference를 실습합니다.\n실습 환경 🧰\n강의에 쓰인 실습 코드는 모두 Google Colab(구글 코랩) 환경 기반으로 작성되었습니다. \nGoogle Colab, Kaggle 로고\nGPU를 기반으로 실습을 진행하며, Colab의 Free GPU 할당이 충분하지 않을 경우 Colab Pro의 사용도 권장드립니다. (※ Colab Pro의 경우 월 10$ 정도의 비용이 발생합니다.) \n만약 Colab GPU 무료 커널 자원이 부족할 경우, Kaggle 커널을 사용하시면 됩니다.  Kaggle(캐글)용으로 만든 별도 실습 코드도 제공합니다. 섹션 0 - [실습 환경 구성] 수업을 참고하시면 보다 자세한 실습 환경에 대한 내용을 들으실 수 있습니다. \n수강 전 확인해주세요!\nColab, Kaggle 등의 GPU 커널을 사용하지 않으실 경우 예제를 따라하시는 데 어려움이 있습니다. 미리 양해 부탁드립니다.\n실습 코드 및 강의 교재 👨‍💻\n실습 코드는 https://github.com/chulminkw/DLCV_New에서 다운로드 받을 수 있습니다. 실습 코드를 미리 리뷰해 보시면 실습을 이해하기 위한 사전 프로그래밍 수준을 살펴보는 데 도움이 될 것입니다.\n320p 분량의 강의 PDF 교재 제공\n강의에 사용된 교재(320페이지 분량)는 강의 섹션 0: 강의 교재에서 다운로드 받으실 수 있습니다.\n이론을 배우기 위해서\n실습보다 더 나은 방법은 없습니다.\n딥러닝 이론을 완벽하게 이해할 때까지 기다리지 마십시오. 이론을 배우기 위해서 실습보다 더 나은 방법은 없습니다.\n일단 코딩을 시작하면 우리의 뇌는 실체적인 이해를 하기 위해 따라오게 되어 있습니다. 강의에서 제시해 드리는 다양한 실습 예제를 저와 같이 구현해 보시지요. 강의를 들으면서, 키보드를 누르면서 직접 구현해 보신다면 그동안 뜬구름같이 느껴졌던 부분들이 점점 실체화될 것입니다.\n전문가가 되기 위해서는 가끔은(제 생각은 거의 대부분인 것 같습니다만) 걷는 걸 배우기 전에 뛰어야 할 때도 있습니다. 본 강의는 여러분의 진로와 역량을 딥러닝 기반의 컴퓨터 비전 분야에서 키울 수 있도록 최고의 동반자가 되어 드릴 것입니다.\n감사합니다.\n― <아이언맨 1>에서 토니 스타크가 아이언맨 수트 테스트 때 자비스에게 한 말\n“가끔은 걸음마를 떼기 전에 뛰어야 할 때도 있어.”\n인프런이 만난 사람 👨‍💻\n권철민님 인터뷰를 읽어보세요 | 보러가기\n지식공유자가 알려주는\n강의 수강 꿀팁!\n🎓\n이런 분들께\n추천드려요!\n딥러닝에 관심있는 모든 이\n딥러닝 기반의 Object Detection과 Segmentation에 대한 이론 위주의 학습을 해오신 분\n딥러닝 CNN이 어떻게 실무에 적용될 수 있는지 고민해 오신 분\n딥러닝 CNN Image Classification을 넘어서 Object Detection/Segmentation 분야로 역량을 넓히고 싶으신 분\nComputer Vision 분야에서 딥러닝 기반의 솔루션 개발을 원하시는 분\n캐글(Kaggle)과 같은 Competition에서 Object Detection/Segmentation Challenge에 도전하고 싶으신 분\nAI 대학원을 준비 중이신 분\n딥러닝 기반 Computer Vision 분야로 이직을 준비 중이신분\n📚\n선수 지식,\n필요한가요?\n파이썬 프로그래밍 경험\n딥러닝 CNN에 대한 기본 이해\n(Optional) TF.Keras나 Pytorch에 대한 얕은 경험",
      "lectureDifficulty": "중급자"
    }
  },
  {
    "model": "lectures.lecture",
    "fields": {
      "thumbnail": "https://cdn.inflearn.com/public/courses/324671/course_cover/638eee1a-6381-402d-a17b-3724751414f1/frontend-env-eng.png",
      "lectureTitle": "프론트엔드 개발환경의 이해와 실습 (webpack, babel, eslint..)\n대시보드",
      "lectureFee": 69300,
      "lectureDescription": "중급자를 위해 준비한\n[웹 개발, 프론트엔드] 강의입니다.\n이미 만들어 놓은 개발 환경을 이해할 수 있어요. 처음부터 직접 개발 환경을 만들 수 있어요.\n✍️\n이런 걸\n배워요!\n모듈시스템을 사용하고 개발 환경을 자동화하는 방법(Webpack)\n최신 자바스크립트 문법을 사용하는 환경 만들기(Babel)\n동료와 협업하는 개발 환경 만들기 (ESLint, Prettier)\n웹팩, 바벨, 린트 같은 프론트엔드 기술을 이해하고 실무에 적용해 보세요!\n“웹팩은 팀에서 한 명만 다룰 줄 알면 돼!?”\n만약 그 한 명이 팀을 떠난다면 어떻게 될까요? 어쩌면 여러분이 그 한 명이 되어야 할지도 모릅니다.\n개발팀에 여러분 혼자라면 웹팩 구성하는 것은 피할 수 없고요. \n개발 환경 구성만큼은 내 손으로 직접 다룰 줄 안다면 어떨까요?\n최소한 다른 사람이 만들어 놓은 구성(이를테면 create-react-app이나 vue-cli로 만든 코드)을 읽고 이해할 수 있는 정도가 된다면 훨씬 자신감 있게 일할 수 있을 거에요.\n웹팩을 비롯한 바벨, 린트, 프리티어 등 프론트엔드 개발 환경을 자동화하고 생성성을 높여 줄 수 있는 도구들을 익힐 수 있는 강의를 만들었습니다.\n이것을 통해 더욱 생산성 있게 일할 수 있기를 기대합니다.\n📝 어떤 걸 배우게 되나요?\n# Node.js\nNode.js는 프론트엔드 개발환경을 구성하는데 기본 바탕이 되는 기술입니다. 대부분의 도구가 Node.js 기반으로 동작하기 때문이죠. 뿐만 아니라 일련의 개발 프로세스를 자동화하는데도 큰 역할을 담당하고 있습니다. 프론트엔드 개발 과정에서 Node.js의 역할을 이해할 수 있습니다.\n# Webpack\n모듈 기반의 개발을 가능하게 해주는 것이 바로 웹팩입니다. 같은 역할을 하는 대체제들이 나왔지만 여전히 가장 많이 사용하는 것은 웹팩입니다. 웹팩의 동작 원리를 들여다보고 이해한 뒤 직접 개발 환경을 구성해보고 로더를 직접 구현도 해보는 실습을 통해 사용법을 손에 익힐수 있습니다.\n# Babel + SASS\nECMAScirpt+, Typescript 같은 고수준 프로그래밍 언어나, React.js, Vue.js 같은 프레임웍을 사용해서 개발할 때 반드시 필요한 것이 바벨입니다. 물론 바벨 없이도 개발할 수 있지만, 누가 그렇게 개발하나요? 개발 생산성을 위해서는 반드시 바벨의 도움을 받아야 합니다. 바벨의 원리를 이해하고 직접 사용해 보면서 어떻게 프로젝트에 최적화된 환경을 만들 수 있는지 알아보세요.\n# Prettier + ESLint\n코딩 컨벤션으로 인한 논쟁은 무척 피곤한 일이죠? 도구의 도움을 받는다면 좀 더 수월하게 코딩 스타일을 맞출 수 있을 거에요. 게다가 자동화 도구를 개발 절차에 추가해 놓으면 일관적인 코드를 지속적으로 유지할 수 있습니다.\n🧰 미리 설치해 주세요\nVSCode를 사용하지만 평소에 사용하는 에디터나 IDE가 있다면 그것을 사용하서도 괜찮습니다.\n실습 진행을 위해 Git을 설치해 주세요. 깃 훅을 사용하는 수업도 있기 때문에 v2.3.0 버전 이상을 사용하시기 바랍니다.\n🙋🏻‍♂️ 강의 관련 예상 질문\nQ. 이 강의를 시작하게 된 계기를 소개해주세요. \nA. 프론트엔드 기술이 무척 빠르다고는 하지만 그래도 한번은 정리해 보고 싶었습니다. 웹팩부터 시작해서 일하면서 자주 사용하는 개발 도구 메뉴얼을 하나씩 읽어보면서 블로그에 정리했던 내용이 \"프론트엔드 개발환경의 이해(총 5편)\"이고요.  그런뒤 작년 2019년 T아카데미에서 이 주제로 세미나를 열었는데 의외로 저처럼 필요로 하시는 분들이 많더라구요. 반응이 괜찮아서 내용을 더 보강해서 인프런에 온라인 강의를 개설하였습니다.\nQ. 이 강의만의 특별한 장점이 있을까요?\nA. 개발환경이라는 주제가 실습하기 좀 어려울수도 있을것 같아요. 메뉴얼만 읽어보고 지나가기에는 잘 모르기 때문이죠. 그래서 각 이론 수업마다 조그만 실습을 준비했습니다(실습 저장소: lecture-frontend-dev-env).이전 강의 \"실습 UI 개발로 배워보는 순수 javascript 와 VueJS 개발\"에서 다룬 코드를 기반으로 여기에 개발환경을 구성하도록 단계별로 실습 과제를 준비했어요. 하나하나 풀어보다보면 어느새 개발 환경 구성하는것이 손에 익혀질수 있도록 말이죠.\nQ. 이 강의를 통해 어떤 일을 할 수 있나요?\nA. 현재 여러분이 개발하고 있는 프로젝트의 개발환경을 이해할 수 있을거에요. 필요하다면 커스터마이징해서 생산성을 높일 수도 있고요. 이제 막 프로젝트를 시작하는 단계인가요? 그럼 입맛에 맞게 직접 개발 환경을 꾸며볼 수도 있습니다. \n다른 강의 보기\n견고한 JS 소프트웨어 만들기\n테스트 주도 개발, 자바스크립트 디자인 패턴 배우기\n실습 UI 개발로 배워보는 순수 javascript와 VueJS 개발\nVue.JS 기초, MVC/MVVM 아키텍처, 컴포넌트 개발\n테스트주도개발(TDD)로 만드는 NodeJS API 서버\nNodeJS 기초, ExpressJS 기초, Rest API 서버 개발\n트렐로 개발로 배우는\nVuejs, Vuex, Vue-Router 프론트엔드 실전 기술\n트렐로를 따라 만들며\nVue.js, Vuex, Vue-Router 실전 기술 학습\n지식공유자가 알려주는\n강의 수강 꿀팁!\n🎓\n이런 분들께\n추천드려요!\n미리 세팅된 환경에서만 개발해서 웹팩이나 바벨 설정은 도저히 모르겠어요\n웹팩을 써 보긴 했는데 어떤 방식으로 동작하는 건지 알고 싶어요\n일관적인 코딩 컨벤션을 유지하고 싶은데 팀으로 작업하다 보니 잘 안 돼요\n📚\n선수 지식,\n필요한가요?\n기초적인 프론트엔드 개발 경험이 필요합니다. (자바스크립트, HTML, CSS)",
      "lectureDifficulty": "중급자"
    }
  },
  {
    "model": "lectures.lecture",
    "fields": {
      "thumbnail": "https://cdn.inflearn.com/public/courses/324109/course_cover/161476f8-f0b7-4b04-b293-ce648c2ea445/kyh_jsp.png",
      "lectureTitle": "자바 ORM 표준 JPA 프로그래밍 - 기본편\n대시보드",
      "lectureFee": 121000,
      "lectureDescription": "초급자를 위해 준비한\n[웹 개발, 백엔드] 강의입니다.\nJPA를 처음 접하거나, 실무에서 JPA를 사용하지만 기본 이론이 부족하신 분들이 JPA의 기본 이론을 탄탄하게 학습해서 초보자도 실무에서 자신있게 JPA를 사용할 수 있습니다.\n✍️\n이런 걸\n배워요!\nJPA의 기본기를 탄탄하게 다질 수 있습니다.\nJPA의 내부 동작 방식을 이해할 수 있습니다.\n객체와 DB 테이블을 올바르게 설계하고 매핑할 수 있습니다.\n실무에서 자신있게 JPA를 사용할 수 있습니다.\n실무에서도 자신있게 쓰는 JPA! \n남다른 JPA 기초의 첫걸음을 떼어보세요.\n🚩 본 강의는 로드맵 과정입니다.\n본 강의는 자바 백엔드 개발 실전 코스를 시작하는 첫 번째 강의입니다. 코스 전체 구성이 궁금하시다면, 스프링 부트와 JPA 실무 완전 정복 로드맵을 먼저 확인해주세요. (링크)\n자바 ORM 표준 JPA 프로그래밍 - 기본편\n객체를 관계형 데이터베이스에 저장하려면 개발자는 많은 코드와 SQL을 작성해야 합니다. 예를 들어 객체를 SQL로 변환하는 단순한 일부터, 객체의 상속 구조를 테이블에 저장하는 복잡한 일까지, 개발자는 객체와 데이터베이스 사이에서 무수한 매핑 코드와 SQL을 직접 작성해야 합니다.\n자바 ORM 표준인 JPA는 SQL 작성 없이 객체를 데이터베이스에 직접 저장할 수 있게 도와주고, 객체와 관계형 데이터베이스의 차이도 중간에서 해결합니다.\n자바 ORM 표준 JPA가 무엇일까요?\nJPA\nJava Persistence API\n자바 진영의 ORM 표준 기술\nORM\nObject-relational mapping(객체 관계 매핑)\n객체는 객체대로, 관계형 DB는 관계형 DB대로 설계\nORM 프레임워크가 중간에서 매핑\n객체를 ORM 프레임워크에 저장하면, ORM 프레임워크가 SQL을 생성해서 객체를 DB에 관리\n대중적인 언어에는 대부분 ORM 기술이 존재\nJPA를 사용하는 이유\nSQL 중심의 개발에서 객체 중심으로 개발\n개발 생산성 향상\n유지보수 편의\n패러다임의 불일치 해결\n성능 향상\n데이터 접근 추상화와 벤더 독립성\n자바 ORM 표준 기술\n온라인 강의를 \n시작한 이유\n저는 지금까지 다양한 실무 프로젝트에 JPA를 도입했습니다. 작게는 단순한 웹 서비스부터 크게는 조 단위의 거래 금액을 처리하는 주문 - 결제 - 정산 시스템까지 JPA로 직접 설계하고 개발했습니다. JPA를 처음 실무에 도입할 때는 좌충우돌 하기도 했지만 개발 생산성과 유지보수가 확연히 좋아졌고, 남는 시간에 코드 품질과 테스트에 더 많은 시간을 쏟을 수 있었습니다. 무엇보다 JPA를 사용해본 동료들은 이전으로 돌아가고 싶어하지 않았습니다.\n하지만 JPA에 관한 국내 자료가 부족했고, 대부분이 원서여서 어려운 점이 많았습니다. 그래서 2015년에 직접 자바 ORM 표준 JPA 프로그래밍 책을 쓰고, 그로부터 4년이 흘렀습니다.\n그동안 네이버, 카카오 같은 인터넷 비즈니스 회사부터 우아한형제들, 11번가 같은 e커머스 회사까지, JPA를 이미 사용중이거나 도입하려는 많은 회사에 강연을 했습니다. 강연을 통해 책으로는 이해가 어려웠던 부분이 직접 강의로 들으니 쉽게 이해된다는 개발자 분들이 많았습니다. 그래서 온라인 강의를 만들게 되었습니다.\n기초가 탄탄한 \nJPA 기본편 \n앞으로 진행할 JPA 강의는 크게 기본편과 활용편으로 나뉘어져 있습니다. 이 강의는 기본편입니다.\n강의 목표\nJPA의 내부 동작 방식을 이해하지 못하고, 단순히 편리하다는 이유로 JPA를 도입하는 분들을 종종 보았습니다. 실무에서는 정말 다양하고 복잡한 이슈가 발생합니다. 이때 근본 원리를 모르면 많은 시간과 비용을 낭비하게 됩니다. 그리고 JPA로 객체와 관계형 데이터베이스를 설계하고 매핑할 때, 어떤 방법이 좋은 방법인지 모르면 조금만 복잡해져도 방황하게 됩니다.\n따라서 JPA를 잘 사용하려면 다음 두 가지를 깊이있게 이해해야 합니다.\nJPA의 내부 동작 방식\n객체와 관계형 데이터베이스 테이블을 올바르게 매핑하는 방법\n기본편은 이 두 가지에 초점을 맞추었습니다. 기초를 탄탄하게 해서 실무에서 JPA를 사용하더라도 두려움 없이 사용할 수 있게 해드리는 것이 이 강의의 목표입니다.\n활용편\n실전! 스프링 부트와 JPA 활용1 - 웹 애플리케이션 개발\n스프링 부트와 JPA로 실제 웹 애플리케이션을 설계하고 개발합니다.\n실전! 스프링부트와 JPA 활용2 - API 개발과 성능 최적화\nJPA 극한의 성능 최적화 방법을 학습할 수 있습니다.\n실전! 스프링 데이터 JPA\n기초부터 실무까지 스프링 데이터 JPA를 학습합니다.\n실전! Querydsl\nQuerydsl을 통해 복잡한 쿼리와 동적 쿼리 문제를 해결합니다.\n참고 도서\n책은 더 깊은 내용을 공부하고 싶은 분들을 위한\n참고서로 생각하시면 됩니다.\n(책이 없어도 강의를 위한 별도의 자료가 제공됩니다.) \n지식공유자가 알려주는\n강의 수강 꿀팁!\n🎓\n이런 분들께\n추천드려요!\nJPA를 처음 접하시는 분\nJPA를 실무에서 사용하지만 기본 원리를 이해하고 싶으신 분\n📚\n선수 지식,\n필요한가요?\nJAVA 언어\n관계형 데이터베이스 기초 지식",
      "lectureDifficulty": "초급자"
    }
  },
  {
    "model": "lectures.lecture",
    "fields": {
      "thumbnail": "https://cdn.inflearn.com/public/courses/330441/cover/5edfc57c-8758-415d-b30a-9e2e5d274b1c/330441-eng.png",
      "lectureTitle": "스트림릿(Streamlit)을 활용한 파이썬 웹앱 제작하기\n대시보드",
      "lectureFee": 11000,
      "lectureDescription": "초급자를 위해 준비한\n[웹 개발, 풀스택] 강의입니다.\nStreamlit을 활용해 빠르고 쉽게 나만의 데이터 분석 앱을 구축하고 공유해 보세요!\n✍️\n이런 걸\n배워요!\nStreamlit을 활용한 데이터 분석 웹 앱 구축\nStreamlit을 활용한 데이터 시각화\n다양한 API를 활용한 Streamlit 웹 앱 구현\n 프로젝트로 쉽고 빠르게 배우는, \n데이터 분석을 위한 스트림릿 웹 앱 개발! \n스트림릿(Streamlit)이란?\nStreamlit은 데이터를 활용해 빠르게 프로토타입 형태의 웹 앱을 구현할 수 있는 도구입니다. 간단한 기능을 가진 데이터 웹 어플리케이션을, 빠르고 간단하게 눈으로 확인할 수 있는 웹 형태로 만들 수 있다는 것이 가장 큰 장점입니다.\nStreamlit은 파이썬(Python)을 사용합니다. 데이터를 다루는 데 있어 친숙한 파이썬 환경이기에 사용하는데 거부감이 없고, Streamlit 패키지 설치 후 적절히 함수를 호출해주면 되기 때문에 간단합니다.\nStreamlit은 파이썬 스크립트를 읽어서 간단한 웹 서버를 실행합니다. 결과물을 바로 확인할 수 있고, 스크립트를 업데이트 할 때마다 실시간으로 변경사항도 확인할 수 있습니다.\nStreamlit의 활용도!\n데이터 분석 보고서, 대시보드 구축, 머신러닝 모델 배포를 위한 데모용 웹앱을 매우 쉽게 만들 수 있습니다.\n잠재적 고객에게 내가 구상한(혹은 이미 구축한) 데이터 분석/머신러닝 서비스를 직접 시연할 수 있습니다.\n고객이 원하는 데이터를 직접 업로드하여 동적 시각화(대시보드)를 경험할 수 있습니다.\n머신러닝 모델을 활용한 서비스 구축이 가능합니다.\n그밖에 간단한 파이썬(Python) 코딩으로 웹앱을 쉽게 만들 수 있습니다.\nStreamlit이 지원하는 다양한 위젯(Widgets)\n아래에 나열된 위젯으로 쉽게 웹앱을 제작할 수 있습니다.\nStreamlit이 지원하는 차트 기능\n심플하면서도 강력한 차트 기능을 활용하여 대시보드를 구축할 수 있습니다.\n본 강의를 통해\nStreamlit 설치와 환경 설정부터, 실제 Streamlit을 활용한 다양한 데이터 활용 웹 앱 구축까지 쉽고 빠르게 배울 수 있습니다.\n📖 직접 Streamlit로 만든 서비스를 살펴보고, 제작 방법 및 과정을 배워보세요!\nChatGPT로 블로그 글 대량 자동 생산\n📌 데모 페이지 (바로가기)\n파일 공유 서비스\n📌 데모 페이지 (바로가기)\n주식 차트 그리기\n나만의 챗봇 만들기\n로또 번호 생성기 만들기\nMBTI 대백과사전 만들기\n수강 전 확인해주세요!\n초보자도 쉽게 배우고 따라할 수 있도록 프로젝트와 실습 중심으로 강의가 진행됩니다.\n강의와 함께 실습자료가 별도로 제공됩니다.\n본 강의와 연관된 영상은 유튜브 채널에서 학습할 수 있습니다.\n또한, 테디노트 YouTube에 업로드된 강의 외에도 인프런에서만 시청하실 수 있는 유료 콘텐츠를 앞으로 계속 추가할 예정입니다.\n인프런 유료 강의를 수강하실 경우, 수익금은 전액 불우한 어린이를 위한 기부금으로 사용됩니다.\n강사 주요 이력\n패스트캠퍼스 강의 - 직장인을 위한 파이썬 데이터분석 올인원 패키지 Online.\n패스트캠퍼스 Byte Degree 프로젝트 감수 - Byte Degree : Machine Learning with Python.\n패스트캠퍼스 데이터분석 Capstone 프로젝트 & 포트폴리오 완성 과정 강의.\n대구 디지털진흥원 - A.I. 트렌드 2020 & 비즈니스 적용 강연\nSK그룹 기업 (파이썬, 데이터분석, 머신러닝, 텐서플로우) 강의\nKT AI 교육센터 (텐서플로우 자격 인증 과정) 강의\n멀티캠퍼스 (텐서플로우 자격 인증 과정) 강의\n서울대학교 평생교육원 텐서플로우 개발자 과정 강의\n인프런 텐서플로우 자격 인증 과정\n런어데이 텐서플로우 자격 인증 과정\n고려대학교 기술경영대학원 - 딥러닝 GAN 특화 과정, 머신러닝 특화 과정 강의\nDB 인재개발원 - Python 데이터 분석, 머신러닝 강의\nNIA 한국정보와진흥원 - 텐서플로우 강의\n패스트캠퍼스 - 파이썬 딥러닝 300제 강의\n대구 디지털진흥원 - Python, 데이터분석, 시각화, 머신러닝 강의\n섹터나인Secta9ine - 데이터 분석 강의\n대구 디지털진흥원 - 6차수. Python, 데이터분석, 딥러닝(텐서플로) 강의\n야곰(yagom) - 인공지능(AI)의 현재와 미래 스피커\nCJ올리브네트웍스 - Python, 데이터분석, 시각화, 머신러닝, 딥러닝 강의\nDB 인재개발원 - 머신러닝 중급과정 강의\n충남 AI, SW교육 한마당 진로특강\n인천대학교 - 파이썬을 활용한 데이터 분석 특강\n한림대학교 - 비전공자 대상 데이터 분석 특강\n한신대학교 - ABC(AI, Bigdata, Contents) 캠프 AI 특강\n  청년인재 AI 이어드림스쿨 - “나만의 인공지능 학습 노하우” 특강\n금오공과대학교 - 텐서플로우 자격 인증 과정 강의\n한양대학교 - 데이터 역량강화 교육 특강\nSK엠엔서비스 - Power Automate 실무 적용 VOD 강의\nUdemy – 한 방으로 끝내는 판다스 Pandas\n대구 디지털산업진흥원 – 2022년도 빅데이터 분석 강의\n엘리스(Elice) - 파이썬 입문 VOD 강의\n세교고등학교 - ABC 캠프 (쉽게 배우는 인공지능) 강의\nSK그룹 - Project Based Learning (PBL) 멘토 & 강의\n한신대학교 - ABC(AI, Bigdata, Contents) 캠프 2022 여름학기 AI 특강\nDB 인재개발원 - 2022 중급과정 머신러닝/딥러닝\n엘리스(Elice) - Pandas 데이터분석 VOD 강의\n서울시 구로구 X 서울대학교 - 텐서플로 개발자 자격 인증과정 강의\n금오공과대학교 - 2022년 하반기 텐서플로우 자격 인증 과정 강의\n서울대학교 평생교육원 - 2023년 상반기 텐서플로우 자격 인증 과정 강의\n운영 사이트 및 저서\n테디노트(깃헙 블로그) (링크)\n머신러닝 혼자서 스터디 (링크)\n파이썬 딥러닝 텐서플로 (정보문화사, 2021) (링크)\n지식공유자가 알려주는\n강의 수강 꿀팁!\n🎓\n이런 분들께\n추천드려요!\n데이터 분석 웹 앱을 직접 빠르게 만들어 보고 싶은 분\n웹 앱을 통해 데이터를 효과적으로 시각화 하고 싶은 분\n📚\n선수 지식,\n필요한가요?\n파이썬(Python)\n판다스(Pandas)",
      "lectureDifficulty": "초급자"
    }
  },
  {
    "model": "lectures.lecture",
    "fields": {
      "thumbnail": "https://cdn.inflearn.com/public/courses/330186/cover/3bb38317-e5c5-4975-b1df-9baa6f19b73d/330186-eng.png",
      "lectureTitle": "자바와 스프링 부트로 생애 최초 서버 만들기, 누구나 쉽게 개발부터 배포까지! [서버 개발 올인원 패키지]\n대시보드",
      "lectureFee": 132000,
      "lectureDescription": "초급자를 위해 준비한\n[백엔드, 웹 개발] 강의입니다.\nJava와 Spring Boot, JPA, MySQL, AWS를 이용해 서버를 개발하고 배포합니다. 웹 애플리케이션을 개발하며 서버 개발에 필요한 배경지식과 이론, 다양한 기술들을 모두 학습할 뿐 아니라, 다양한 옵션들의 의미, Spring Boot의 역사와 가장 최신 버전의 변경점들도 짚어봅니다.\n✍️\n이런 걸\n배워요!\n스프링부트, MySQL, JPA, Linux, AWS, Github, Gradle 등 서버 개발에 필수적인 기술들!\n네트워크, 데이터베이스, API, 도메인, 클라우드 등 서버 개발에 필요한 이론과 개념들!\n개발부터 배포까지 전부!\n이 강의 하나로 경험할 수 있어요 😮\n서버 개발의 A to Z,\n궁금하시죠? 👩‍💻\n✅ Java를 공부하셨는데, 다음 학습 목표를 찾고 있는 분\n✅ 서버 개발이 어떻게 이루어지는지 알고 싶은 분\n✅ 서버개발자가 되려면 어떤 개념과 기술을 공부해야 하는지 궁금한 분\n그런 분들을 위해 준비했습니다. 자바와 스프링 부트로 하는 서버 개발의 모든 것!\n본 강의에서는 Java, Spring Boot, JPA, MySQL, AWS를 이용해 서버를 개발하고 배포합니다. 이 과정에서 서버 개발에 필요한  다양한 배경지식 / 이론 / 기술을 쉽고 재미있게 학습하게 됩니다.\n커리큘럼을 \n확인해보세요 📚\nSection #1.\n생애 최초\n서버 API 만들기\n스프링 부트 프로젝트를 설정해 시작하고 실행하는 방법을 살펴봅니다.\n서버란 무엇인지, 네트워크, HTTP, API, JSON은 무엇인지 등 서버 개발에 필요한 다양한 개념들을 알아봅니다.\n스프링 부트를 애용해 간단한 GET API / POST API를 만들어 봅니다.\nSection #2.\n생애 최초\nDatabase 조작하기\n디스크와 메모리의 차이를 이해하고, Database의 필요성을 이해합니다.\nMySQL Database를 SQL로 조작하는 방법을 다룹니다.\n스프링 서버를 이용해 Database에 접근하고 데이터를 저장, 조회, 업데이트, 삭제해 봅니다.\nAPI의 예외 상황을 알아보고 예외를 처리할 수 있게 됩니다.\nSection #3.\n역할의 분리와\n스프링 컨테이너\n좋은 코드가 왜 중요한지 이해하고, 원래 있던 Controller 코드를 보다 좋은 코드로 리팩토링합니다.\n스프링 컨테이너와 스프링 빈이 무엇인지 다룹니다.\n스프링 컨테이너가 왜 필요한지, 좋은 코드와 어떻게 연관이 있는지 살펴봅니다.\n스프링 빈을 다루는 여러 방법을 이해하고, 실습해봅니다.\nSection #4.\n생애 최초\nJPA 사용하기\n문자열 SQL을 직접 사용하는 것의 한계를 이해하고, 해결책인 JPA, Hibernate, Spring Data JPA가 무엇인지 다룹니다.\nSpring Data JPA를 이용해 데이터를 생성, 조회, 수정, 삭제해봅니다.\n트랜잭션이 왜 필요한지 이해하고, 스프링에서 트랜잭션을 제어하는 방법을 다룹니다.\n영속성 컨텍스트와 트랜잭션의 관계를 이해하고, 영속성 컨텍스트의 특징을 알아봅니다.\nSection #5.\n책 요구사항\n구현하기\n책 생성, 대출, 반납 API를 온전히 개발하며 지금까지 다루었던 모든 개념을 실습해 봅니다.\n객체지향적으로 설계하기 위한 연관관계를 이해하고, 연관관계의 다양한 옵션에 대해 살펴봅니다.\nJPA에서 연관관계를 매핑하는 방법을 살펴보고, 연관관계를 사용할 때와 사용하지 않을 때의 차이점을 다룹니다.\nSection #6.\n생애 최초\n배포 준비하기\n배포가 무엇인지 이해하고, 배포를 하기 위해 어떤 준비를 해야 하는지 알아봅니다.\n스프링 서버를 실행할 때 DB와 같은 설정을 코드 변경 없이 제어하는 방법을 알아봅니다.\ngit과 github의 차이를 이해하고 git에 대한 기초적인 사용법을 알아봅니다.\nAWS의 EC2가 무엇인지 이해하고, AWS를 통해 클라우드 컴퓨터를 빌려봅니다.\nSection #7.\n생애 최초\n배포하기\n  EC2에 접속하는 방법을 알아보고, EC2에 접속해 리눅스 명령어를 다룹니다.\n개발한 서버의 배포를 위해 환경 세팅을 리눅스에서 진행하고, 실제 배포를 진행해 봅니다.\nforeground와 background의 차이를 이해하고 background 서버를 제어해 봅니다.\n도메인 이름을 사용할 사용자가 IP 대신 이름으로 접속할 수 있도록 설정해 봅니다.\nSection #8.\nSpring Boot의\n이모저모\nbuild.gradle의 의미와 빌드 스크립트를 이해하는 방법, YAML 문법, lombok을 다룹니다.\nSpring과 Spring Boot 차이점에 대해 이해하고 역사를 간략히 살펴봅니다.\n가장 최신 버전인 Spring 3.0 버전대의 큰 변경 내용에 대해 살펴보고, 우리의 서버를 3.0으로 마이그레이션 해봅니다.\n수강생 여러분을 위해 준비한 \n이 강의만의 키 포인트 🔑\nPoint 1\n무한 복습을 위한 강의 자료 \n강의 내용을 완벽하게 정리한 217페이지 분량의 핸드북과 1,122페이지 분량의 PPT를 드립니다.\nPoint 2\n서버 개발에 집중하세요 \n서버 개발에만 집중할 수 있도록 도서 관리 애플리케이션을 위한 웹 UI를 제공해드립니다.\n  Point 3\n개념 설명도 재미있게 \n서버 개발에 필요한 다양한 기술은 물론, 전반적인 이론과 개념들에 대한 설명도 쉽고 재미있게 준비했습니다!\n  Point 4\n옵션에 대한 상세한 설명까지 \n서버를 개발하며 옵션 하나하나에 대한 설명도 놓치지 않습니다! Spring Boot의 역사와 가장 최신 버전인 Spring Boot 3 버전의 변경 내용까지 살펴봅니다!\n수강평 미리 보기 👀\n*아래 수강평은 지식공유자의 코틀린 강의에 대한 수강평입니다.\n★★★★★\n강의 내용 엄청 알차네요. 강사님께서 가진 스타일이나 스킬들을 강의 중간중간에 팁으로 풀어주셔서 하나둘씩 얻어가네요. 설명이 다양해서 미리 궁금할 법한 점들을 속 시원하게 긁어주었습니다. 왜? -> 설명, 그리고 장단점들과 다양한 예시들.. 최고였습니다. 가격보다 더 많은 것들을 얻어가는 부분이었고, PPT도 엄청 정성 쏟으신 게 보입니다! 감사합니다.\n-Wo***\n★★★★★\n지나칠 정도로(?) 겸손한 강사와 내공이 느껴지는 강의 내용이 인상적입니다. 한 강의에서 개발 전반에 필요한 지식을 한 번에 학습할 수 있어서 좋았고 강의하는 입장에서는 힘드시겠지만, 실무에 가까우면서도 꼭 필요한 가상의 요구사항을 같이 개발해보는 컨셉으로 시리즈물이 나왔으면 하는 욕심을 부려봤습니다. 감사합니다.\n\n- 정***\n★★★★★\n강의 내용부터 속도까지 전체적으로 완전 저한테 찰떡인 강의였습니다! 감사합니다 :)\n\n-Je***\n★★★★★\n예제와 잘 정리된 강의 때문에 직접 정리할 시간을 많이 줄여주는 좋은 강의라고 생각합니다.\n-go***\n★★★★★\n강사님을 알게 되어 코틀린의 재미를 알게 되었습니다! 비록 수강평이지만 너무 감사드리고 인생 강사님을 만나게 된 것 같은 시간이었어요! 다음 강의계획이 어떻게 되시는지 모르겠지만 나오면 무조건 필구 예정입니닷!!\n-원***\n★★★★★\n강의는 다른 리뷰들이 말한 거처럼 이해하기 좋아요. 근데 제일 좋은 건 질문하면 정말 성심성의껏 자세히 알려주시는 점이 정말 좋습니다 예를 들면 이런 간단한 질문에도.. 감동!\n\n- 아***\n지식공유자의 다른 강의 📺\n자바 개발자를 위한 코틀린 입문(Java to Kotlin Starter Guide)\nKotlin\nJava\n객체지향\n(84)\n₩55,000\n실전! 코틀린과 스프링 부트로 도서관리 애플리케이션 개발하기 (Java 프로젝트 리팩토링)\nKotlin\nSpring Boot\nJava\n리팩토링\n(56)\n₩77,000\n지식공유자가 알려주는\n강의 수강 꿀팁!\n🎓\n이런 분들께\n추천드려요!\nJava 언어만 알고 있는데, 서버를 배워보고 싶은 분!\nJava와 Spring Boot를 활용한 서버 개발을 해보고 싶은 분!\n강의 하나로 개발부터 배포까지 필요한 모든 것을 편안하게 학습하고 싶은 분!\nJS나 Python으로 서버 개발 부트캠프를 들었는데, Java Spring으로도 서버 개발을 해보고 싶으신 분\n📚\n선수 지식,\n필요한가요?\nJava 언어에 대한 기초지식",
      "lectureDifficulty": "초급자"
    }
  },
  {
    "model": "lectures.lecture",
    "fields": {
      "thumbnail": "https://cdn.inflearn.com/public/courses/330128/cover/7e8577d7-efa2-464b-9b1e-13d39033e24e/330128-eng.png",
      "lectureTitle": "파이썬과 인공지능을 활용한 금융 자료 분석 기초\n대시보드",
      "lectureFee": 77000,
      "lectureDescription": "초급자를 위해 준비한\n[데이터 분석, 인공지능] 강의입니다.\n주식, 환율, 코인, 부동산, 채권 등 금융 데이터는 주변에서 쉽게 접할 수 있고 우리에게 돈을 벌 수 있는 기회를 제공하지만 대부분의 사람들은 그 특성과 다루는 방법을 알지 못해 소중한 기회를 놓치고 있습니다. 이 강의를 통해 다양한 금융 데이터의 의미 파악과 파이썬을 이용한 분석 방법을 배울 수 있습니다.\n✍️\n이런 걸\n배워요!\n시계열 데이터 다루기\n이동 평균선 시각화 및 활용 방법\n수익률과 매매 전략\n주식 시장 분석\n포트폴리오 최적화 방법\n선형회귀 모델을 활용 CAPM 모델링\n시장 수익률 초과 주식 발굴\n신용카드 고객 세분화\n신용카드 고객 연체 예측 모델 작성\n파이썬, 금융 데이터, 인공 지능 모델을\n한 강의에서 배울 수 있어요 🤗\n파이썬과 금융 데이터의 만남 ⚒️\n일반적인 데이터 분석과 인공 지능 모델에 관한 강의는 많이 있으나 금융 데이터에 특화된 전문적 강의가 부족한 것이 현실입니다. 본 강의에서는 파이썬을 이용한 금융 데이터 분석 방법과 인공 지능 모델을 금융 데이터에 적용하는 방법을 알려드려요.\n시간이 아주 부족한 학습자가 인공 지능 관련 사전 지식이 없이도 강의를 따라올 수 있도록 구성하였습니다. 이 강의를 통하여 금융 데이터 분석 전반에 관한 파이썬과 인공 지능 관련 기초 지식을 쌓을 수 있다고 자신합니다.\n이런 걸 배워요 📖\n머신러닝과 금융 분석\n\n시계열 데이터\n(Time Series Data)\n수익률과 Risk\n\n금융 분석에\nMachine Learning 적용하기\n이런 분들께 추천해요 🙋\n금융 기관에 재직하는 데이터 분석가 및 개발자\n파이썬을 활용한 주식 투자에 관심 있는 개발자\n인공 지능 모델의 금융 분야 활동에 관심 있는 분\n파이썬, 인공 지능 모델 이론을 공부했지만 활용 방법을 모르겠는 분\n이 강의와 함께해요! 📌\n금융 데이터와 일반 데이터의 특성 차이를 이해하여 적절한 처리 방법을 적용할 수 있게 됩니다.\n주식 투자 등 재테크에 파이썬과 인공 지능을 적용할 수 있는 아이디어를 얻게 됩니다.\n실제로 인공 지능이 어떻게 활용될 수 있는지 살아 있는 경험을 할 수 있습니다.\n강의 특징 ✨\n실습 중심으로\n실력을 쑥쑥 🌱\n실습을 통해 실력을 향상할 수 있도록 구성한 실습 위주의 강의입니다.\n작동 원리까지\n자세히 설명 🎤\n실습을 시작하기 전에 금융 데이터 처리 요령과 인공 지능 모델의 작동 원리에 대해 알기 쉽게 설명합니다. 사전 지식 없는 사람도 수강할 수 있도록 구성했습니다.\n예상 질문 Q&A 💬\nQ. 파이썬(Python) 언어를 몰라도 되나요?\n이 강의는 파이썬으로 진행됩니다. 시간이 부족한 분들을 위해 기본 문법과 Pandas, Matplotlib 등의 기초 crash 과정을 제공하므로 사전에 파이썬 언어를 몰라도 수강할 수 있습니다.\nQ. 인공 지능 모델에 관해 전혀 몰라도 되나요?\n인공 지능 모델에 대한 사전 지식이 있으면 강의 내용을 쉽게 이해할 수 있겠지만 금융 데이터 처리에 적합한 몇 가지 모델에 대해 작동 원리를 설명하므로 사전 지식 없이도 수강할 수 있습니다.\n지식공유자가 알려주는\n강의 수강 꿀팁!\n🎓\n이런 분들께\n추천드려요!\n프로그래 작성에 관심 있는 금융 회사 직원\n금융 산업에 관심 있는 일반 개발자\n파이썬을 이용한 주식 투자에 관심 있는 일반인\n📚\n선수 지식,\n필요한가요?\n파이썬 언어",
      "lectureDifficulty": "초급자"
    }
  },
  {
    "model": "lectures.lecture",
    "fields": {
      "thumbnail": "https://cdn.inflearn.com/public/courses/329913/cover/eee923cc-911b-4c2d-a445-9fddee8e5992/thumbnail-precamp.png",
      "lectureTitle": "[인프런x코드캠프] 시작은 프리캠프\n대시보드",
      "lectureFee": 22000,
      "lectureDescription": "입문자를 위해 준비한\n[웹 개발, 프론트엔드] 강의입니다.\n코딩 부트캠프의 독보적인 커리큘럼으로 만든 강의입니다. 가장 기초적이고 실무에서 꼭 필요한 내용들로 구성되어 있어요. '누구나 가능한 개발자로의 커리어 전환' 이 강의로 시작하세요.\n✍️\n이런 걸\n배워요!\n비전공자도 한번에 알아듣는 코딩 프로그램 설치법\n웹과 개발에 대한 진짜 기초 개발 상식\n모든 웹의 기본 회원가입의 기획부터 구현까지\n개발자의 다이어리, 깃허브 관리 법\n개발자가 꼭 알아야 하는 협업툴 다루는 법\n코딩 기초 뿌시기 Chapter 01.\n시작은 프리캠프!\n시중에 너무 많은 코딩 입문 강의들과\n어떤 것을 들어야 할지, 막상 들어도 기초가 부족해 이해되지 않는다면\n이 강의를 주목해주세요!\n[프리캠프]는요 ✨\n👉🏻 500명 이상의 개발자를 양성하며 얻은 노하우의 결정체\n👉🏻 실무에 필요한 기초를 콕콕 찝어주는 완벽한 강의\n👉🏻 노베이스도 탄탄한 기초로 무장시켜 주는 강의\n👉🏻 추억의 ㅆr이월드(..☆★) 미니홈피 실습으로 웹 개발의 기초와 원리 구축\n👉🏻 이론과 실습, 4:6의 황금비율로 자연스럽게 습득할 수 있는 코딩 스킬\n웹·앱 개발의 기초가 되는 HTML·CSS·Javascript의 기본적인 문법과 활용 방법을 배워요 📚\nStep 01.\n코딩 첫 걸음, 프로그램 설치부터 시작해볼까요?\n멋진 코드를 가득 채우려면, 하얀 백짓장은 필수죠! 코드를 써내려가기 위해 어떤 프로그램이 필요한지, 어떻게 설치하고 활용해야 하는지 하나도 빠짐없이 자세하게 알려드릴게요. 더불어 개발자로서 꼭 알고 있으면 좋은 컴퓨터 기본지식까지! 시작부터 확실하게 알고 가세요 😎 \nStep 02.\n모든 웹의 필수 기능. 로그인과 회원가입을 구현해요.\n혹시 회원가입 없는 웹사이트 보셨나요?\n웹사이트의 기본 중의 기본! HTML과 CSS의 기본 속성들을 학습하면서 회원가입과 로그인을 직접 구현해봐요. 코딩이 처음이라 익숙치 않던 부분들도, 어느새 여러분의 손 끝에 자연히 스며들 거예요.\nStep 03.\n열심히 코딩하는 멋진 나! 깃허브에 나의 노력을 기록해 보세요.\n지금 가지고 있는 그 열정🔥 눈으로 확인하고 싶지 않나요? 나의 성실도를 체크하는 깃허브 시작하는 법부터 관리법까지. 개발자의 다이어리인 만큼 꼭 알고 가야겠죠?\nStep 04.\n추억의 ㅆr이월드☆로 웹 개발의 기초를 더 탄탄히 다지세요.\n섹션별로 배웠던 내용을 싸이월드 미니홈피를 구현하면서 적용해보는 프로젝트예요.\n총 5단계의 실습 끝에는 나만의 미니홈피가 완성되어 있을 거예요! 🏠\n[프리캠프] 수강 후엔\n이런 입문자가 될 수 있어요.💪🏻\n잠깐! 수강 전 확인해주세요. 📢\n💡 일과표를 만들어 규칙적으로 꾸준히 학습하시길 권장해요.\n💡 학습 자료를 받기 위해 협업툴 ‘노션’ 계정을 만들어주세요.\n💡 수강에 필요한 학습자료는 노션(링크)으로 제공됩니다.\n ※ 학습 자료의 저작권은 코드캠프에게 있습니다. 무단 도용 · 배포 · 복제를 금지합니다.\n궁금한 점이 있으신가요? 💬\nQ. 정말 비전공자도 수강할 수 있나요?\nA. 네. 비전공자가 코딩의 진입장벽을 넘을 수 있도록 짜여진 커리큘럼이에요.\n비전공자 눈높이에 딱! 알맞은 강의입니다.\nQ. 별도의 교재가 있나요?\nA. 노션으로 제공해드리는 [강의 자료]를 활용해주세요!\nQ. [프리캠프] 수강 후 어떤 강의를 추천하시나요?\nA. [강력한 CSS] 강의를 추천드려요.\nHTML/CSS와 JavaScript에 대한 기초를 쌓았으니, 더 깊은 심화 내용을 다뤄보세요!\n팀 코드캠프를 소개합니다. 💑\n지식공유자가 알려주는\n강의 수강 꿀팁!\n🎓\n이런 분들께\n추천드려요!\n코딩에 관심이 있는 누구나\n코딩의 'ㅋ'자도 모르는 컴맹\n코딩을 배우고 싶은데 시작이 막막한 분들\n개발자가 적성에 맞는지 확인하고 싶은 분들\n개발자와의 협업 능력을 고도화하고 싶은 UI/UX 디자이너\n업무 커뮤니케이션 능력을 향상 시키고싶은 PM\n📚\n선수 지식,\n필요한가요?\n노베이스도 괜찮아요\n개발자에 대한 열정과 의지\n코딩에 대한 호기심",
      "lectureDifficulty": "입문자"
    }
  },
  {
    "model": "lectures.lecture",
    "fields": {
      "thumbnail": "https://cdn.inflearn.com/public/courses/329802/cover/6d5ce981-4c24-4356-89a9-8532787ad465/329802-eng-resize.png",
      "lectureTitle": "퀘이사(Quasar) 완벽 마스터: Vue 프론트 웹을 빠르게 만들고 싶다면! (Based Vue3)\n대시보드",
      "lectureFee": 88000,
      "lectureDescription": "초급자를 위해 준비한\n[프론트엔드, 웹 개발] 강의입니다.\nVue.js로 웹 개발을 하며 퀘이사(Quasar)를 이용하고 싶은 분들을 위한 강의입니다. 사내에서 프론트 웹을 빠르게 구축해야 하는 분 또는 나만의 멋진 UI를 만들어야 하는 분이신가요? 이 강의를 통해서 쉽고, 빠르게 프론트 웹을 만들 수 있습니다.\n✍️\n이런 걸\n배워요!\nTypography, Color, Breakpoint 등 퀘이사 \"제대로\" 사용하는 법\n폼 핸들링 & 유효성체크, 다국어처리 등 실무에서 필요한 지식!\nGrid System, Layouts 활용한 컴포넌트 정렬 & 배치\nQuasar Utils&Plugins, SEO, Deployment 등 퀘이사 제대로 학습\nInstagram, Youtube, Login Page 클론코딩을 통한 실전감각!\n빠르게 & 제대로 UI를 그리고 싶다면? \n최신 Vue3을 위한 퀘이사 완전 정복! \nVue.js 기반 UI 프레임워크 \n퀘이사(Quasar) 한번에 끝내기\nVue.js 기반 UI Framework, 퀘이사(Quasar)를 아시나요? 이번 강의로 퀘이사를 알게 된다면 개인 프로젝트 뿐만 아니라 회사에서 실무 프로젝트를 진행할 때 UI를 막힘없이 만드는 데 꼭! 도움이 되실 겁니다.\n쉽게, 빠르게, 편리하게 \n원하는 UI를 개발하고 싶다면!\n처음에는 Vue3 + Quasar + Firebase를 활용해 진짜 커뮤니티 사이트를 만드는 강의를 준비하고 있었습니다. 그리고 이렇게 만들어진 커뮤니티는 제가 실제로도 이용할 계획이었습니다. \n그런데 퀘이사를 이용해 UI를 만들던 중 수강생 분들이 UI 구축에 대한 여러 질문을 주셨고, ”원하는 UI를 막힘없이 만들기 위해서는 별도의 퀘이사 강의가 필요하겠다”는 생각이 들었습니다.\n왜냐하면 초기 웹 애플리케이션을 구축할 때 사용하는 프레임워크의 참여도가 높으면 높을 수록 해당 프레임워크를 “제대로” 알고 사용하는 경우와 그렇지 않은 경우에는 개발 생산성도, 유지관리 측면에서도 크나큰 차이가 있기 때문입니다. \n그래서 이왕 강의를 준비하는 거, \n개인 웹 사이트를 만드시는 분들이 빠르게, 멋진 UI를 개발할 수 있도록\n현업에 계신 개발자 분들이 이 강의를 통해 성공적인 프론트 웹을 개발할 수 있도록\n퀘이사 프레임워크를 한 번에 끝낼 수 있는 강의를 준비하게 되었습니다.\n왜, 퀘이사 프레임워크일까요? 👀\n현재 최신 Vue3을 안정적으로 지원하는 프레임워크입니다.\n각 컴포넌트 API 스펙(Prop, Event, Slots)이 매우 뛰어납니다.\n컴포넌트뿐만 아니라 유틸, 플러그인, 빌드 등 프론트 개발을 전반적으로 지원하는 올인원 프레임워크입니다.\n저 역시 이번에 제가 사용할 커뮤니티를 퀘이사로 개발할 예정이에요~! 😊\n퀘이사 완벽 마스터 \n커리큘럼 살펴보기 📖\n✅ 공식 문서를 함께 살펴봄으로써 수강생 분들이 스스로 나아갈 수 있는 힘을 길러드립니다.\n✅ 사전 지식이 필요한 부분은 별도의 가이드를 제공함으로써 제대로 이해할 수 있도록 돕습니다.\n✅ 수업 중간에 재밌는 기능, 클론코딩을 통하여 재미와 실전 감각을 익힐 수 있도록 준비했습니다.\n퀘이사 시작하기\n퀘이사란 무엇인가! 퀘이사를 사용하는 이유\nQuasar CLI로 시작하기 - 4가지 방법\n프로젝트 구조 - Scaffolding된 구조 살펴보기\n퀘이사 기초\nTypography, Colors, Spacing - 글꼴, 색상, 간격 활용하기\nBreakpoints - 반응형 웹 쉽게 만들기\nDark Mode (다크 모드) 기능 만들기\nGrid & Layout\nFlex Grid - 원하는 UI를 만들기 위한 첫 단추!\nWeb Layout, Multiple Layout - 웹 레이아웃, 다중 레이아웃\n인스타그램 프로필 페이지 만들기\nLogin & Form, Utils & Plugins\n로그인, 회원가입 페이지 만들기\nQForm - 폼 핸들링, 유연성 체크\nQuasar Utils & Plugins\n다국어 처리\nQuasar Language Packs - 퀘이사 내부 컴포넌트 다국어 적용\ni18n - 사용자 정의 컴포넌트 다국어 적용\n유튜브 페이지 클론코딩\n유튜브 페이지 만들기\nDeployment & SEO\nDeployment - SPA 배포하기\nMeta Plugin을 활용한 간단 SEO 최적화\n  퀘이사로 완성하는 쉽고 빠른 UI 구축 🙌\n퀘이사 프레임워크를 통해 스스로 쉽고, 빠르게 UI를 구축할 수 있도록 하는데 중점을 둔 강의입니다. 수강 후 스스로 공식문서를 보고 원하는 UI를 개발할 수 있는 힘을 길러드립니다!\n짐코딩 유튜브에서 강의 미리보기 (EP 01~07)\n짐코딩과 함께하는\n실용적인 코딩 학습 💪\n안녕하세요, 짐코딩입니다. 저는 현재 실용적인 코딩 채널인 \"짐코딩 GYM CODING\" 유튜브 채널을 운영하고 있습니다. 올해 Vue.js3 기본편과 실전편을 론칭했었는데요. 많은 분들이 좋은 피드백을 주셨습니다.\nVue.js 3 완벽 마스터: 기초부터 실전까지 - \"기본편\" 총 수강생 311, 평점 5.0\nVue.js 3 완벽 마스터: 기초부터 실전까지 - \"실전편\" 총 수강생 262, 평점 5.0\n\"Vue.js 3 진짜 커뮤니티 사이트 만들기 강의\" 론칭 전 수강생 분들이 스스로 원하는 UI를 자유롭게 만들 수 있도록 Quasar Framework 강의를 론칭하게 되었습니다.\n유튜브 | 깃헙 | Gym스타그램 | Coding스타그램\nQ&A 💬\nQ. Vue.js 지식이 없는 상태에서 수강해도 될까요?\n해당 강의는 Vue3를 알고 있는 상태에서 수강하기에 적합합니다. 선수 지식으로는 다음 강의를 추천합니다.\nVue.js 3 완벽 마스터: 기초부터 실전까지 - \"기본편\"\nVue.js 3 완벽 마스터: 기초부터 실전까지 - \"실전편\"\n그리고 유튜브 짐코딩 채널에서 다양한 개발 관련 지식을 얻으실 수 있어요 🙂\nQ. 강의에 사용된 소스코드가 제공되나요?\n매 수업 회차별로 해당 코드를 다운로드할 수 있도록 제공하고 있습니다.\nQ. 서버 연동에 관한 내용도 다루나요?\n아닙니다. 본 강의는 서버 연동은 하지 않고 퀘이사에 집중하여 실무에서 UI를 제대로 그리고 빠르게 만들 수 있도록 준비한 강의입니다. 서버 연동 관련 수업은 Vue.js 3 완벽 마스터: 기초부터 실전까지 - \"실전편\" 강의에서 다루고 있으니 참고 부탁드립니다. \n프로그래밍 초보 가이드 📢\n프로그래밍을 이제 막 시작하시는 분들이 본 강의를 원활히 수강할 수 있도록 프론트엔드 개발 가이드를 안내해 드립니다. 다음 6개 강의를 순서대로 학습하시면 프론트엔드 개발을 쉽고 재미있게 배울 수 있습니다 😊\n입문자를 위한, HTML&CSS 웹 개발 입문\nHTML/CSS\n(33)\n무료\n입문자를 위한, ES6+ 최신 자바스크립트 입문\nJavaScript\nES6\n(6)\n₩88,000\n프론트엔드 날개달기: Vuejs, React 배우기 전에 꼭 알아야하는 지식\nWebpack\n(87)\n무료\nVue3 완벽 마스터: 기초부터 실전까지 - \"기본편\"\nVue.js\n(83)\n₩66,000\nVue3 완벽 마스터: 기초부터 실전까지 - \"실전편\"\nVue.js\n(44)\n₩88,000\n퀘이사(Quasar) 완벽 마스터: Vue 프론트 웹을 빠르게 만들고 싶다면! (Based Vue3)\nQuasar\nVue.js\n(16)\n₩88,000\n이외에도 유튜브 짐코딩 GYM CODING 채널에서 다양한 개발 지식을 접할 수 있으니, 관심 있으신 분들께서는 구독해주시면 감사하겠습니다.\n지식공유자가 알려주는\n강의 수강 꿀팁!\n🎓\n이런 분들께\n추천드려요!\n현재 Vue3로 빠르게 웹 프로젝트를 구축해야 하는 개발자!\nVue 기반으로 예쁜 UI를 \"빠르고\", \"쉽게\" 만들고자 하는 분!\nQuasar Framework를 기초부터 \"제대로\" 사용하고자 하는 분!\n📚\n선수 지식,\n필요한가요?\nHTML&CSS\nJavaScript\nVuejs3",
      "lectureDifficulty": "초급자"
    }
  },
  {
    "model": "lectures.lecture",
    "fields": {
      "thumbnail": "https://cdn.inflearn.com/public/courses/329676/cover/b1039bd7-039d-4d63-a480-6bd57d622413/329676-eng.png",
      "lectureTitle": "즐거운 자바\n대시보드",
      "lectureFee": 0,
      "lectureDescription": "입문자를 위해 준비한\n[프로그래밍 언어, 백엔드] 강의입니다.\n기업에서 가장 많이 사용하는 프로그래밍 언어중 대표적인 언어를 말하라고 하면 Java언어를 말할 것 같아요. 즐거운 자바 교육과 함께 즐겁게 자바 공부를 진행해보세요.\n✍️\n이런 걸\n배워요!\nJava 기본 문법\nJava 객체지향 문법\nJava IO\nJava Thread\nJava 네트워크 프로그래밍\n간단한 웹 서버 만들기\n간단한 채팅 서버 & 채팅 클라이언트 만들기\n자바(Java), 사전지식 없이 들어가서\n간단한 프로젝트와 함께 나오세요! 🤩\n자바 개발을 잘하고 싶다면 주목! 🌱\n오프라인 국비교육을 통해 프로그래밍을 배우는 분 중 수업을 따라가는 게 힘들다는 고민을 가진 분이 많죠. 또한, 국비교육을 받고 싶어도 여러 가지 사정으로 수강을 못 하는 분들도 많습니다. 수업 한 번 듣는 것으로는 이해가 어려운 프로그래밍 수업. 시간과 장소에 구애받지 않고 여러 번 수업을 들을 수 있게 하고자 무료 자바 강의를 준비했습니다.\n왜 Java(자바)인가요? 🧐\n기업에서 서버 프로그래밍을 할 때 가장 많이 사용하는 언어예요.\n객체지향 언어 중 하나.\n버전업을 거듭하며 다른 언어의 장점을 흡수하고 있어요(모던 자바).\n람다(Lambda): 함수형 프로그래밍\nSteam API: 람다 표현식과 메서드 참조 등의 기능과 결합하여 복잡하고 어려운 데이터 처리작업을 쉽게 조회, 필터링, 변환 및 처리할 수 있도록 해요.\n병렬 프로그래밍: 여러 개의 CPU 코어에서 작업을 배분하여 동시 작업을 수행할 수 있어요.\n본 강의는 자바로 백엔드 프로그래밍을 하려는 분들을 위한 과정입니다. 자바 개발 환경 설치부터 시작해서, 기초 문법, 객체지향 문법, IO, Thread, Network 프로그래밍까지 다루며 간단한 프로젝트까지 진행합니다.\n이해가 어려운 부분이 있다면 반복적으로 들어주시고, 그래도 이해가 가지 않는다면 단톡방을 운영하고 있으니 단톡방에서 함께 공부하는 분들에게 질문해주세요. 저도 자주 방문해서 답변을 드리고 있습니다.\n이런 분들께 추천해요 🙋\n백엔드 개발자를 꿈꾸는\n취업준비생\n국비교육만으로\n충분하지 않은 분\n자바 강의를 찾고 있는\n대학생\n학습 내용 📚\n문법\n자바 기본 문법\n객체지향 개념과 문법\n자주 사용하는\n몇 가지 디자인 패턴\n  제네릭(Generic)과\n컬렉션(Collection)\n프레임워크\nJava IO (입출력)\n\n\n\n스레드(Thread)와\n네트워크 프로그래밍\n\n\n미니 프로젝트\n회원 관리 프로그램\n웹 서버\n채팅 프로그램\n예상 질문 Q&A 💬\nQ. 사용하는 JDK 버전은?\n11버전을 사용합니다. 기업에서 가장 많이 사용되는 JDK 버전은 아직 8과 11이라고 생각합니다.\nQ. 강의에 사용되는 IDE는?\nIntelliJ를 사용합니다. IntelliJ 커뮤니티 버전은 무료로 다운로드 받아 사용할 수 있습니다.\nQ. 모든 Java 문법을 다루나요?\n모든 자바 문법을 다루지 않습니다. 람다, 스트림, NIO 등을 다루지 않습니다. 해당 과정을 잘 듣고 이해한다면 모던 자바 문법은 스스로 학습할 수 있지 않을까 기대합니다.\n지식공유자 소개 ✒️\n이력 사항\n현) (주) 펴나니 개발 본부장\n이베이 코리아 Sr. MTS, Software Engineer\n패스트캠퍼스 - 스프링 부트, 자바 백엔드 장기 과정 교육\nNHN 소프트웨어 엔지니어 (수석)\n(주)써니베일 대표이사\nT3Q(주) 기술이사\n삼성SDS 멀티캠퍼스 자바, 분석/설계, CBD, UML, 디자인 패턴 등 교육\n비트 교육센터 자바 관련 교육\n저서\nJava IO/NIO (2004년) - 한빛미디어\n쉽게 풀어쓴 웹로직과 EJB(2004년) - 한빛미디어\n프로그래머로 산다는 것 - 로드북\n수강 전 참고 사항 📢\n실습 환경\n운영 체제 및 버전(OS): MacOS, Windows, Linux\n사용 도구: JDK 11, IntelliJ\n선수 지식 및 유의 사항\n선수지식 없음\n열정 필요\n지식공유자가 알려주는\n강의 수강 꿀팁!\n🎓\n이런 분들께\n추천드려요!\n자바 프로그래밍을 처음 배우려는 분\n국비 백엔드 과정을 들었는데도 자바가 이해안가는 분\n자바를 배웠거나, 배우려는 대학생",
      "lectureDifficulty": "입문자"
    }
  },
  {
    "model": "lectures.lecture",
    "fields": {
      "thumbnail": "https://cdn.inflearn.com/public/courses/329497/cover/ad92112c-9329-4ae1-a0f0-3901233b65f1/329497-eng.png",
      "lectureTitle": "Flutter 초입문 왕초보편\n대시보드",
      "lectureFee": 99000,
      "lectureDescription": "입문자를 위해 준비한\n[모바일 앱 개발] 강의입니다.\n이 강의는 플러터(Flutter)를 시작하는 모든 분들이 플러터 기초를 빠르게 학습할 수 있도록 만들었습니다.\n✍️\n이런 걸\n배워요!\nFlutter로 간단한 앱을 만들 수 있는 최소한의 기본기\nFlutter 개발에 대한 자신감 향상\nDart 기초 문법\n입문보다 더 입문, 플러터 초입문 왕초보편!\n지금, 왜 Flutter 인가요?\n구글에서 개발한 Flutter는 Android, iOS, Web, Windows, Mac, Linux 까지 다양한 환경을 지원하는 멀티플랫폼 개발 프레임워크입니다. 하나만 배워서 여기저기 써먹을 수 있으니 이보다 좋은 게 있나 싶네요.\n이 강의를 통해 Flutter를 시작하시면 기초를 빠르게, 그리고 쉽게 익히실 수 있습니다.\n단 몇 줄의 코드로 완성하는 UI\n스크롤이 되는 리스트를 작성할 때를 예로 들어봅시다. 기존 안드로이드 코드로 리스트를 작성하기 위해서는 어댑터와 리사이클러뷰를 작성하는 데만 해도 엄청나게 많은 코드와 시간이 필요합니다. 여기부터 초심자가 좌절하는 지점이지요.\n기존의 안드로이드 리스트 코드\n하지만 Flutter에서는 단 몇 줄의 코드만 작성하면 됩니다.\nFlutter의 리스트 코드\n이렇듯 Flutter를 사용하면 개발이 획기적으로 빨라집니다. UI와 비즈니스 로직의 분리 또한 확실해집니다.\n오준석의 플러터 생존 코딩: Flutter 입문보다 더 입문 📲\n오프라인에서 Flutter 강의를 5개 기수 이상 진행했습니다. 강의를 진행하면서 코딩이 처음인 사람들에게 필요한 부분이 무엇인지 고민하고, 문제를 도출하여 이 강의를 만들게 되었습니다.\n기존 제가 만든 'Flutter 입문' 강의가 어려우셨다면, 이 강의를 통해 진정한 기초를 공부하실 수 있습니다.\n다루는 내용\n코딩에 대해 아무것도 모르는 분들을 대상으로 합니다.\n이 강의는 《오준석의 플러터 생존 코딩》에 있는 예제와 더불어 책에 담지 못한 다른 예제들을 《오준석의 안드로이드 생존코딩: 코틀린편》 에서 차용하여 추가로 다루면서 Flutter로 만들어보는 형식으로 진행됩니다. 이 과정을 통해 간단한 앱을 Flutter 만들어 가면서 팁과 이슈를 경험하게 됩니다.\n이 강의를 통해 기초를 배우고, 2022년에 리뉴얼된 'Flutter 입문' 강의를 들으면 Firebase 등을 활용하여 웬만한 수준의 개인 모바일 앱을 작성하실 수 있을 것입니다.\n예제로 배우는 Flutter \n입문보다 더 입문: 초입문 왕초보편 \n이 강의에서는 먼저 Flutter의 기초를 익힌 이후 예제를 통해 Flutter의 사용법을 배우게 됩니다.\n각 예제에서 배울 수 있는 내용은 다음과 같습니다.\n8가지 모바일 앱 예제로 배우는 플러터\n비만도 계산기\n화면 전환 (Navigation)\n스톱워치\nTimer 활용\n나만의 웹 브라우저\nWebView\n전자액자\nImagePicker, 화면 좌우 스크롤\n수평측정기\n가속도계 센서 활용, Stream\n실로폰\n소리 재생\nGps Map\n구글 맵, 위치 정보, 지도 위에 이동경로 그리기\nTodoList\nHive\n강의 선택 가이드\n본인이 공부해야 할 강의가 맞는지 확인해 보세요.\n연관 로드맵\nFlutter 앱 프로그래밍 - Android와 iOS 개발을 한 번에\n오준석\nQ&A 💬\nQ. 수강 대상이 어떻게 되나요?\n아무것도 모르시는 분이거나, 다른 입문 강의를 들었는데 어려웠던 분들을 대상으로 합니다.\nQ. 수강 전에 강의가 어떻게 진행되는지 알 수 있는 방법이 없을까요?\n이 강의에서 제공하는 무료 공개 수업을 먼저 들어보시고 들어보시고 강의 스타일이 맞다면 수강 신청을 진행하시면 됩니다.\nQ. 강의에서 사용하는 소스 코드가 제공되나요?\n소스 코드를 제공합니다. 섹션 1 [소스 코드] 수업을 확인해주세요.\n지식공유자가 알려주는\n강의 수강 꿀팁!\n🎓\n이런 분들께\n추천드려요!\nFlutter가 정말 처음이신 분\nFlutter 입문 수업이 어려웠던 분",
      "lectureDifficulty": "입문자"
    }
  },
  {
    "model": "lectures.lecture",
    "fields": {
      "thumbnail": "https://cdn.inflearn.com/public/courses/329344/cover/012ac485-48dd-43a4-b152-184605b2cff5/329344-eng.png",
      "lectureTitle": "모두의 깃 & 깃허브\n대시보드",
      "lectureFee": 24200,
      "lectureDescription": "입문자를 위해 준비한\n[개발 도구] 강의입니다.\n길벗출판사 [모두의 깃&깃허브] 서적의 강의입니다. 깃과 깃허브를 이용한 버전관리의 핵심만을 모았습니다. 개발자의 필수 교양이라 할 수 있는 깃을 명령어 없이, 명령어로 다루는 방법과 깃허브를 능수능란하게 다루는 방법을 배웁니다.\n✍️\n이런 걸\n배워요!\n소스트리를 이용해 명령어 없이 깃 배우기\n깃과 버전관리의 기초 개념\n명령어를 이용해 깃 배우기\n깃허브를 이용해 코드 백업하기\n버전 관리의 핵심 Git & Github! \n개발자의 필수 교양, 빠르게 익혀보세요 🚀\n📣 수강 전 확인해주세요!\n이 강의는 연재 강의입니다. 커리큘럼에 해당하는 수업 영상이 9월 3일까지 순차적으로 공개될 예정이니, 수강 전 참고해 주시기 바랍니다.\n열심히 짠 코드 버전이 \n꼬이거나 날아가 버린다면...? 🤦‍♀️\n여러 사람과 협업하고 있는데, 프로젝트 코드 관리를 잘 할 방법이 없을까?\n내가 짠 코드를 예전 버전으로 되돌리고 싶어! 근데 버전 관리는 어떻게 하지?\n작업해둔 코드가 날아갈까 봐 걱정이네… 백업해두고 싶은데 어디에 해야 할까?\n👉 이 모든 상황의 해법은 버전 관리입니다.\n내가 열심히 짠 코드가 버전이 꼬이거나 백업을 잘못해서 날아가 버린다면…? 😱 \n어떻게 코드를 작성하는지 배웠다면, 이제는 어떻게 코드를 관리해야 하는지 알아야 합니다. 어느덧 개발자의 필수 교양이 된 버전 관리 시스템, 깃 & 깃허브의 핵심만 빠르게 익힐 수는 없을까요? \n화제의 책, 인프런 강의와 함께 만나보세요.\n이 강의는 책 『모두의 깃&깃허브』 (길벗출판사) 를 토대로 만든 강의입니다. \n깃 & 깃허브를 (1) 명령어 없이 쉽게 (2) 명령어로 능수능란하게 다루는 두 가지 방법을 모두 알아보고, 손쉽게 버전 관리를 시작할 수 있도록 도와드리겠습니다. 함께 시작해보아요!\n모두의 깃&깃허브, 이런 분들께 추천해요! 🙋‍♀️\n깃과 깃허브가 \n아예 처음인 분 \n컴퓨터에 명령어를 입력하는 게 \n아직 어색한 개발자 지망생 \n깃과 깃허브를 빠르게 \n핵심만 배우고 싶은 분 \n이 강의만의 핵심 장점 ✅\n1,500명이 수강했던 기존 git 강의가 한층 더 새로워졌습니다.\n빠르게 git - 핵심만 골라 배우는 Git/Github\nGithub\nGit\n버전관리시스템\n(190)\n₩11,000\n기존 강의는 학습 자료 없이 핵심적인 깃 내용만을 빠르게 습득할 수 있게 구성된 강의라면 이번 강의는 보다 자세하게, 집필한 서적을 기반으로 만들어진 강의입니다.\n또한 기존 강의에서는 명령어로 깃을 다루는 방법을 설명했다면, 이번 강의에서는 (소스트리라는 프로그램을 이용해) 명령어 없이 깃을 다루는 방법과 명령어로 깃을 다루는 방법 모두를 다룹니다.\n저자 직강! 집에서 영상으로\n출간된 교재와 함께 학습할 수 있습니다.\n실습으로 더 꼼꼼하게\n깃 설치, 깃허브 회원가입부터 각종 명령어 활용까지 다양한 상황에서의 모든 실습을 보여줍니다.\n다양한 환경을 생각했어요\nWindows, macOS 운영체제에서의 실습을 모두 보여줍니다. 평소 쓰는 환경에 맞춰 편하게 배워보세요.\n누구나 쉽게 배울 수 있도록\n이해하기 쉬운 비유들과 함께 실무에서 꼭 필요한 핵심만을 다룹니다. \n그래서, 이런 걸 할 수 있게 됩니다! 💪\n명령어 없이 (소스트리를 활용해) 깃을 다룰 수 있습니다.\n소스트리를 활용해 깃을 다루는 과정에서 깃 명령어를 암기하지 않고도 명령어를 이용할 수 있습니다.\n실무에서 꼭 필요한 버전 관리의 핵심을 습득할 수 있습니다.\n수강생을 위해 미리 준비한 실습 공간을 통해 깃허브를 활용한 협업 경험을 쌓습니다.\n강의에서 배우는 내용을 \n확인해보세요 📚\n0️⃣ 버전 관리의 본질: 버전 관리에 대한 개념 다지기\n1️⃣ 소스트리를 이용해 명령어 없이 깃 다루기\n2️⃣ 명령어로 깃 다루기\n3️⃣ 깃허브를 이용해 백업하고 협업하기\n1. 환경 구성 및 깃 & 깃허브 기초 지식 익히기\n가장 먼저 깃, 소스트리를 설치하고 깃허브에 가입합니다. 누구나 공감할 만한 다양한 예시와 쉬운 설명을 통해 여러분이 배우고자 하는 깃, 버전 관리에 대한 이론적인 지식을 빠르고 정확하게 습득합니다.\n2. 소스트리 실습 - 명령어 없이 깃 & 깃허브 다루기\n깃과 깃허브를 다루는 가장 간편한 방법은 명령어를 숙지하고 활용하는 것이지만, 처음부터 모든 명령어를 암기할 필요는 없습니다. 명령어 없이도 깃과 깃허브를 다룰 수 있는 소스트리라는 프로그램이 있기 때문이지요.\n소스트리를 이용해 앞서 배운 이론적인 내용들이 어떻게 시각적으로 구현되는지 학습해보는 시간을 가집니다. 소스트리를 이용해 버전을 만들고, 되돌리고, 다른 개발자와 협업하는 방법을 배웁니다. 소스트리를 이용해 깃과 깃허브를 다루다 보면, 명령어도 금방 암기하고 익힐 수 있습니다.\n3. 명령어 실습 - 명령어로 깃 다루기\n마지막으로 명령어를 이용해 깃을 다루는 방법을 배웁니다. 1, 2를 올바르게 따라왔다면 아주 빠르게 배울 수 있을 것입니다. 여기까지 학습하고 나면 명령어를 통해 능수능란하게 깃과 깃허브를 다루고, 버전을 관리할 수 있게 됩니다.\n학습 전 Q&A 💬\nQ. 꼭 책이 있어야 하나요?\n아니요, 책 없이도 수강에는 지장이 없습니다. 다만 강의가 책을 바탕으로 진행되기 때문에 책이 있으면 추후 복습을 더욱 쉽게 할 수 있습니다.\nQ. 소스트리를 꼭 배워야 하나요? 깃 명령어만 외우면 안되나요?\n그래도 됩니다. 다만 그렇게 하실 분들은 깃 명령어를 빠르게 핵심만 골라 알려드리는 저의 다른 인프런 강의인 [빠르게 Git- 핵심만 골라 배우는 Git/Github](링크)를 수강하시길 권합니다.그렇지만 명령어를 무작정 암기하는 것보다는, 소스트리를 이용해 깃을 시각적으로 다루어본 뒤 명령어를 활용해보는 것을 추천해드립니다.\nQ. 비전공자도 들을 수 있는 강의인가요? 어느 정도의 기반 지식이 필요한가요?\n특별히 사전 지식이 필요하진 않습니다. 설치부터 회원가입, 모든 명령어의 실습까지 다룰 예정이니까요. 걱정 말고 수강해주세요.\n지식공유자가 알려주는\n강의 수강 꿀팁!\n🎓\n이런 분들께\n추천드려요!\n깃을 처음 접하는 사람\n개발자의 기본기를 다지고 싶은 사람\n버전 관리의 개념을 다지고 싶은 사람\n깃허브를 이용해 다른 개발자와 협업하고 싶은 사람",
      "lectureDifficulty": "입문자"
    }
  },
  {
    "model": "lectures.lecture",
    "fields": {
      "thumbnail": "https://cdn.inflearn.com/public/courses/329186/cover/a63c6c95-2318-4e7a-a4f0-34d4512b3ae6/329186-eng.png",
      "lectureTitle": "GraphQL 완전정복 (가상의 키오스크를 구현하며 배우는 풀스택 과정)\n대시보드",
      "lectureFee": 55000,
      "lectureDescription": "초급자를 위해 준비한\n[풀스택, 웹 개발] 강의입니다.\n차세대 API 제어 기술인 GraphQL의 기본과 고급 사용법 그리고 GraphQL로 만들어 가는 가상의 키오스크 서비스를 통해서 실제 프로젝트 경험을 학습하게 됩니다.\n✍️\n이런 걸\n배워요!\nGraphql\nApollo\nMongoDB\nSvelte\nnodeJs 파일업로드\n토큰기반 인증방법\n풀스택(웹백앤드 + 웹프런트앤드)\n가상의 키오스크 서비스 개발\n프론트엔드, 백엔드 모두 구현 가능!\nGraphQL 실전을 경험해보세요 💪\n\n자신감의 가장 좋은 비결은\n무언가를 처음부터 끝까지 만들어보는 것입니다.\n웹에 대한 기초를 조금이라도 배우셨다면\n이번 기회에 다양한 기술들로 한발 더 나아가 보세요!\nGraphQL 완전 정복 👑\nREST API를 보완, 발전하여 만들어진 차세대 API 제어 기술 GraphQL. GraphQL의 기초부터 고급, 완결된 서비스까지! 이번 강의를 통해 백엔드, 프론트엔드, 배포까지의 모든 과정을 학습할 수 있습니다. 같이 스마트 메뉴판 만들어 보실래요?\n쉽게 이해할 수 있도록 준비한 강좌 내용\n#1.\nGraphQL의\n기본 문법과 고급 문법\nGraphQL에 필요한 문법들을 모두 차근차근 학습하게 됩니다. 강의의 이론 부분은 이미지, 애니메이션 등을 활용하여 최대한 쉽게 이해하실 수 있도록 준비했습니다.\n#2.\n실제 프로젝트\n(스마트 메뉴) 구현\n기본 사용 방법을 익혔으면 다음은 실제 프로젝트 구현이겠죠? 가상의 키오스크 서비스인 스마트 메뉴를 GraphQl을 이용해 만들어 볼 것입니다. 백엔드 서버에서 프론트엔드까지 모두 GraphQL을 중심으로 구현하게 됩니다.\n#3.\n다양한 문제의\n해결 방법\n단순히 코드를 따라 하면서 데이터를 읽고 쓰고 수정하는 것을 넘어, 서비스를 만들 때 발생할 수 있는 다양한 문제와 해결 방법을 학습하게 됩니다. Apollo 캐시 이용 시 발생하는 데이터 정합성 문제, NodeJS에서 파일을 업로드할 때 주의해야 할 점, 서비스에 꼭 들어가야 하는 인증 등을 배울 수 있습니다.\n#4.\n더 효율적인\n프론트엔드 개발 방법\n요즘 핫하게 떠오르고 있는 Svelte라는 프레임워크를 이용해 보다 효율적으로 프론트엔드 개발하는 방법도 알려드려요. 이를 통해 GraphQL의 기본 지식은 물론, 한 서비스의 백엔드, 프론트엔드, 배포까지 경험할 수 있게 됩니다.\n이런 분들께 추천해요 🙋‍♀️\nGraphQL에 관심이 있어 입문을 고민하는 분\n웹 백엔드, 프론트엔드 풀스택을 경험하고 싶은 분\nApollo, Svelte 등 최신 기술로 만드는 웹이 궁금한 분\nHTML, Javascript 기초를 익힌 후 뭔가 구현하고 싶은 분\n구현 프로젝트 미리 보기 👀\n무한 스크롤로 구현된 메뉴 보기 화면\n로그인 화면\n메뉴 등록 화면\n주문 후 알람 화면\n강의 참고 자료 📍\n강의에 사용된 패키지나 소스코드 등의 링크의 경우 ‘섹션2 GraphQL 기본 - 강의 자료 소개 ‘ 를 참고 바랍니다.\n참고 강의 📚\n만들면서 배우는 Svelte\nSvelte\n(8)\n₩33,000\n예상 질문 Q&A 💬\nQ. GraphQL에 대한 이론 강의 인가요?\n기본 사용법부터 실제 프로젝트에 적용하는 방법 모두를 학습합니다. 프로젝트의 경우 백엔드, 프론트엔드 모두에서 GraphQL을 구현하는 방법이 준비되어 있습니다.\nQ. 프론트엔드의 경우 Svelte를 미리 학습해야 하나요?\n강의 중간에 간략하게 Svelte의 기본 사용 방법을 준비했습니다. 준비한 내용만 알고 넘어가신다면 충분히 끝까지 학습 가능하다고 생각합니다.\nQ. 개발환경은 어떻게 되나요? \n맥, 윈도우 그리고 리눅스 등 nodeJs를 설치할 수 있는 어떤 PC에서도 개발환경에 필요한 프로그램을 설치하고 진행할 수 있습니다.\n지식공유자 소개 ✒️\n2000년도 중반부터 본격적으로 웹개발을 시작하여 현재까지 프리랜서 개발자로 활동하고 있습니다. 약 5년간 Amplix BI 솔루션 실무자 교육을 진행하고 개발을 지원하며 새로운 기술을 효율적으로 전달하는 것에 대한 많은 경험과 고민을 했습니다.\n현재는 개발 업무와 함께 개발자들에게 도움이 될만한 웹 관련 분야의 새로운 기술을 찾고 강좌와 책을 통해 공유하고 있습니다.\n  현) 프리랜서\n전) (주) 비즈플러그 전략솔루션 사업부 팀장\n전) (주) 퍼니몽키스 위니스토리 서비스 개발 팀장\n  email: freeseamew@gmail.com\nblog: https://medium.com/freeseamew\n출간 도서\n지식공유자가 알려주는\n강의 수강 꿀팁!\n🎓\n이런 분들께\n추천드려요!\njavascript 기초를 배우신분\n웹 서비스를 처음부터 끝까지 한번 만들고 싶은 분들\n웹 백엔드 엔지니어\n웹 프런트엔드 엔지니어\n📚\n선수 지식,\n필요한가요?\nhtml\njavascript",
      "lectureDifficulty": "초급자"
    }
  },
  {
    "model": "lectures.lecture",
    "fields": {
      "thumbnail": "https://cdn.inflearn.com/public/courses/329078/cover/862dc745-58e9-46c2-ac23-078b89fc65cb/329078-eng.png",
      "lectureTitle": "내 가치를 높이는 노션 이력서 만들기\n대시보드",
      "lectureFee": 49500,
      "lectureDescription": "입문자를 위해 준비한\n[취업 · 이직, 데이터 사이언스] 강의입니다.\n노션으로 이력서 만들기 어렵지 않아요. 친절한 가이드와 함께 앉은 자리에서 끝까지, 완성할 수 있는 이력서 만들기!\n✍️\n이런 걸\n배워요!\n노션으로 이력서 제작하는 법\n웹 서비스처럼 이력서 기획하고 구성하는 법\n이력서 각 섹션을 구성할 때 유의할 점\n데이터 활용 능력을 어필할 수 있는 이력서 작성 팁\n노션 페이지를 웹 페이지로 만들고 공유하는 법\n내 이력서 사람들이 잘 보고 있는지 데이터로 확인하는 법\n막막한 이력서 작성, 어떻게 하면 잘 쓸 수 있을까요?\n핸즈온 강의로 처음부터 끝까지 이력서를 완성해요! ✍️\n제대로 된 나의 이력서 쓰기 📃\n요즘 다들 노션으로 이력서 쓴다는데, 나도 노션으로 이력서 써볼까? 고민만 하고 계신 분들 많으시죠. 이런 분들을 위해서 위해 앉은 자리에서 처음부터 끝까지 이력서를 완성할 수 있는 핸즈온 강의를 만들었습니다. 이력서 만들기, 대체 어디서부터 어떻게 시작해야하는지 막막하다는 분들에게 도움이 되었으면 좋겠습니다. 이력서 작성, 퍼스널 브랜딩 두가지 토끼를 다 잡고 싶으신 분들께 추천합니다.\n저는 잡플래닛이라는 채용 플랫폼의 데이터 분석가로 근무했습니다. 채용 산업을 열심히 탐색하던 중 우연한 계기로 노션 이력서를 웹 서비스처럼 만들어 올리게 되었는데요. '남의 이력서, 관심이나 있겠어?'라고 생각하며 올렸던 이력서 페이지가 이제는 일 년에 8,000명 정도가 방문하는 웹사이트가 되었습니다. 구글에 '데이터 분석가 포트폴리오', '데이터 분석가 이력서'라고 검색하면 각각 첫 번째로 제 이력서 페이지를 보실 수 있어요.\n  저는 이 이력서 페이지 덕분에 이직 제안을 받기도 했었는데요. 몇 시간 투자해서 만들어놓은 노션 이력서가 저에게 좋은 기회들을 가져다주는 것을 보며, '좋은 기회를 얻기 위해서는 스스로를 잘 알리는 게 정말 중요하구나' 하고 깨닫게 되었습니다.\n많은 채용 전문가분들이 구직자분들에게 '인사담당자 입장에서 생각해보면서 이력서를 작성해라'라는 조언을 해주시는데요. 인사담당자가 되어본 적이 없는 사람이 인사담당자 입장에서 생각하기가 쉬운 일은 아니라고 생각합니다. 그래서 저는 처음 이력서를 작성하시는 분들께 이력서를 쿠팡이나 네이버 쇼핑 같은 웹서비스라고 생각해보자고 이야기해요. '인사담당자'라는 고객들이 '이력서'라는 상세 페이지를 읽고 '나'라는 상품을 구매하게끔 해야 하는 거죠. 제가 쿠팡에서 물건을 살 때 고민하는지 생각하다 보면, 이력서를 볼 때 인사담당자들이 어떤 고민을 할지, 어떤 점을 더 보강하면 좋을지가 눈에 들어오기도 합니다.\n이 강의에서는 이력서를 웹 서비스처럼 기획하고 만드는 방법에 대해 알려드릴게요. 퍼스널 브랜딩까지 한 번에 해결하는 이력서 작성. 더 이상 미루지 말고, 저와 함께 앉은 자리에서 끝내봅시다!\n수강 타겟/강의 목적 🔑\n☑️\n신입/경력으로 지원할 때 어떤 부분을\n중심으로 이력서를 작성하나요?\n☑️\n이력서에 SQL, Python 같은 툴 스킬은\n어떤 식으로 적어주는 게 효과적일까요?\n☑️\n회사마다 작성해야 할 이력서 양식이 다른데,\n데이터 분석가들에게는 어떤 양식이\n매력적으로 보이나요?\n☑️\n실무자분들이 이력서나 면접을 보실 때,\n지원자의 어떤 부분을 주로 보는지 궁금합니다.\n자율양식인 기업에 꼭 써야하는 내용이 있을까요?\n💡 이 강의만의 특징\n채용 담당자를 고객이라고 생각하며 이력서를 구성하는 방법을 알려드려요.\n퍼스널 브랜딩을 위한 이력서 활용법을 알려드려요.\n샘플 이력서를 보면서 차근차근 따라 만들다 보면 내 이력서도 어느새 완성되어 있을 거예요.\n이력서 섹션 별로 수강생분들의 이력서에 적용해볼 수 있는 팁들을 공유합니다.\n데이터 분석가 이력서가 기준이지만, 다른 직군에도 충분히 적용할 수 있는 이력서 작성법입니다.\n이런 걸 배워요 📚\n기본적인 이력서 내용 구성하는 법\n데이터 분석 프로젝트 작성하는 법\n방문자 데이터를 보고 활용하는 팁\n학습할 내용 ☑️\n1. 강의 소개\n오리엔테이션\n이력서 만들기, 냅다 시작해봅시다 (노션 + oopy)\n2. 샘플 이력서 따라서 만들기\n자기소개\nSUMMARY\nSKILLS\nWORK EXPERIENCES\nPROJECT\nBLOG\nPUBLIC SPEAKING\nCERTIFICATION / EDUCATION / LANGUAGE\n3. 이력서 공유하기\n이력서 사이트를 공유하기 전에 설정하면 좋은 것\n이력서 방문자 데이터를 확인하는 3가지 방법\n이력서는 어디에 공유하면 좋을까?\n4. 마무리\n이 내용 이력서에 넣을까요 뺄까요?\n예상 질문 Q&A 💬\nQ. 이력서를 왜 웹서비스처럼 만들어야 하나요?\n이력서를 웹서비스처럼 만들어보는 건 세 가지 장점이 있습니다.\n첫 번째, 인사담당자를 고려하며 이력서를 작성하는 데도 도움이 되고요.\n두 번째, 웹상에서 이력서 자체가 바이럴이 되면 퍼스널 브랜딩을 자연스럽게 할 수 있습니다.\n세 번째, 이력서 사이트를 통해 만들어진 데이터를 활용한 프로젝트를 해볼 수도 있어요. GA4 등의 데이터 분석 툴을 연동시켜 데이터를 보고 그 데이터를 이용해 이력서를 개선해 본다면, 데이터 활용 능력을 어필하기 위한 좋은 프로젝트가 될 수 있을 거예요. 이런 프로젝트는 데이터 분석가, 기획자, 마케터, 디자이너, PM 등 데이터 분석 능력이 필요한 직군 모두에게 추천합니다.\nQ. 이력서를 웹 사이트로 만들면, PDF로 이력서를 제출해야하는 경우엔 어떻게 하나요?\nPDF 형식의 이력서가 필요하신 경우, 강의에서 만든 노션 이력서 페이지를 PDF로 저장하여 제출할 수 있습니다. 이력서 공유하기 파트에서 관련 내용을 설명해드립니다.\nQ. 양식이 정해진 대기업 이력서에도 적용할 수 있는 내용인가요?\n본 강의는 노션으로 작성하는 자유 형식의 이력서를 함께 만들어보는 강의입니다. 정해진 양식이 있는 이력서의 경우에는 강의 내용을 바로 적용하기는 어렵습니다. 다만, 자유 형식의 이력서를 작성해본 경험이 있으신 경우 양식이 정해진 이력서에 내용을 채워넣기 좀 더 수월하실 수 있습니다.\nQ. 이력서 강의를 들으면 100% 서류 합격이 보장되나요?\n아니요. 채용 시장에서는 회사의 니즈, 지원자의 백그라운드, 프로젝트 경험, 경력 등 많은 요소가 합쳐져 서류합격의 당락이 결정됩니다. 따라서 이 강의가 수강생 여러분 개개인의 서류 합격을 보장할 수는 없습니다. 현업에서 일하고 있는 데이터 분석가 중에 이런 방식으로 이력서를 작성하고 활용하고 있는 케이스도 있다는 걸 참고하여 본인만의 이력서를 잘 작성해 보시면 좋을 것 같아요. 제가 추천해 드리는 방법은 아래와 같습니다.\n1) 우선 강의를 들으면서 이력서 초안을 처음부터 끝까지 작성해 본다.\n2) 강의에서 이야기했던 각 섹션을 구성한 의도, 주의해야 할 점 등을 다시 생각해보며, '이게 과연 내 이력서에도 최선일까?'를 고민해보고 수정해본다.\n지식공유자 소개 ✒️\n이보민\n현) 데이터리안 창업 멤버, 데이터 분석가\n전) 잡플래닛 데이터 분석가\n'데이터 분석가 포트폴리오', '데이터 분석가 이력서' 구글 검색시 상위 노출 이력서 사이트 보유(연 방문자 8,000명)\n월간 데이터리안 세미나 8월 '이력서는 서비스여야 한다' 강연\n이 내용 이력서에 넣을까요, 뺄까요? - 월간 데이터리안 2월 세미나 강연\n이력서는 서비스여야 한다 - 월간 데이터리안 8월 세미나 강연\n🔵 수강 환경 관련 안내\n본 강의는 노션과 oopy를 이용하여 이력서를 웹페이지로 만들어보는 강의입니다. oopy는 신규 계정에 한해 일주일 무료 체험이 가능하며, 월정액으로 과금이 되는 서비스입니다. 유료 서비스 추가 구매가 어려우신 분들은 미리 oopy 사용 금액을 확인해주세요. 추천인 사이트 주소로 https://datarian-portfolio.oopy.io/를 등록해주시면 첫달 구독료를 50% 할인 받으실 수 있습니다.\n지식공유자가 알려주는\n강의 수강 꿀팁!\n🎓\n이런 분들께\n추천드려요!\n이력서 작성이 막막하신 분\n노션으로 이력서 제작하는 방법이 궁금하신 분\n이력서 작성 팁이 궁금하신 분\n퍼스널 브랜딩을 위한 이력서 활용법이 궁금하신 분",
      "lectureDifficulty": "입문자"
    }
  },
  {
    "model": "lectures.lecture",
    "fields": {
      "thumbnail": "https://cdn.inflearn.com/public/courses/328971/cover/7686af10-86a1-427f-bc6b-9b2c3d2d25f8/328971-eng.png",
      "lectureTitle": "그림으로 쉽게 배우는 자료구조와 알고리즘 (기본편)\n대시보드",
      "lectureFee": 55000,
      "lectureDescription": "입문자를 위해 준비한\n[알고리즘 · 자료구조, 개발 · 프로그래밍] 강의입니다.\n이 강의를 통해 선형 자료구조와 알고리즘을 배울 수 있습니다.\n✍️\n이런 걸\n배워요!\n자료구조\n알고리즘\n개발자가 꼭 알아야 할 자료구조 & 알고리즘,\n그림으로 쉽고 재밌게 알려드려요!\n한 번 익힌 기본기가\n평생의 코드를 좌우한다구요? 🔍\n개발자의 기본기, 자료구조 & 알고리즘 📖\n기본기가 부족한 개발자가 어떤 걸 학습할지 몰라 방황하는 모습을 볼 때면 항상 안타깝다고 생각했습니다. 시간 여유도 없어 최신 기술을 따라가는 것만도 벅차 보이니 말이죠.\n물론 최신 기술도 중요하지만, 컴퓨터 과학 분야에서는 기본기가 훨씬 더 중요합니다. \n기본기만 잘 다져놓으면 화려하고 인기 있는 기술들은 언제든 손쉽게 배울 수 있거든요.\n자료구조와 알고리즘은 특정 언어나 프레임워크에 국한된 것이 아닙니다. \n유행하는 언어와 프레임워크가 달라지더라도 여러분이 배우는 자료구조 & 알고리즘 관련 지식은 그대로 가져가서 적용할 수 있습니다.\n길잡이가 필요한 개발자 \n누구나 OK 🚩\n대학생\n학교 수업에서 배우는 \n자료구조/알고리즘이 \n너무 어렵고 딱딱해요. \n쉽게 익힐 순 없나요? \n비전공자\n전공자들은 새로운 언어, \n프레임워크에도 \n적응을 잘 하던데... \n그 비결이 궁금해요! \n취업 준비생\n코딩테스트 문제를 보면 \n벽이 느껴지고 막막해요. \n뭔가 배워야 할 것 같은데 \n그게 대체 뭐죠? \n효율왕\n내가 짠 코드의 \n성능을 분석하고, \n더 효율적이고 성능 좋은 \n코드로 바꾸고 싶어요. \n개발을 시작한 지 얼마 안 된 분들께서 흔히 이런 말씀을 하시곤 합니다. \n“종종 어떤 문제를 해결할 때 망망대해에 떠있는 기분이 듭니다.”\n“그때그때 머리에 떠오르는 생각을 코드로 작성해서 어떻게든 해결하긴 하는데… 효율적인 코드라고 장담은 못하겠습니다.”\n“다른 사람 코드랑 비교해봐도 어떤 코드가 더 효율적인 코드인지 판단도 잘 못하겠습니다.”\n“뭔가 체계적인 방식이 있을 것 같은데 어떻게 하면 좋을지 막막합니다.”\n머리에 떠오르는 생각을 바로 코드로 옮기는 건 자연스러운 일입니다.\n자료구조와 알고리즘을 배우기 전까지는요!\n자료구조와 알고리즘을 배우게 된다면?\n어떤 문제가 있을 때 해당 문제에서 어떤 자료구조가 가장 효율적인지,\n그에 맞는 알고리즘은 어떤 것이 있는지 고민하게 됩니다.\n우리가 손쉽게 접하는 대부분의 문제는 이미 알려진 자료구조와 알고리즘으로 해결할 수 있습니다. 만약 없다고 하더라도 우리가 알고 있는 자료구조와 알고리즘을 기반으로 응용하면 금방 해결 가능하죠.\n평소 길잡이가 필요하다고 느끼셨던 분들이라면, 자료구조와 알고리즘이 그 역할을 충분히 해줄 수 있을 거라 자신합니다.\n학습 내용을 \n확인해보세요 📚\n✅ 비전공자부터 취준생까지 모든 분이 쉽게 이해할 수 있도록 그림으로 설명합니다.\n✅ 개념 설명과 구현까지 다루기 때문에 자료구조와 알고리즘이 어떻게 동작하는지 자세히 알 수 있습니다.\n✅ 구현할 때 헷갈릴 수 있는 상황에선 그림으로 코드가 어떻게 동작하는지 설명합니다.\n✅ 그림으로 재밌게 설명하지만 마냥 가볍게만 다루지 않습니다.\n1️⃣ 자료구조와 알고리즘 준비하기!\n자료구조와 알고리즘이 무엇인지 알아보고, 자료구조와 알고리즘을 본격적으로 학습하기 전에 필요한 지식과 환경을 준비합니다.\n2️⃣ 자료구조 알아보기!\n본격적으로 자료구조에 대해서 알아봅니다. 이 강의는 기본편인 만큼 상대적으로 간단한 구조인 선형 자료구조에 대해서 알아보고 직접 구현해 봅니다.\n3️⃣ 알고리즘 알아보기!\n재귀 알고리즘과 선형 자료구조의 종류 중 하나인 연결리스트(Linked List)를 정렬하는 알고리즘을 알아보고 구현해 봅니다. 그리고 재귀 알고리즘의 단점을 해결할 수 있는 다이나믹 프로그래밍에 대해서 알아봅니다.\n자주 묻는 질문 💬\nQ. 어떤 언어로 진행하나요?\n자바스크립트로 진행합니다. 하지만 다른 언어로도 충분히 따라올 수 있도록 자바스크립트 고유의 문법을 사용하지 않고 예시 코드를 작성합니다.\nQ. 비전공자도 들을 수 있는 강의인가요?\n비전공자를 위해 만든 강의입니다. 강의만 따라오신다면 충분히 자료구조와 알고리즘을 익히실 수 있습니다!\nQ. 강의 자료가 있나요?\n강의 자료는 없습니다.\n다른 강의 함께 보기 📺\n그림으로 쉽게 배우는 운영체제\n운영체제\n(80)\n₩77,000\n마인크래프트로 프로그래밍 입문하기\n블록코딩\n₩19,800\n지식공유자가 알려주는\n강의 수강 꿀팁!\n🎓\n이런 분들께\n추천드려요!\n프로그래밍 언어를 배우고 뭘 해야 할지 모르겠는 분\n코딩 테스트를 준비하려는 분\n기본기를 튼튼하게 하고 싶으신 분\n📚\n선수 지식,\n필요한가요?\n1개 이상의 프로그래밍 언어",
      "lectureDifficulty": "입문자"
    }
  },
  {
    "model": "lectures.lecture",
    "fields": {
      "thumbnail": "https://cdn.inflearn.com/public/courses/328924/cover/c659807d-764a-4d14-bbf0-fc1fa0fb8e77/328924-eng.png",
      "lectureTitle": "핸즈온 리액트 네이티브\n대시보드",
      "lectureFee": 77000,
      "lectureDescription": "초급자를 위해 준비한\n[모바일 앱 개발, React Native] 강의입니다.\n리액트 네이티브를 처음 접하는 입문자를 위한 강의입니다. 처음부터 프로젝트를 진행하면서, 각 상황에서 필요한 내용을 학습하는 방법으로 진행합니다. 이를 통해 리액트 네이티브의 기초를 익히고, 리액트 네이티브를 이용할 때 필요한 내용과 프로젝트를 진행하면서 사용하게 되는 다양한 라이브러리를 사용해봅니다.\n✍️\n이런 걸\n배워요!\n리액트 네이티브\n리액트 (Components, Hooks, Context API)\n리액트 내비게이션(React Navigation)\n파이어베이스(Authentication, Firestore, Storage)\n따끈따끈, 신규 IT 도서 저자의 직강!\n만들면서 배우는 리액트 앱 개발 ⚒️\n수많은 기업의 선택, 리액트 네이티브 ✔️\n리액트 네이티브는 2015년 3월 메타(구 페이스북)에 의해 공개된 오픈소스 프로젝트로, 사용자 인터페이스를 만드는 리액트에 기반을 두고 제작되었습니다. \n과거에는 모바일 앱을 만들려면 Swift나 Kotlin같이 플랫폼 개발을 위한 언어를 따로 공부해야 했지만, 리액트 네이티브를 이용하면 자바스크립트를 이용해서 iOS, Android 앱을 개발할 수 있습니다. 리액트 네이티브 쇼케이스(React Native Showcase)를 보면 코인베이스(Coinbase), 우버이츠(Uber Eats), 디스코드(Discord), 테슬라(Tesla), 월마트(Walmart) 등 많은 기업에서 리액트 네이티브를 사용하고 있다는 것을 확인할 수 있습니다. \n이 강의에서는 폭넓게 쓰이는 리액트 네이티브의 기초를 다룹니다. 세 가지 앱을 직접 만들면서 리액트 네이티브의 이론을 익힐 수 있어요.\n프로젝트로 이론까지 정복 ✨ \n사람에 따라 취향이 다르듯, 무엇인가를 학습하는 방법은 다양하고 선호도도 다릅니다. 하지만 한 가지 공통적인 부분이 있습니다. 이론을 먼저 공부하든, 일단 몸으로 부딫히든 결국 무엇인가를 해봐야 합니다.\n이 강의에서는 프로젝트를 진행하면서 이론을 공부합니다. 프로젝트 진행 과정에서 우리가 만들고 싶은 모습이나 기능을 위해서 필요한 것이 생길 때 필요한 내용을 공부하는 방법으로 리액트 네이티브를 학습합니다. 그 과정에서 다음과 같은 내용을 익히고 사용하게 됩니다.\n리액트 네이티브 사용에\n필요한 리액트 지식\n(Component, props와 state, Hooks, Context API)\n프로젝트 진행에 필수!\n내비게이션 기능 활용법\n(Native Stack Navigator, Bottom Tab Navigator)\n백엔드 지식이 적어도 OK!\nFirebase 기본 사용법\n(Authentication, Storage, Firestore)\n내 손으로 만드는 프로젝트 📱\n강의에서는 계산기, 투두 리스트(ToDo List), 여행 사진 공유 앱 3개의 프로젝트를 진행하며 리액트 내비게이션을 공부합니다.\n프로젝트 코드는 깃허브에서 확인할 수 있습니다. 깃허브의 코드는 참고용으로, 코드가 잘 동작하지 않을 때 어떤 부분에 차이가 있는지 확인하는 용도로 사용해 보세요. 혹은, 변경된 내용이 많아 헷갈릴 때 확인 용도로 사용하는 것도 좋은 방법입니다.\n\n1) 계산기\n2) 투두리스트\n   3) 여행 사진 공유 앱\n선수지식이 필요해요 🤓\n1️⃣ 자바스크립트\n이 강의는 자바스크립트 기초를 익힌 분들을 대상으로 제작되었습니다. 자바스크립트를 아직 잘 모르는 분이라면 강의 내용이 어렵게 느껴질 수 있습니다. 자바스크립트 공부가 필요한 분들은 아래 링크에서 '파트 1. 코어 자바스크립트' 내용을 공부하시는 것을 추천합니다. \n모던 자바스크립트 튜토리얼 : https://ko.javascript.info/\n2️⃣ 리액트\n리액트 네이티브는 리액트에 기반을 두고 제작되었습니다. 그렇기 때문에 리액트를 익힌 분들은 조금 더 빠르고 편하게 리액트 네이티브를 익힐 수 있습니다. 하지만, 리액트 선행 학습이 필수는 아닙니다.\n강의에서 리액트 네이티브에 필요한 리액트 설명을 진행합니다. 단, 자세한 내용은 다루지 않기 때문에 리액트에 대해 공부하고 싶거나 자세한 내용이 궁금한 분들은 리액트 학습을 따로 진행하셔야 합니다. \n💬 예상 질문 Q&A \nQ. 왜 Expo를 사용하나요? \n처음 리액트 네이티브를 공부한다면 Expo를 이용하는 것을 추천합니다.\nExpo를 사용하면 핸드폰을 이용해서 개발 및 테스트가 가능하고 환경 설정도 훨씬 쉽습니다. 그뿐만 아니라 윈도우 노트북 사용자도 아이폰을 이용해서 iOS 개발 및 테스트가 가능하다는 장점이 있습니다.\n네이티브 모듈을 사용할 수 없다는 것과 몇몇 라이브러리를 사용할 수 없다는 단점이 있지만, 번거로운 부분을 신경 쓰지 않고 리액트 네이티브에 입문하고 공부하는 데 집중할 수 있다는 장점이 있습니다.\n먼저 Expo로 리액트 네이티브를 익히고, 필요에 따라 CLI를 사용해보세요. \nQ. 선행 학습이 필요한가요?\n앞에서 말씀드린 대로, 자바스크립트 기초 선행 학습은 필수입니다. 자바스크립트를 모르는 상태로 강의를 수강하면 이해할 수 없는 말만 하는 강의로 느껴질 수 있고, 코드를 보고 따라 치는 것 이상도 이하도 아니게 됩니다.\n리액트는 강의에서 설명을 진행하므로 필수가 아닙니다. 다만, 리액트 네이티브를 공부하기 위해 필요한 내용만 진행하므로 리액트에 대한 학습을 원하거나 더 자세한 내용이 궁금한 분들은 리액트에 대한 별도 학습을 진행하시기 바랍니다. \nQ. 강의 수강을 위한 준비물이 필요한가요?\n컴퓨터가 필요합니다. 그 외에 필요한 기기는 필수가 아닙니다. 가능하다면 iOS, Android 기기를 하나씩 준비하면 좋지만, 구매까지 하면서 준비할 필요는 없습니다. 현재 여러분이 사용하는 기기를 이용해서 테스트를 진행하세요. 그다음 강의를 모두 다 듣고, 추가로 필요하다고 판단되면 그때 구매하시면 됩니다.\n테스트할 수 있는 기기가 없다고 하더라도, 가상 기기를 이용해서 개발 및 테스트가 가능하니 너무 걱정하지 마세요. 단, 윈도우 사용자는 iOS 기기가 없다면 iOS 테스트가 불가능합니다.\n모르는 게 생겼나요? 💌\n말도 안 되는 질문, 잘못된 질문은 없습니다. 모르니까 강의를 듣는 것이고, 안되니까 질문하는 것이죠. 처음부터 잘하는 사람은 없습니다. 잘 안되는 부분이 있거나, 궁금한 부분이 있다면 질문을 남겨주세요.\n1️⃣ 검색을 통해 스스로 해결해 보세요\n에러 메시지 혹은 문제가 되는 상황을 구글에서 검색해서 해결 방법을 찾아보세요. 스스로 해결하는 연습은 실력 향상에 많은 도움을 줍니다. 해결 방법을 찾지 못할 수도 있지만, 스스로 해결하려고 노력해보세요. 특히, 오타로 인해 발생하는 문제가 많으니, 차분하게 오타를 확인해보세요. \n2️⃣ 깃허브에 코드를 올리고 질문에 링크를 남겨주세요\n질문에 에러 메시지만 올리면 정확한 원인을 확인하기 어렵습니다. 특정 코드만 복붙해서 올려도, 해당 코드 부분만으로 확인이 어렵거나, 원인이 해당 코드에 없을 수 있습니다. \n그래서 깃허브에 여러분이 작성한 코드를 올리고, 링크를 남겨주셔야 정확한 확인이 가능합니다. 추가로, 문제가 생기는 상황을 자세하게 알려주면 조금 더 정확한 확인이 가능하니 자세하게 질문을 작성해 주세요. \n3️⃣ 범위를 벗어난 질문에 대해서는 답변하지 않습니다\n강의를 벗어난 질문엔 답변하지 않고 있습니다. 예를 들어, 개인적으로 진행하는 프로젝트, 강의와 다르게 진행하는 프로젝트와 같은 질문에는 답변하지 않고 있습니다. 강의에서 작성한 자바스크립트 코드나 로직에 대한 질문에는 답변하지만, 기본적으로 자바스크립트 강의가 아니기 때문에 범위를 벗어난 질문에 대해서는 답변하지 않습니다. 이 부분 양해 부탁드립니다. \n📘 핸즈온 리액트 네이티브\n본 강의는 2022년 10월 출판 예정인 집필서 '핸즈온 리액트 네이티브(한빛미디어)'를 바탕으로 진행되는 강의입니다. \n강의 내용과 책의 내용이 거의 같으니, 강의 수강을 위해 책을 구매할 필요는 없습니다. \n지식공유자가 알려주는\n강의 수강 꿀팁!\n🎓\n이런 분들께\n추천드려요!\n리액트 네이티브에 관심이 있는 분들\n리액트 네이티브를 처음 시작하는 분들\n모바일 앱을 만들어 보고 싶은 분들\n자바스크립트로 웹이 아닌 다른 걸 해보고 싶은 분들\n📚\n선수 지식,\n필요한가요?\nJavaScript 기초",
      "lectureDifficulty": "초급자"
    }
  },
  {
    "model": "lectures.lecture",
    "fields": {
      "thumbnail": "https://cdn.inflearn.com/public/courses/328742/cover/e1dfb69f-15e7-4ee9-8118-65b400f622f4/328742-eng-resize.png",
      "lectureTitle": "네트워크, 그림으로 이해하자\n대시보드",
      "lectureFee": 74800,
      "lectureDescription": "입문자를 위해 준비한\n[네트워크] 강의입니다.\n네트워크, 그림으로 쉽게 이해할 수 있습니다. '그림'과 '애니메이션'으로 여러분의 시간을 절약하세요!\n✍️\n이런 걸\n배워요!\n네트워크\nOSI 7계층\n주요 프로토콜\n모든 개발자의 기본기, 네트워크! \n쉽고 친절하게 알려드릴게요 👍\nIT 이론은 왜 이렇게 어려울까요? 🤔\nIT 분야를 처음 접하는 분들이라면 얼마 가지 않아 언어적 장벽을 맞닥뜨리게 됩니다. 용어 자체가 거의 영어를 기반으로 한 약어기 때문에 이해한다기보다는 외워야 하죠. 전공 서적을 봐도, 유튜브 강의를 찾아봐도 그림이 모두 추상적이고 이해하는 데 많은 시간이 걸립니다. 과목의 특성상 ‘흐름의 구조’를 알아야 이해가 되는데, 그 구조를 이해하기 어려우셨을지도 모릅니다. \n대학생도, 직장인도, 비전공자도 \n어렵게만 느껴지는 네트워크…\n\"교수님 수업을 듣는데 무슨 소리를 하시는지 모르겠어요. 전공 교재도 이해하기 너무 추상적이고 어려워요.\"\n- 컴공 대학생 새내기 -\n\"취직 전 네트워크 기본 지식을 잘 알아뒀어야 했는데 후회해요. 아직 네트워크를 부분적으로만 아는 느낌이고, 다시 배우고 싶지만 회사 일 때문에 시간도 넉넉치 않아요.\"\n- 주니어 개발자 -\n\"네트워크를 처음 접하고 용어가 생소해서 놀랐어요. 개발 공부는 재밌는데 알아야 할 내용이 너무 많네요.\"\n- 비전공자 출신 개발자 취준생 -\n특히 네트워크는 웹 개발 및 엔지니어링, 보안 관리 등 IT 분야에서 필수적인 기초 지식이지만 전공생 분들도, 이미 재직하고 계신 분들도 네트워크에 대한 그림이 아직 그려지지 않으실 수 있습니다. \n알쏭달쏭 네트워크,  \n그림으로 쉽게 배워보세요! \n어렵고도 추상적인 네트워크 개념을 그림, 애니메이션, 스토리, 약어 설명을 통해 쉽게 배울 수 있도록 구성했습니다. 서적을 이용하면 어렵고 오래 걸릴 내용을 짧은 시간에 쉽게 이해하실 수 있게끔 강의를 만들어보았습니다. 함께 도전해보세요!\n네트워크 초보자를 위해 \n꼼꼼하게 준비했어요. \n막연하게 부분적으로만 알고 있던 네트워크 지식의 전체적인 그림을 그려볼 수 있게끔 강의를 구성했습니다.\n그림으로 풀어서 설명합니다\n최대한 그림을 통해 알기 쉽게 이해하실 수 있게끔 준비했습니다. 영상 편집, 교안 디자인, 글씨체, 그림 디자인 등등 강의를 수강하신 분들이 '쉽게' 내용을 이해하실 수 있도록 힘썼습니다.\n교안을 제공합니다 \n강의를 시청하시면서 편리하게 메모하며 공부하고, 수강 후에도 편하게 복습하실 수 있도록 모든 단원별 수업에 대한 전체 교안 PDF 파일을 제공해드립니다.\n배운 내용을 정리할 수 있도록 \n각 수업 영상별로 '정리' 파트가 마련되어 있습니다. 수업 마지막 즈음 학습 효과를 높이기 위해 주요 포인트와 핵심 내용을 다시 한 번 정리하여 언급합니다. \n동작 원리를 눈으로 익히세요 \n네트워크 동작 과정과 원리를 애니메이션으로 구성했습니다. 오랜 시간 서적을 읽어가며 이해할 필요 없이 훨씬 쉽고 직관적으로 내용을 이해할 수 있게 도와드립니다.\n상세 커리큘럼 📚\n💡 네트워크의 전반적인 이해, OSI 7계층, 각 계층 간 주요 프로토콜들에 대해서 배웁니다.\n네트워크 개요\n본격적으로 각 계층의 동작을 배우기에 앞서 OSI 모델의 각 계층을 간략하게 설명하고, 필수 용어들을 정리합니다. \n물리 계층\nOSI 7계층 중 최하위계층인 물리 계층의 역할과 관련 내용 및 물리 계층과 관련 있는 네트워크 기기 장치인 허브와 리피터에 대하여 배웁니다. 또한, 주요 프로토콜 이더넷에 관하여 배웁니다.\n데이터링크 계층\nOSI 7계층 중 하위 2번째 계층인 데이터링크 계층의 역할에 관하여 배웁니다. 데이터링크 계층과 관련 있는 네트워크 기기 장치인 스위치(스위칭 허브)에 대해서도 다룹니다.\n네트워크 계층\nOSI 7계층 중 하위 3번째 계층인 네트워크 계층의 역할에 관하여 배웁니다. 네트워크 계층과 관련 있는 네트워크 기기 장치인 라우터와 라우팅 동작에 대하여 배웁니다. 또한 주요 프로토콜 IP에 관하여 배웁니다.\n전송 계층\nOSI 7계층 중 하위 4번째 계층인 전송 계층의 역할에 관하여 배웁니다. 전송 계층의 주요 프로토콜인 TCP와 TCP의 각종 제어 및 동작과 UDP에 대하여 배웁니다.\n응용 계층\nOSI 7계층 중 상위 계층(표현, 세션, 응용) 응용 계층의 역할에 관하여 배웁니다. 응용 계층의 주요 프로토콜을 배웁니다. \n무선 LAN\n무선 랜에 관하여 간략하게 배웁니다.\n이 강의를 만든 \n예술하는 개발자입니다 👩‍💻\n복잡하고 어려운 네트워크에 대해 쉽게 이해하려면 어떻게 해야 할까요? 저도 그런 문제로 고민을 많이 했던 사람으로서 이번 강의를 제작하게 되었습니다. 오래 전부터 ‘네트워크를 그림으로 쉽게 알려주는 사람이 있으면 참 좋겠다’라고 생각을 했었는데, ‘내가 그런 강의를 제작해보는 사람이 되어보자’라는 마음으로 이번 강의를 시작했습니다.\n'네트워크, 그림으로 이해하자' 시리즈 외에도 IT관련 컨텐츠와 강의의 소식들은 유튜브 채널에서 보실 수 있습니다. '그림으로' 시리즈 강의는 계속 준비 중에 있으니 소식을 듣고 싶으신 분들은 많이 구독해주시면 감사하겠습니다.\nQ&A 💬\nQ. 강의 자료가 제공되나요?\n강의 교안이 제공됩니다. 교안은 강의 내용을 바탕으로, PDF 형식으로 모든 단원에서 제공됩니다. \n강의 제목대로 '그림'이 중요한 만큼 교안 제작에 힘썼습니다.\nQ. 비전공자도 들을 수 있는 강의인가요?\n네, 네트워크에 관심 있는 비전공자분들도 어렵지 않게 들으실 수 있습니다. 어려운 내용들을 최대한 그림으로 풀어 해설하고, 반복 학습을 통해 쉽게 들으실 수 있도록 준비했습니다.\nQ. 이 강의를 수강하면 어떤 장점이 있나요?\n네트워크를 부분적으로 이해하는 것을 넘어 전체적인 그림과 구조를 통해 쉽게 이해하실 수 있습니다.\n지식공유자가 알려주는\n강의 수강 꿀팁!\n🎓\n이런 분들께\n추천드려요!\n네트워크의 기초적인 개념과 큰 그림을 그려보고 싶은 분\n네트워크를 알고 있지만 군데군데 기본 지식에 구멍이 나 있으신 분\n각 계층과 프로토콜이 어떤 매커니즘으로 동작하는지 모르시는 분\n어려운 전공 수업과 전공 서적으로 고통받으시는 대학생\n그림으로 정말 쉽게 네트워크를 이해하고 싶으신 분들",
      "lectureDifficulty": "입문자"
    }
  },
  {
    "model": "lectures.lecture",
    "fields": {
      "thumbnail": "https://cdn.inflearn.com/public/courses/328644/cover/4afb5f07-cd68-453b-9641-efdb42628d2b/328644-eng.png",
      "lectureTitle": "데이터 분석 SQL Fundamentals\n대시보드",
      "lectureFee": 55000,
      "lectureDescription": "초급자를 위해 준비한\n[데이터 분석, 데이터베이스] 강의입니다.\nSQL의 핵심 요소에 대한 상세한 강의와 실습을 통해, 여러분이 SQL 분석 전문가로 성장할 수 있도록 흔들리지 않는 뼈대를 만들어 드리겠습니다.\n✍️\n이런 걸\n배워요!\n다양한 유형의 조인(Join)과 조인 동작 메커니즘\nGroup by와 집계(Aggregation) 함수 이해 및 데이터 집합 레벨의 변형\nDate, Timestamp, Interval을 자유롭게 다루기\n다양한 유형의 Analytic SQL과 활용법\nAnalytic SQL 실무 적용 시 유의 해야 할 다양한 팁\n서브쿼리의 이해와 다양한 활용\nSQL 분석 전문가로 되기 위한 첫걸음! 💪\n상세한 강의와 실습으로 기본기를 다져보세요.\n데이터에 접근하는 \n가장 기본 기술, SQL.\n대부분의 기업 데이터는 RDBMS에 저장되어 있고, SQL은 데이터에 접근하는 가장 기본 기술입니다. 때문에 기업 데이터 분석의 핵심은 SQL을 활용하는 것에서부터 시작합니다.\n하지만 SQL을 기업 데이터 분석에 자유자재로 활용할 수 있는 수준을 갖춘 데이터 분석가를 찾기는 어렵습니다. SQL을 배울 때 문법과 기능적인 측면에서만 접근하게 되면, 실전에서 조금만 어려운 데이터 가공과 집합 레벨의 변경 등이 포함된 분석 요건을 만나게 될 때 좌절하게 됩니다.\n분석 SQL,\n제대로 하고 싶다면?\n분석 SQL을 잘하기 위해서는 원본 데이터를 원하는 집합의 레벨로 자유자재로 가공하고 만들어 낼 수 있는 능력을 갖춰야 합니다. 이를 위해서 다양한 유형의 조인 및 Group by와 집계 함수, 그리고 Analytic SQL이 동작하는 메커니즘을 이해하면서 SQL을 작성하는 능력을 키워야 합니다. 그리고 반드시 많은 실습을 통해 이를 체득할 수 있어야 합니다. \n데이터 분석 SQL Fundamentals 강의는 ✅\n데이터 분석 SQL Fundamentals는 여러분을 SQL 분석 전문가로 성장시켜드리기 위한 시리즈 강의의 Part 1입니다. 본 강의에서는 JOIN과 Group by, 집계함수, Analytic SQL의 핵심 내용과 매커니즘을 상세한 강의와 실습으로 체득할 수 있도록 구성되어 있습니다.\n후속 시리즈: 다양한 사례로 익히는 SQL 데이터 분석\n다양한 사례로 익히는 SQL 데이터 분석\nSQL\nPostgreSQL\nDBMS/RDBMS\n퍼포먼스 마케팅\n(14)\n₩88,000\nPart 2 강의인 '다양한 사례로 익히는 SQL 데이터 분석'에서는 다양한 유형의 매출 분석, 주문 분석 뿐만 아니라 구글 Analytics 유형의 데이터 세트를 기반으로 웹사이트 접속 및 사용 분석과 웹사이트 퍼포먼스 분석을 SQL로 수행해 봅니다. 세션과 DAU/WAU/MAU, Device별/광고 채널별 트래픽 소스 분석, Landing 페이지 분석, 이탈율과 탈출율 집계, RFM 분석, 잔존율(Retention Rate)과 퍼널 분석 등 풍성한 분석 주제로 여러분을 찾아뵙겠습니다. \n실전 분석을 위한 핵심 무기, \nAnalytic SQL!\nWindow Function이라고도 불리는 Analytic SQL은 편리하고 유연한 분석 활용성과 고급 통계 기능등으로 SQL이 기업 데이터 분석의 중심으로 자리잡는데 큰 역할을 하였습니다. 본 강의에서는 실전에서 자주 사용되는 거의 대부분의 Analytic SQL을 설명드립니다. \n특히 Analytic SQL을 보다 쉽게 이해시켜드리기 위해 다양한 시각자료를 준비하였습니다. 또한 적용시 유의사항 및 여러 가지 유형의 실습 SQL을 통해 Analytic SQL을 마스터할 수 있도록 도와드릴 것입니다. \n이 강의의 특징 ✨\n핵심 SQL 동작 매커니즘에 대한 풍부한 설명\n다양한 유형의 조인이 어떻게 동작하는지, Group by와 Analytic SQL이 동작 메커니즘은 어떻게 되는지 풍부한 설명 자료로 자세히 설명드립니다. \n핵심 이해 + 심화 내용이 결합된 다양한 실습 문제\n주요 SQL 실습은 라이브 코딩으로 구성하였고, 핵심을 이해하면서도 심화된 내용을 배울 수 있게 다양한 실습 문제를 준비하였습니다. \nAnalytic SQL - 이보다 상세하게 설명할 수 없다\nAnalytic SQL의 주요 구성 요소인 Partition, Sort, Window가 어떻게 동작하는지를 상세한 시각자료로 설명합니다. 또한 Analytic SQL 시 간과하기 쉬운 오류 및 해결 방법을 알려드립니다.\n보너스! 100페이지 분량의 강의 교재 제공\n혼자서도 무리없이 내용을 충분히 이해할 수 있도록 100페이지 분량의 강의 교재와 실습용 SQL 코드 및 데이터셋을 함께 제공합니다. \n실습 환경을 \n확인해보세요 💻\n실습 환경 DBMS로는 PostgreSQL을, SQL Editor는 DBeaver를 사용합니다. \nPostgreSQL은 오픈소스 DBMS로 무료로 제공되며, 안정성과 성능, 그리고 무엇보다도 풍부한 SQL 지원 기능을 가지고 있습니다. Ansi SQL 규격을 만족시키면서도 다양한 SQL 함수 그리고 Analytic에 대한 기능을 갖추고 있어서 온라인 뿐만 아니라 분석용 DBMS로도 많이 활용되고 있습니다. \nDBeaver 커뮤니티 버전은 무료이지만 웬만한 상용 SQL Editor보다 뛰어난 기능과 빠른 성능 그리고 안정성을 가지고 있습니다. DBeaver는 PostgreSQL뿐만 아니라 MySQL, Oracle 등 다양한 DBMS를 지원합니다. \n📢 강의 자료 다운로드 안내\n강의 교재(PDF), 실습용 SQL 코드 및 데이터는 섹션 0: 강의 소개와 실습 환경 구성의 [강의 교재 및 실습 코드 다운로드] 수업에서 다운로드 받으실 수 있습니다.\nQ&A 💡\nQ. SQL을 전혀 모르는 사람도 수강이 가능한가요?\nSQL에 대해 짤막한 기본 지식이 있는 분을 위한 강의입니다. Select나 where절, Order by정도는 알고 계시다는 전제로 강의를 진행하기 때문에 조인부터 강의가 시작됩니다. 만약 SQL에 대해서 처음이시라면 유튜브나 인프런에서 1~2 시간 내외의 길지 않은 SQL 기초 입문 강의를 들으실 것을 권장드립니다. 강의 소개 영상의 5분쯤에서 사전 수강 지식에 대해서 좀 더 상세히 설명드리고 있습니다. \nQ. 이후에 출시되는 \"다양한 사례로 익히는 SQL 데이터 분석\" 강의를 듣기 위해서는 이 강의를 먼저 들어야 하나요?\n아쉽게도, 이후에 출시할 다양한 사례로 익히는 SQL 데이터 분석 강의는 본 강의에서 설명드리는 내용을 어느정도 알고 계시다는 전제하에서 강의를 진행합니다. 다양한 사례로 익히는 SQL 데이터 분석 강의 수강을 위한 선수 지식은 해당 강의 커리큘럼 섹션 0의 강의 소개와 데이터 분석 SQL Fundamentals 미 수강자를 위한 강의 선택 가이드를 미리 보시고, 강의 선택 시 참조 부탁드립니다.  \n지식공유자로부터 온 편지 💌\n데이터 분석 영역에서 어떻게 하면 데이터 분석 능력과 SQL 활용 능력을 동시에 향상시킬 수 있을까? 오랫동안 고민해 왔습니다(그래서 머리가 너무 빠지는 불상사가....).\n이 두 마리 토끼를 다 잡기 위해서 여러가지 유형의 실전 데이터 분석 지표, 현업에서 원하는 다양한 분석 요구사항을 SQL로 구현하면서 실력을 항상시키는 강의를 두 개의 시리즈 강의로 출시할 예정입니다. \n그 첫 번째로, 이번에 출시하는 '데이터 분석 SQL Fundamentals' 강의는 SQL을 구성하는 기본 메커니즘에 대한 상세한 설명과 다양한 실습을 통해 여러분의 SQL 역량을 탄탄히 다질 수 있도록 구성하였습니다.\n특히, 데이터 분석을 위한 SQL 핵심 무기인 Analytic SQL에 대해서 A부터 Z까지 자세하게 설명드리기에 여러분이 어느 자리에서건 Analytic SQL에 대한 단단한 자신감을 가지실 수 있을 것입니다.  \n본 강의가 여러분의 SQL 실력을 일취월장할 수 있는 소중한 시간이 될 수 있도록 강의를 만들었습니다. 질문은 언제나 환영이고 강의에서 뵐 수 있으면 좋겠습니다.\n그럼, 저는 곧 이어서 출시되는 '다양한 사례로 익히는 SQL 데이터 분석' 강의를 마무리하러 휘리릭 사라지겠습니다. \n감사합니다. \n지식공유자가 알려주는\n강의 수강 꿀팁!\n🎓\n이런 분들께\n추천드려요!\nSQL 활용 능력을 높이고자 하시는 분\n분석 SQL의 탄탄한 역량을 쌓기 원하시는 분\nSQL을 활용하는 데이터 사이언티스트 및 데이터 분석가\nSQL 기반에서 데이터 가공/추출/정제를 수행하여 분석 또는 마트용 테이블을 생성해야 하는 데이터 엔지니어\nSQL 기본 문법은 배웠으나 여전히 분석 업무에 SQL 적용이 어려우신 분\n📚\n선수 지식,\n필요한가요?\n입문 과정의 SQL 문법(Select, Where절 등)",
      "lectureDifficulty": "초급자"
    }
  },
  {
    "model": "lectures.lecture",
    "fields": {
      "thumbnail": "https://cdn.inflearn.com/public/courses/328616/cover/746106c5-b98e-4791-99c0-6cc9bc140ada/328616-eng.jpg",
      "lectureTitle": "[LV1] 왕초보 이펙트 (VFX) 기초부터 튼튼하게! (UE5, Blender)\n대시보드",
      "lectureFee": 176000,
      "lectureDescription": "입문자를 위해 준비한\n[게임 아트 · 그래픽, VFX] 강의입니다.\nUE5(Unreal Engine 5)로 진행하는 이펙트 강의. 그림을 못 그려도, 엔진을 다뤄본 적 없어도 가능합니다. 이제 현업에서는 필수인 '나이아가라'로 가장 중요하고 기본적인 이펙트를 만들어봅시다.\n✍️\n이런 걸\n배워요!\n언리얼로 이펙트 제작하는 방법\n이펙트 텍스쳐 그리는 방법\n언리얼에서 이펙트 제작에 필요한 가장 핵심적인 기능을 다루는 방법\n탄탄한 기초를 기반으로 다른 것도 응용해볼 수 있는 이펙트 기초\n나이아가라로 이펙트 제작하는 방법\n영화부터 게임까지 ✨\n화면에 생기를 불어넣는 VFX의 세계! \n게임 화면의 70%를 \n좌우하는 이펙트! \n영화에서의 이펙트 (<Thor>)\n게임에서의 이펙트 (<League of Legends>)\n👉 실제 게임 회사에서 사용하는 \n가장 기본적이면서도 핵심적인 이펙트를 \n스스로 제작해 봅니다. \n‘이펙트’는 사람들에게 많이 알려지지 않았습니다. \n그러다 보니 배우기 쉽지 않은 분야입니다.\n하지만 이펙트는 게임 화면에서 70% 이상을 차지할 정도로 중요한 직업입니다. \n상상하는 대로 만들고 자신만의 개성을 자유롭게 표현할 수 있는 이펙트의 재미를 많은 분들께 알려드리고 싶습니다.\n이번 LV1. 왕초보 이펙트(VFX) 강의에서는 가장 기본적인 이펙트를 처음부터 함께 제작해보며, 이펙트 제작에 필요한 다양한 툴부터 최신 언리얼 엔진 5를 다루는 법까지 학습해 봅니다. \n한국에서도 기발하고 멋진 이펙트를 제작하는 분들이 많아지기를 바랍니다 😊\n아무것도 몰라도 OK, \n전부 다 알려드릴게요.\n이펙트(VFX)를 \n만드는 방법을 \n배워보고 싶은 분 \n기초부터 탄탄하게 \n이펙트를 만드는 방법을 \n알고 싶은 분 \n포토샵, 블렌더 등 \n그래픽 툴에 대해 \n아무것도 모르는 분 \n이펙트 수업을 \n배워보고 싶지만 \n학원비가 부담됐던 분 \n최신 언리얼 엔진 5로 \n이펙트를 제작해보고 \n싶은 분 \nUE5 나이아가라를 \n처음부터 배워보고 \n싶은 분 \n개발 중인 게임에 넣을 \n가장 핵심적인 이펙트를 \n배우고 싶은 분 \n게임 회사에 \n이펙터로 취업하고 \n싶은 분 \n기본기를 생각한 강의\n언리얼 엔진(Unreal Engine)이 처음이어도, 3D 툴을 전혀 다룰 줄 몰라도, 포토샵을 전혀 다루지 못해도 괜찮습니다. 하나부터 끝까지 전부 다 알려드립니다.\n수강 후에도 여러 가지 이펙트를 응용해서 제작해볼 수 있도록 이펙트 제작의 근본적인 내용을 가르쳐드리겠습니다.\n실무에 딱 맞는 최신 기술\n현재 언리얼 엔진에서 개발 중단된 캐스캐이드 기능을 쓰지 않습니다. 그 대신 앞으로 현업에서 필수적으로 쓰일 ‘나이아가라(Niagara)’ 기능을 활용하였으며, 최종적으로는 취업까지 가능한 이펙트 실력을 갖추는 것을 목표로 합니다.\n학습 커리큘럼 📚\nLV1 : 포토샵, 블렌더, 언리얼 엔진을 배우는 이펙트 왕기초 현재 강의\nLV2 : lv1에서 만든 이펙트를 응용해서 포트폴리오 수준의 이펙트 만드는 방법 (10월 중순 오픈 예정)\nLV3 A : 블루프린트를 활용하는 다양한 게임 캐릭터 스킬 만들기\nLV3 B : 블루프린트를 활용하는 캐릭터 게임 캐릭터 스킬 이펙트 붙이기\nLV.1 강의 내용 미리보기 📺\nCasting, Slash 등 게임에 쓰이는 기초적인 이펙트를 따라 만들어 봅니다.\n복잡한 개념도 쉽게 이해할 수 있도록 원리와 기능을 풀어서 설명합니다.\n💡 학습 전 준비 사항\n타블렛이 없어도 수강 가능합니다.\n학습 전 Blender, Unreal Engine 5, Photoshop을 설치해 주세요.\nQ&A를 확인해보세요! 💬\nQ. VFX에 대해 아예 모르는데 들을 수 있나요?\n가능합니다! 이펙트에 대해 아예 모르는 분들을 위해 제작한 강의로, A부터 Z까지 처음부터 쭉 알려드리겠습니다. 혹시 강의를 진행하다가 설명이 빠진 부분이 있다면 [커뮤니티]에 질문을 남겨주세요!\nQ. 강의를 듣고 나면 어느 정도 수준을 갖추게 되나요?\n아주 기초적인 수준의 이펙트 기반 기술을 갖추게 됩니다. 가장 기본적인 강의인 만큼 이펙트의 기초를 단단히 하는 데에 집중하여 커리큘럼을 구성했습니다.\nQ. VFX를 배우면 어떤 일을 할 수 있나요?\n게임 회사에서 이펙트를 제작하는 디자이너로 진출할 수 있습니다. 그밖에 영화, 애니메이션 등 VFX 산업 전반에서 관련 업무를 할 수 있습니다.\nQ. 유니티에서도 응용할 수 있을까요?\n유니티(Unity)도 언리얼 엔진과 크게 다르지 않습니다. 전체적인 프로세스를 이해하면 언리얼 엔진에서와 마찬가지로 멋진 이펙트를 제작할 수 있습니다. 다만, 유니티 이펙트를 배우기 위해 언리얼 엔진 이펙트를 배우는 것은 잘못된 접근 방법입니다. 어디까지나 VFX 제작의 전반적인 프로세스를 이해한다는 마음으로 학습하시면 도움이 될 것입니다 🙂\nQ. 다른 그래픽 툴이 많던데, 그런 툴도 다 알아야 하지 않나요?\n다룰 수 있는 그래픽 툴이 많으면 많을 수록 물론 좋습니다. 하지만, 겉핥기로 그냥 해볼 수만 있는 것과 제대로 응용할 수 있는 것과는 천지 차이입니다. 여러 툴을 이것저것 찍먹하는 것보다, 하나를 제대로 잘 하는 게 취업에 훨씬 유리합니다.\nQ. 강의를 듣기 전 준비해야 할 것이 있나요?\n포토샵, 블렌더, 언리얼5 엔진을 다운받아 주세요.\nQ. 저는 이펙트를 좀 만들어 봤어요. 제가 만든 이펙트에 대해 조언을 들을 수 있을까요?\n[멘토링]을 신청해보아요! 저와 함께 1:1 또는 다 대 다로 피드백을 받을 수 있습니다. \n(멘토링 신청 바로가기)\n현직 메이저 게임사 VFX 디자이너의 노하우를 담았습니다 😊 \n안녕하세요, 현재 대기업 게임사에서 VFX 디자이너로 일하고 있는 원띵입니다.\n평소 이펙트 제작에 관심있었지만 어떻게 시작해야 할지 막막했던 분, 학원비가 부담스러워 선뜻 배우지 못했던 분들을 위해 이번 강의를 제작했습니다. 실제 게임 속 멋진 이펙트를 만드는 날까지 여러분을 응원합니다! \n지식공유자가 알려주는\n강의 수강 꿀팁!\n🎓\n이런 분들께\n추천드려요!\n이펙트를 처음 접하는 사람\n언리얼을 아예 모르는 사람\n이펙트가 뭔지 궁금한 사람\n이펙트의 처음 기초부터 탄탄하게 다지고 싶은 사람\n게임에 넣을 간단한 이펙트를 만들어보고 싶은 사람\n이펙트에 대해 아무것도 모르는 사람",
      "lectureDifficulty": "입문자"
    }
  },
  {
    "model": "lectures.lecture",
    "fields": {
      "thumbnail": "https://cdn.inflearn.com/public/courses/328422/cover/15d00dc5-096f-4093-b1c1-5320cac7fe29/328422-eng-resize.png",
      "lectureTitle": "도메인 주도 설계(DDD) 기반 마이크로서비스(MSA) 모델링\n대시보드",
      "lectureFee": 99000,
      "lectureDescription": "중급자를 위해 준비한\n[백엔드, 웹 개발] 강의입니다.\n마이크로서비스 설계를 위한 도메인 주도 설계(Domain Driven Design)를 쉽게 설명하고, 실제로 활용하기 위한 구체적인 실천 방법을 소개합니다.\n✍️\n이런 걸\n배워요!\n도메인 주도 설계(DDD)\n헥사고널 아키텍처\n전략적 설계\n전술적 설계\n이벤트 스토밍\n레이어드 아키텍처\n도메인 모델링\nAPI 설계\nMSA\nDDD의 핵심, 확실하게 배우고 싶다면! \n마이크로서비스 설계 \n더 유연하게, 더 강력하게.\n앗, 혹시 내 얘기 아닌가요?\n😥\nMSA의 대략적인 개념을 이해하긴 했는데, 막상 어떻게 마이크로서비스로 쪼개고 설계해야 할지 막막하고 어렵기만 해요. \n🙄\n마이크로서비스는 공개적인 REST API만 있으면 되는 거 아닌가요? 다른 어떤 설계가 필요한가요? \n😵\n비동기 이벤트 통신이 많이 쓰이는 것 같던데... 어떤 비즈니스 케이스에 활용하나요? 동기/비동기 통신을 어떻게 구분해서 설계하나요? \nMSA 구조에서 마이크로서비스를 독립적으로 배포하고 변경하려면 무엇이 중요할까요? 바로 기능적으로 응집성 있고 다른 서비스와 의존관계가 적은 마이크로서비스를 식별하게 하는 것입니다. 또한 마이크로서비스 내부 구조 역시 기술 변화에 유연한 구조를 가지게 함으로써 비즈니스 변화에 민첩하게 대응하게끔 해야 합니다.\n이러한 목적으로 마이크로서비스 설계에 도메인 주도 설계(DDD) 기법이, 그리고 내부 아키텍처에 헥사고널 아키텍처가 주로 사용되고 있습니다. 이번 강의에서는 이러한 도메인 주도 설계 및 헥사고널 아키텍처를 기반으로 응집성 있고 유연한 구조를 갖는 마이크로서비스를 설계하는 방법을 설명합니다.\n마이크로서비스 설계에서 가장 핫한 기법 2가지 🌳\n도메인 주도 설계 \n(Domain-Driven Design, DDD) \n비즈니스 전략, 도메인 패턴을 중심으로 소프트웨어 아키텍처를 구축하는 개발 방법론 \n헥사고날 아키텍처 \n(Hexagonal Architecture) \n도메인 중심으로 의존성의 흐름이 외부로 나가지 않도록 관리하는 아키텍처 패턴 \n이 강의만의 \n특징을 확인하세요 📗\n실무자의 경험에 기반한 생생한 현장을 날것 그대로 담은 목소리로 강의합니다. 😁\n마이크로서비스의 이상을 지향하되, 현실을 반영한 접근 방안을 제시합니다.\n본 강의는 개념과 온라인 도구를 통한 실습으로 구성됩니다. \n실제 마이크로서비스 설계에 활용되는 따끈한 현장의 기준, 판단(?) 기법들을 소개합니다.\n그래서, 이런 분들께 도움이 됩니다! 🏃‍♀️\n마이크로서비스 설계에 \n이벤트스토밍을 활용하고픈 \n기술/설계 리더 \n마이크로서비스 설계 기준 및 \n방법에 대해 고민 중인 \n마이크로서비스 개발자 \n도메인 주도 설계(DDD) 및 \n구현에 관심있는 \n백엔드 개발자 \n이론에서 시작해서 \n실습으로 알아가는 \n마이크로서비스 설계 💻\n도메인 주도 설계의 개념 이해\n도메인 주도 설계 - 전략적 설계의 여러 개념(도메인 모델, 서브도메인, 유비쿼터스 랭귀지, 바운디드 컨텍스트)에 대해 알아봅니다.\n가장 실용적인 마이크로서비스 도출 기법: 이벤트 스토밍\n가장 쉽게 심플한 마이크로서비스 도출 기법인 이벤트 스토밍 워크샵에 대해 설명합니다.\n다양한 마이크로서비스 비즈니스 로직 구현 패턴 소개\n마이크로서비스 내부의 비지니스 로직을 설계하는 여러 패턴(트랜잭션 스크립트, 액티브 레코드, 도메인 모델 등)을 설명하고 어떤 선택을 해야 하는지 탐구합니다.\n마이크로서비스 내부 구조 정의를 위한 다양한 내부 아키텍처 패턴 이해\n전통적인 레이어드 아키텍처(Layered Architecture)의 한계와 헥사고널, 클린 아키텍처의 특징, 비교를 통해 바람직한 마이크로서비스 내부 구조에 대해 생각해 봅니다.\n이벤트 스토밍 워크샵 실습\n도서대여 시스템이란 주제를 가지고 온라인 도구 Miro를 통해 이벤트 스토밍 워크샵 실습을 해봅니다.\n컨텍스트 매핑도 작성 실습\n이벤트 스토밍을 통해 식별된 바운디드 컨텍스트의 관계를 정의하고 후보 마이크로서비스를 정의합니다.\n도메인 모델링 실습\n도메인 주도 설계의 전술적 설계 도구를 활용하여  마이크로서비스의 심장 도메인 모델을 설계 해 봅니다.\n그래서, 이런 걸 할 수 있게 됩니다! 😎\n도메인 주도 설계의 전략적 설계/전술적 설계의 개념을 이해할 수 있고 어떻게 마이크로서비스 설계에 활용할지 알게 됩니다.\n이벤트 스토밍을 통해 업무을 분석하고 마이크로서비스 도출에 활용할 수 있습니다.\n개별 마이크로서비스의 비즈니스 로직 구현 패턴 및 내부 아키텍처 스타일에 대한 기준을 정의할 수 있습니다.\n도메인 주도 설계 - 전술적 설계 기법을 적용하여 마이크로서비스 내 도메인 모델을 설계할 수 있습니다. \n이 강의의 \n지식공유자는 💁‍♂️\n23년차 개발자, 한정헌\n현 SK C&C 소프트웨어 엔지니어\n다수의 대규모 차세대 프로젝트 개발방법론 및 설계방법 리딩\n명지대 · 서울과학기술대 SW과목 강의, 한국정보기술연구원(KITRI), LG전자 MSA과정 강의\n멀티캠퍼스, 한국표준협회, 한국품질협회 MSA 과정 멘토링\n전문 분야: 개발 방법론, 소프트웨어 아키텍처/설계/개발 기법\n위키북스 “도메인 주도 설계로 시작하는 마이크로서비스 개발” 저 (2022)\n국가평생교육진흥원 K-MOOC “Microservice 설계 및 구현” 강좌\n“Microservice 설계 및 구현” 강의 개발\n“도메인 주도 설계로 시작하는 마이크로서비스 개발” 출간\nQ&A 💬\nQ. 강의에서 이론과 실습을 모두 해보나요?\n본 강의의 초반부에서는 이론을, 후반부에서는 실습을 다룹니다. 대략적인 개념을 이해해본 다음 실습을 통해 어떻게 기술들이 쓰이는지 이해할 수 있도록 구성하였습니다.\nQ. 실무 경험이 없는 취준생 또는 비전공자도 들을 수 있나요?\n클라우드 경험이 없더라도 실제 레거시 경험이 있는 개발자라면 접근할 수 있는 수준입니다. 그러나 실무 경험이 없다면 용어 등에 어려움을 겪을 수는 있습니다. 다만 비전공자라도 부트캠프를 이수한 경험이 있다면 무난하게 수강할 수 있을 것 같습니다.\nQ. 수업 내용을 어느 수준까지 다루나요?\n본 강의는 도메인 주도 설계를 위한 마이크로서비스의 전반적인 이론을 배우고, 실제 업무 예제를 통해 마이크로서비스를 도출하며 그 내부를 설계해 봅니다. 구현은 별도 과정으로 준비하고 있습니다.\n함께 보면 좋은 강의 📺\n실무에서 전하는 따끈한 마이크로서비스 아키텍처(MSA) 이야기\nMSA\n아키텍처\n(26)\n₩99,000\n지식공유자가 알려주는\n강의 수강 꿀팁!\n🎓\n이런 분들께\n추천드려요!\n백엔드 개발자\n마이크로서비스 개발자\n아름다운 설계를 추구하는 개발자\n설계에 관심있는 개발자\n📚\n선수 지식,\n필요한가요?\n마이크로서비스 기본개념\n객체지향에 대한 이해\nUML",
      "lectureDifficulty": "중급자"
    }
  },
  {
    "model": "lectures.lecture",
    "fields": {
      "thumbnail": "https://cdn.inflearn.com/public/courses/328189/cover/ba68a3f9-1c62-4d70-a4d9-9e3436ae4ee0/328189-eng.png",
      "lectureTitle": "일잘하는 마케터, MD에게 꼭 필요한 파이썬 데이터 분석\n대시보드",
      "lectureFee": 44000,
      "lectureDescription": "입문자를 위해 준비한\n[데이터 분석, 마케팅] 강의입니다.\n마케팅, MD 부서는 주로 돈을 쓰는 부서이기에 돈을 어떻게 쓸지 '잘' 소명하는 것이 중요합니다. 불필요한 내용은 걷어내고, 실무에 꼭 필요한 기능만 넣었습니다. 데이터에 기반하여 완벽한 기획안을 낼 수 있도록 도움드리겠습니다.\n✍️\n이런 걸\n배워요!\n파이썬\n데이터분석\n제품 특성(강점/약점) 분석\n크롤링 자동화\n데이터로 소통하는 MD, 마케터\n= 최고 능력자 🥰\n마케터/MD의 파이썬 데이터 분석🤖\n마케팅, MD와 같은 영업 부서는 돈을 써야하기 때문에 돈을 어떻게 쓸지 잘 소명하는 것이 중요합니다.\n단순한 숫자 놀이에서 끝나는 것이 아니라, 데이터에 근거하여 완벽한 기획안을 내고, 제품 방향성을 분석할 수 있도록 도움을 드리겠습니다.\n✨이 강의의 장점\n이해하기 쉬우면서 업무에 즉시 적용이 가능한 핵심 내용을 담았습니다. \n프로그래밍 언어의 설치 없이 브라우저에서 바로 코드 작성이 가능한 Google Colab으로 진행합니다. 따라서 gmail 계정은 필수입니다.\n코드를 모두 오픈소스 형태로 제공하기 때문에 이해되지 않았더라도 적용이 가능합니다.\n이런 분들께 추천해요 🙋‍♀️\n파알못\n파이썬 지식은 전무하지만 배워보고 싶은 분 (시각화, 분석, 데이터 예측 등)\n자동화 러버\n대량 데이터(인기 검색어 등) 크롤링을 통한 업무 자동화/고도화를 원하는 분\n분석 꿈나무\n자사 상품의 SWOT 분석을 해보고 싶으신분 (리뷰 기반 강/약점 분석)\n역량 UP\n파이썬 학습을 통해 개인 역량을 강화하여 자사 매출에 기여하고 싶은 분 \n강의는 1.25배속으로 들으시는 걸 추천드려요.\n이 강의를 들은 후에 당신은 📜\n\n1) 크롤링 자동화를 통해 반복적인 웹사이트 관련 업무를 자동화할 수 있습니다. ( 섹션8 ) \n  2) 자연어 처리를 통한 제품 강/약점 분석을 할 수 있습니다. \n\n3) 네이버 리뷰, 평점정보 - 제품 매출 間 상관관계 분석이 가능합니다. \n\n\n4) 네이버 리뷰 및 평점 정보 크롤링을 할 수 있습니다. (다른 사이트도 가능)\n네이버 리뷰 및 평점 정보 크롤링\n카테고리 별 인기 검색어 크롤링\n\n5) 요인분석을 통한 알아보는 미래 매출 예측이 가능합니다.\n\n6) 매출에 영향을 많이 미친 요인이 어떤 것이었는지 데이터 기반의 분석이 가능합니다. \n학습 내용 📚\n2022.04.25(추가)섹션7. 크롤링데이터 DB 저장하기\n2022.11.14(추가)섹션8. 크롤링 & 웹 자동화 (인기검색순위 실시간 저장) - 상세 내용은 섹션 8. 무료강의 내용 참고 부탁드립니다. \n섹션 0. Overview \n섹션 1. 사전지식 설명 : 필요한 세팅환경 및 HTML 기본지식에 대한 설명 \n섹션 2. 네이버 쇼핑에서 원하는 정보 크롤링하기 \n섹션 3. 크롤링 데이터 기반 분석 고도화 \n섹션 4. 데이터 시각화 : 데이터 시각화 하는 라이브러리 사용에 대한 설명 \n섹션 5. 데이터 예측 : prophet을 활용한 매출 예측 및 상품 매출 특성 분석 \n예상 질문 Q&A 💬\nQ. 비전공자도 들을 수 있는 강의인가요? \n비전공자를 위한 강의입니다. 누구나 이해하기 쉽고 따라할 수 있는 것에 초점을 맞추었습니다. \nQ. 강의를 듣기 전 준비해 야할 것이 있나요? \n컴퓨터와 Gmail 계정이 반드시 있어야 합니다. Google에서 제공하는 파이썬 솔루션인 Colab으로 진행합니다. \nQ. 수업 내용을 어느 수준까지 다루나요? \n실전 사용에 초점을 맞춰서 강의가 진행됩니다. 모든 소스코드의 이론적 의미에 대해 깊게 파고들지 않고, 간단한 설명으로 넘어갑니다.\n기능적으로 구현하는 것에 많이 초점을 맞추었습니다. 따라서 이해되지 않는 부분이 당연히 발생할 것입니다. 하지만 이해되지 않았더라도 강의 목표 달성에 지장이 전혀 없습니다. \n지식공유자 소개 ✒️\n이력 사항\n(前)삼성전자 S.LSI 사업부\n(前)롯데백화점 전산팀 백엔드 개발자\n(前)eBay 주문결제 백엔드 개발자 \n(現)국내 e-commerce 대기업 개발자\nFrip 비전공자 대상 강의 진행 이력 多\n지식공유자가 알려주는\n강의 수강 꿀팁!\n🎓\n이런 분들께\n추천드려요!\n마케터\n브랜드매니저\nMD\n파이썬으로 데이터 분석 및 시각화를 해보고 싶으신분\n📚\n선수 지식,\n필요한가요?\n기본적인 엑셀사용",
      "lectureDifficulty": "입문자"
    }
  },
  {
    "model": "lectures.lecture",
    "fields": {
      "thumbnail": "https://cdn.inflearn.com/public/courses/327839/cover/94dacdb8-a662-47ef-8b46-184920ba0844/%E1%84%8A%E1%85%A5%E1%86%B7%E1%84%82%E1%85%A6%E1%84%8B%E1%85%B5%E1%86%AF.png",
      "lectureTitle": "three.js로 시작하는 3D 인터랙티브 웹\n대시보드",
      "lectureFee": 165000,
      "lectureDescription": "초급자를 위해 준비한\n[웹 개발, 웹 퍼블리싱] 강의입니다.\n웹에서 3D를 구현할 수 있는 자바스크립트 라이브러리, three.js의 핵심 개념들을 익히고 응용 예제까지 만들어 보면서 3D 웹 개발에 대한 감을 익혀봅니다.\n✍️\n이런 걸\n배워요!\nWebGL 라이브러리 three.js를 이용한 3D 웹 구현\n바닐라 자바스크립트를 활용한 3D 인터랙티브 웹 개발\nthree.js로 웹에서 구현 가능한\n3D 웹 어플리케이션 만들자! 🤳\n인기 드라마에 나오는 징검다리 게임을 직접 만들어봅니다.\n물리엔진으로 사실적인 움직임을 만들어봅니다.\n점 (point)의 좌표를 활용해 파티클 효과를 만들어봅니다.\n스크롤에 따라 반응하는 3D 비주얼이\n적용된 페이지를 만들어봅니다.\n2022.07 추가 콘텐츠 업데이트\n3D 공간에서 캐릭터가 자유롭게 움직이는 동작을 구현해 봅니다.\nthree.js로 시작하는\n3D 인터랙티브 웹 ✨\n우리나라에는 three.js로 작업한 웹사이트가 많이 없었지만, 최근 들어 메타버스나 VR, AR 등이 급부상하면서 3D 콘텐츠에 대한 수요가 늘고 있습니다. 그에 비해 입문자가 쉽게 공부할 수 있는 자료들이 많이 부족하다고 느껴져서 강의를 기획하게 되었습니다. \n웹 브라우저에서 3차원 컴퓨터 그래픽스 애니메이션 응용을\n만들고 표현하기 위해 사용되는 JS 라이브러리\n\n섹션별 학습내용 미리 엿보기 📚\n섹션 0 three.js가 무엇인지와 기본적인 사용 방법을 알아봅니다. 웹팩 사용법도 함께 익혀요!\n섹션 1 기본 요소들에 대한 전반적인 내용을 살펴보며, 3D 장면을 구성할 수 있게 됩니다.\n섹션 2 three.js 개발을 더 편리하게 도와주는 도구들을 알아봅니다.\n섹션 3 위치 이동, 크기 조정, 회전 등 변환 (transform)에 대해 알아봅니다.\n섹션 4 모양을 나타내는 geometry를 알아봅니다.\n섹션 5 간단한 카메라 컨트롤 활용만으로도 다양한 기능의 카메라 액션을 사용할 수 있어요.\n섹션 6 재질을 나타내는 여러가지 material에 대해 알아봅니다.\n섹션 7 여러가지 조명과 빛의 형태를 알아봅니다.\n섹션 8 클릭을 감지하는 방법을 알아봅니다.\n섹션 9~13 배운 내용들을 활용하여 실용적인 예제를 다양하게 만들어봅니다.\n\n이런 분들이 들으면 좋아요 🙌\n눈에 띄는 3D 웹사이트를\n만들고 싶은 개발자/디자이너\n메타버스/VR 등의 웹에서\n3D를 구현하고 싶은 분\n다른 개발자들과는 차별화된\n무기를 갖고 싶은 개발자\n\n한땀 한땀 같이 코딩해요 👨‍💻\n블렌더를 이용해서 직접 3D 캐릭터를 만들어요.\n만든 3D 캐릭터에 애니메이션을 적용해봐요.\n이 강의만의 특징은 무엇인가요?\n다양한 예제를 통해 이해하고 응용하여 나만의 작업물을 만들어 가는 강의\n직접 같이 한땀 한땀 코딩하면서 익히고 실력을 쌓을 수 있는 강의\n눈에 띄는 개발자가 될 수 있는 3D 개념을 익히는 강의\n단순 3D뿐 아니라, 모델링 소프트웨어인 블렌더까지 다루는 강의!\n  예상 질문에 답해드려요 🙏\n\nQ. 초보자도 들을 수 있는 강의인가요?\n자바스크립트 기초를 아시는 분이라면 가능합니다. 자바스크립트 수업은 아니지만, 중간중간 등장하는 자바스크립트 개념들도 설명드리니 크게 어려움은 없을거예요.\nQ. 수업 내용을 어느 정도의 수준까지 다루나요?\n자세한 내용은 커리큘럼을 보시면 되는데요, 징검다리 건너기 게임이 가장 난이도가 높은 최종 예제라고 보시면 됩니다. 그 정도의 3D 웹 애플리케이션을 만들기 위해 필요한 내용들을 공부한다고 생각해주세요.\nQ. 수업에서 공부한 내용 정도면, 제가 원하는 형태의 3D 웹 구현이 가능할까요?\n만드시려는 웹사이트의 형태에 따라 다르겠지만, 커리큘럼에 three.js의 핵심적인 내용들이 포함되어 있으므로 분명 배우기 전과는 완전히 다른 작업물을 만드실 수 있을 거예요.\nQ. 강의를 듣고나면 어느 정도의 성장을 이룰 수 있을까요?\n완강하신 후, 여러분은 3D 웹페이지를 개발할 수 있게 됩니다. 3D는 그 자체로 특별해서 직접 구현할 수 있다면 취업 시장에서도 눈에 띄는 개발자가 될 수 있어요. 3D 웹을 구현할 수 있다는 것, 그런 포트폴리오를 갖고 있다는 것 자체가 개발자/디자이너로서 강력한 무기가 될거예요.\n\n지식공유자 소개 ✒️\n제 입으로 이런 말 하기 쑥스럽지만...800개가 넘는 수강평 ⭐평균 5점 만점 강사랍니다😅\n안녕하세요! 제주에서 스튜디오밀이라는 회사를 운영하고 있는 디자이너이자 개발자, 콘텐츠 크리에이터 1분코딩입니다. 제 스튜디오밀 웹사이트 또한 three.js를 이용해 만들었어요!\n이 강의는 간단한 작업물만 만들고 끝나는게 아니라, 실제 동작하는 예제들을 만들어 봄으로써 three.js를 제대로 활용할 수 있어요. 뿐만 아니라 3D 모델링 소프트웨어인 블렌더로 원하는 형태를 모델링 하는 방법까지 커리큘럼에 포함하고 있어서, 내가 원하는 결과물을 만들 수 있습니다.\n  연관 로드맵 🚎\n\"Oh!\" 감탄사가 나오는 역동적인 인터랙티브 웹사이트를 만들어요.\n1분코딩님의 인터랙티브 웹 사이트를 만들어보는\n강의들로 구성된 로드맵입니다.이 강의 포함\n지식공유자가 알려주는\n강의 수강 꿀팁!\n🎓\n이런 분들께\n추천드려요!\n3D 웹사이트를 만들고 싶은 분\n눈에 띄는 포트폴리오 웹사이트를 만들고 싶은 분\n웹에서 동작하는 3D 콘텐츠를 만들어야 하는 분\n📚\n선수 지식,\n필요한가요?\n자바스크립트 기초",
      "lectureDifficulty": "초급자"
    }
  },
  {
    "model": "lectures.lecture",
    "fields": {
      "thumbnail": "https://cdn.inflearn.com/public/courses/327685/cover/47478ddc-2f64-4752-9690-20d9e6ba284d/327685-eng.jpg",
      "lectureTitle": "C++20 훑어보기\n대시보드",
      "lectureFee": 33000,
      "lectureDescription": "초급자를 위해 준비한\n[프로그래밍 언어, 게임 개발] 강의입니다.\nC++20에 새로 추가된 핵심 문법들이 장기적으로 게임에서 어떻게 응용될 수 있을지 고민을 해보면서 차근차근 알아봅니다.\n✍️\n이런 걸\n배워요!\nC++20 최신 문법\nC++에 대한 이해도\n바야흐로 C++의 대격변!\n모던 C++20 핵심 문법을 꽉 잡아보세요.\n모던 C++이 \n한 번 더 탈바꿈했다?! 😯\nC++20 4대천왕, 알고 계신가요?\nC++20에 추가된 신규 문법 및 기능 학습!\nC++20에는 Concept, Module, Range, Coroutine을 비롯한 큰 변화가 있었습니다.\n안 그래도 복잡한 C++에 또 대격변이 일어났다니 벌써부터 머리가 아프지만,\n이번에 추가된 사항들은 주로 C++에 없어서 아쉬웠던 부분들이 대거 포함되었습니다.\n이에 본 강의에서는 C++20 핵심 문법을 간략하게 훑어보면서,\n기존의 C++ 코드에서 어떤 부분을 개선할 수 있을지 고민을 해봅니다.\n다음 내용을\n학습합니다 ✅\n이런 분들은 주목해주세요!\n게임 프로그래머 \n취업 준비생 \nC++ 신규 문법에 관심이 많은 \nC++ 프로그래머 \n모던 C++11 이상을 \n학습한 분들 \nC++20에 추가된 내용들을 간략하게 훑어보면서,\n이를 게임에서 어떤 상황에 응용할 수 있을지 고민해봅니다.\n강의에서 직접 확인해보세요!\nNC, Krafton 출신 \n게임 개발자의\n노하우를 전해드립니다 💎\nRookiss\n주요 경력\n前 크래프톤 테라(TERA) 서버팀\n前 엔씨소프트 블레이드 앤 소울 2(Blade&Soul2) 컨텐츠 프로그래밍팀\n인프런 게임 개발 강의 누적 수강생 28,000+\n학력\nCondorcet Prépa MPSI 수료 (프랑스)\n칭화대학교 소프트웨어공학 학사 (중국)\n고려대학교 정보보호대학원 석사 (한국)\n평균 별점 5점 만점에 4.9!\nC#과 유니티로 만드는\nMMORPG 게임 개발 시리즈 (클릭)\nC++과 언리얼로 만드는\nMMORPG 게임 개발 시리즈 (클릭)\n자주 묻는 질문을 \n확인해보세요 💬\nQ. 취업할 때 C++20이 꼭 필요한가요?\n그렇지는 않습니다. 하지만 게임회사 면접에서 나오는 단골 질문 중 하나가 [모던 C++에 대한 내용을 최근에 학습한게 있는지]이기 때문에, 미리 준비해서 공부한 내용을 어필한다면 좋은 인상을 남길 수 있습니다.\nQ. C++14, C++17은 몰라도 학습이 가능할까요?\nC++11까지만 알면 대부분의 내용을 원활하게 이해할 수 있습니다.\n지식공유자가 알려주는\n강의 수강 꿀팁!\n🎓\n이런 분들께\n추천드려요!\nC++20을 간략하게 훑어보고 싶은 사람\nC++ 최신 문법에 관심이 많은 사람\n📚\n선수 지식,\n필요한가요?\n기본적인 C++ 지식 (모던 C++11 이상)",
      "lectureDifficulty": "초급자"
    }
  },
  {
    "model": "lectures.lecture",
    "fields": {
      "thumbnail": "https://cdn.inflearn.com/public/courses/327148/cover/f14566b3-1845-48ee-af5f-86555dd273a4/327148-eng.png",
      "lectureTitle": "UIKit - iOS14 실무 가이드 <iOS앱 진짜 개발자 되기>\n대시보드",
      "lectureFee": 88000,
      "lectureDescription": "입문자를 위해 준비한\n[모바일 앱 개발] 강의입니다.\nUIKit - iOS14 실무 앱 가이드 입문자를 위한 기초부터 탄탄한 설명을 준비했습니다. 경력자들도 놓치기 쉬운 개념들을 확실하게 잡아드립니다. 실무에서 만들어지는 앱을 확실하게 배울 수 있도록 정성스럽게 준비했습니다.\n✍️\n이런 걸\n배워요!\niOS14 기반의 실무 앱을 만들 수 있어요\nswift언어의 개념을 확실히 잡을 수 있어요\n당신이 iOS 개발자가 되어야 할 4가지 이유\n\n\niOS 개발을 반드시 알아야 할 이유는 크게 4가지입니다.\niOS 개발자 수요가 많습니다.\n수많은 회사에서 모바일 서비스, 특히 iOS 앱 개발을 준비 또는 이미 서비스하고 있습니다. 이러한 앱을 유지하거나 신규로 구축하기 위해 많은 iOS개발자를 필요로 합니다. 이를 위해 업계 평균 이상의 급여를 기꺼이 제공하려는 수 많은 기업들이 여러분들을 기다리고 있습니다.\niOS 개발자로서 금전적 수익을 기대할 수 있습니다.\n지금도 전 세계에서 수많은 개발자들이 자신의 아이디어를 앱스토어에 내놓으며 수익을 실현하고 있습니다. 그 기술은 제가 알려드리겠습니다. 아이디어만 준비하세요.\niOS 개발을 위한 뛰어난 개발 툴을 제공합니다.\nApple에서는 IDE(통합개발환경)을 제공하여 개발에 필요한 코드작성 레이아웃 구성을 바로 시작할 수 있다는 장점이 있습니다. 뿐만 아니라 빌드, 테스트, 배포까지 한 번에 처리할 수 있는 강력한 기능까지 제공하고 있죠,\nSwift 언어, 정말 배우기 쉽습니다\niOS개발의 가장 큰 장점 중 하나는 Swift언어를 쉽게 배울 수 있다는 것입니다. 2014년에 도입된 차세대 애플의 차세대 언어인 Swift는 개발자가 빠르고 최적화하기 쉽도록 많은 기능을 제공해주고 코딩을 처음 접하는 사람도 쉽게 시작할 수 있도록 해줍니다.\n\nSwift 기본 문법부터,\n실전 앱 개발 프로세스까지.\niOS 개발의 처음과 끝. 이 강의에서! \niOS 14에 맞춘 최신 강의!\n우리의 목표는 iOS 앱 개발에 필요한\n기초부터 실전 스킬까지\n모두 익히는 것입니다.\n이 강의는 코드를 보고 따라만 하는 강의가 아닙니다. iOS 개발을 배우고 싶은 여러분을 위해, 최신 버전에 맞춰 실무 앱 개발 방법에 대해 준비한 강의입니다. 또한 실제 앱 개발에 필요한 요소를 담은 다양한 예제를 준비하여 실무에서 만들어지는 앱의 개념을 이해하고 상용 앱을 만들 수 있는 수준으로 만들어 드릴 예정입니다.\n이런 분들이 들으면 좋아요.\niOS 개발 꿈나무\nSwift 언어의 개념을 잡고, 앱까지 개발하고 싶은 분\niOS 개발 경력자\n경력은 있지만 탄탄한 기초를 잡고 싶은 분\n기타\n개발을 처음 접하는 분들\n이 강의를 들은 후 당신의 모습 🎁\n아이폰의 설정 메뉴를 구현해 보는 것부터 포토 갤러리, 영화 검색 앱, To-do 앱 등 다양한 형태의 앱을 직접 만들어볼 수 있을 거에요.\n이 강의를 들은 후 당신은,\n기초부터 탄탄히 다져나갈 수 있는 Swift 언어의 핵심을 습득할 수 있습니다.\n실무 예제를 통해 앱을 스스로 완성할 수 있는 실력이 만들어집니다.\n기업에 취업이나 이직 시 필요로 하는 역량을 가질 수 있습니다.\n아이폰 Setting Clone\nMovie app 구현\nPhoto Galley App\nTo-do app\n본 강의에서 배우는 내용 📚\nSwift문법 이해\n문법을 이해하는 것을 넘어 어떻게 활용할 수 있는지 알려드립니다.\nPass Data\n데이터를 넘겨주고 받는 상황은 앱의 가장 기본적이면서도 어려움이 따르는 개념입니다. 이 예제에서는 데이터를 전달하는 개념을 확실히 이해하여 어떤 상황에서도 데이터 흐름을 자연스럽게 처리할 수 있는 지식을 배울 수 있습니다. \nSetting App Clone\n아이폰의 설정을 그대로 복제해서 만들기 위해 필요한 테이블뷰 지식을 습득할 수 있습니다.\nMovieApp\n실제 네트워크를 통한 json데이터를 받아 모델을 만들어 화면에서 처리하는 개념, 이미지, 동영상 처리에 대한 기본을 이해할 수 있습니다.\nOnBoardingView\n페이지뷰 컨트롤러를 학습해 여러 페이지 개념을 이해하여 화면에 자연스럽게 나타낼 수 있는 개념을 배울 수 있습니다.\nTo-do List\n로컬DB를 다루는 CoreData를 통해 CRUD, 즉 조회, 생성, 수정, 삭제를 하는 데이터 개념을 이해할 수 있는 To-do 앱을 만들어 데이터를 저장하는 개념을 배울 수 있습니다.\nPhoto Gallery\n포토갤러리에 접근해서 데이터를 가져오는 방법과 데이터 처리와 흐름에 대한 개념을 익힐 수 있습니다.\nPanGesture\n제스쳐 중에 많은 이해를 필요로 하는 직접 움직일 수 있게 해주는 PanGesture를 학습하여 어떤 상황에서도 자연스럽게 사용할 수 있는 제스쳐의 개념을 익힐 수 있습니다.\n이미지 리소스 링크\nhttps://bit.ly/3hww7Fx\n지식공유자 소개\niOS Developer\n10년차 iOS 개발자\n누적 온라인 수강생 1,400명 이상\nSwift UI - iOS14 퍼펙트 가이드 강의 진행 (인프런)\niOS AutoLayout 완벽 가이드 강의 진행 (인프런)\n온, 오프라인 강의 수백 회 이상\n자주 묻는 질문 💬\nQ. 이 강의를 선택해야 할 이유가 있나요?\niOS 개발 강의와 관련된 강의는 많지만, 기초부터 실무 앱 개발 노하우까지 알려주는 강의는 이 강의가 유일하다고 자부합니다. 제가 기존에 올린 강의들의 평가를 보시면 '너무 도움이 됐다' 는 생생한 후기가 자주 올라옵니다. 이는 이 강의를 만들 때 절대 대충 만들지 않았다는 것을 증명하는 것이죠. 또한 단순 기능 나열만 하는 복사 붙여넣기 식의 강의가 아닌 진짜 개발자가 가져야 할 지식을 가질 수 있도록 준비한 강의입니다.\nQ. 처음 시작하는 사람도 수강이 가능한가요?\n제가 가장 신경쓰며 만든 부분이 시작하는 분들이 헤매지 않도록 친절하고, 상세하게 최선을 다해 내용을 담는 것입니다. 저를 믿고 진행하신다면 확실한 iOS개발자의 기본기를 다질 수 있습니다.\nQ. 최신 버전에 맞춘 강의인가요?\nSwift 5, Xcode 12에 맞춰 만들어졌으며, 강의를 준비하는 시점의 최신 환경에 맞춰 강의를 준비했습니다.\n지식공유자가 알려주는\n강의 수강 꿀팁!\n🎓\n이런 분들께\n추천드려요!\n실무 앱은 어떻게 만들어지는 배울 수 있어요.\n프로그래밍을 처음 접하는 사람도 할 수 있어요.",
      "lectureDifficulty": "입문자"
    }
  },
  {
    "model": "lectures.lecture",
    "fields": {
      "thumbnail": "https://cdn.inflearn.com/public/courses/326697/cover/c6b237e2-2180-40e2-9a1b-bad14762da82/326697-eng.png",
      "lectureTitle": "설계독학맛비's 실전 FPGA를 이용한 HW 가속기 설계 (LED 제어부터 Fully Connected Layer 가속기 설계까지)\n대시보드",
      "lectureFee": 275000,
      "lectureDescription": "중급자를 위해 준비한\n[임베디드 · IoT] 강의입니다.\n설계독학맛비와 함께! FPGA의 기본 지식과 HW 가속기 설계 경험을 쌓아봅시다.\n✍️\n이런 걸\n배워요!\nVerilog HDL\nFPGA 가속기 설계\n비메모리 반도체 설계 기본지식\n비메모리 설계 엔지니어 필수 강의!\nFPGA 지식, HW 가속기 설계 경험을 쌓아보세요.\n비메모리 설계 전문가를 꿈꾸는 당신을 위한\n맛비 유니버스 로드맵을 확인해보세요. (그림 click 시 상세 로드맵 page 로 이동합니다.)\n안녕하세요!\n설계독학의 맛비입니다.\nVelilog HDL Season1에 이은 두번째 강의입니다!\n실전 Verilog HDL Season 1 (Clock부터 Internal Memory까지)\n비메모리 반도체 설계의 기본 지식과 경험\n선수 강의를 완료하지 못했다면, 이번 강의 신청은 잠시 멈춰주시기를 부탁드립니다.\n아래 필독 문서를 꼭 읽어보시고 공감하신다면 강의를 신청해주세요. \n준비된 수강생이 보셔야 합니다.\n여러분이 필독 문서의 내용에 동의했다고 가정하고,\nFact만 전달하겠습니다.\n설계독학맛비의 FPGA Season 1 필독 문서 (클릭)\n(21/12/30 기준) 좋아요 730, 싫어요 2 , 조회수 47386회입니다.\n* 해당 영상은 현재 유튜브에서는 비공개 상태이며, 인프런을 통해서만 수강 가능합니다.\n우리는 FPGA를 배워야 합니다.\nFPGA Market은 점점 증가하고 있습니다.\n시장에서 요구하는 FPGA 를 배우면 여러분들의 몸값 또한 증가합니다.\n지금도 업계 상위 1%의 연봉을 받지만, 더 높은 연봉을 받을 기회가 있습니다.\n이 강의에서는 Xilinx FPGA를 사용합니다.\n우리는 Xilinx사의 FPGA를 배워야 합니다.\nXilinx (AMD) vs Altera (Intel) 의 FPGA 점유율이 말해주고 있습니다.\n다음 그림은 2019년에 실시된 통계 그래프로, 이 격차는 더 벌어지고 있습니다.\n현시점 점유율 1등이며, 최소 10년이상 Xilinx 가 점유율 1위를 수성할거라 예상합니다.\n제가 다녔던 모든 회사가 Xilinx FPGA 를 사용하고 있습니다.\n이 강의에서는 Zybo Z7 과 Arty Z7 을 사용합니다.\n(Click! 링크를 꼭 참고해주세요)\nFPGA 입문자를 위해 Zybo/Arty Z7을 선택한 이유는 다음과 같습니다.\nArm (PS) / PL을 둘다 사용해 볼 수 있습니다. → FPGA System 내부를 이해할 수 있습니다.\nXilinx에서 검증한 보드입니다. → 개인이 만든 보드가 아닙니다. 믿을 수 있습니다.\n사용하는 사람이 많습니다. → 전세계 엔지니어들의 도움을 받아보세요.\n다수의 예제가 있습니다. → 여러분들이 이 강의 이후 더 많은 것을 공부할 수 있습니다.\n영상처리를 위한 HDMI in/out 이 있습니다. → 추가로 카메라를 구매할 이유가 없습니다.\n이 강의를 완료하신다면\n첫째, 여러분들은 모든 FPGA Board를 사용해 보실 준비가 되어 있습니다.\nXilinx FPGA 의 제품 종류는 1000개가 훌쩍 넘습니다. \n하지만 여러분들이 이 강의를 수강하신다면, Xilinx사의 어떠한 FPGA가 있어도 사용할 수 있는 기본 지식을 쌓을 수 있습니다.\n저는 처음에 Zybo 보드로 입문하여서, 현재는 Xilinx사의 Server용 FPGA 주력 제품인 Alveo Card와 AWS 의 f1 instance를 사용하고 있습니다. FPGA는 임베디드뿐만 아니라, 서버 시장에서도 사용되고 있습니다.\n둘째, Verilog HDL 과 FPGA 를 이용한 HW 가속기 설계를 이해하실 수 있습니다.\n가속화를 원하는 Core를 설계하실 수 있습니다.\nFPGA 는 HW 가속을 위해서 만들어진 Chip 입니다.\n가속화를 하고자하는 Core를 설계해보고 검증하는 과정을 담았습니다.\n현업에서 만나요 🖐\n읽어주셔서 진심으로 감사합니다.\n여기까지 읽으셨으면 제 강의를 수강하지 않으셔도,\n여러분들은 훌륭한 설계 엔지니어가 되실거라 확신합니다.\n선택은 여러분들의 몫입니다.\n여러분들을 현업에서 만나뵙기를 기대합니다.\n감사합니다. 맛비 드림.\n🎁 학생, 취준생분들께 20% 쿠폰을 드립니다! 🥰\n아직 수입이 없는 분들의 부담을 조금이나마 덜어드리기 위해 마련했어요.\n더 많은 분들에게 혜택이 돌아갈 수 있도록 양해부탁드립니다.  신청링크 (클릭)\n지식공유자가 알려주는\n강의 수강 꿀팁!\n🎓\n이런 분들께\n추천드려요!\n전자과 3, 4학년 수준의 지식을 갖추신 분\n비메모리 설계 분야로 취업을 희망하시는 분 + 현업 엔지니어!\n디지털시계, 자판기 외에 다른 설계를 해보고 싶으신 분\n실전 FPGA를 배우고 싶으신 분\n📚\n선수 지식,\n필요한가요?\nVerilog HDL Season1 완료 (이어서 진행합니다.)",
      "lectureDifficulty": "중급자"
    }
  },
  {
    "model": "lectures.lecture",
    "fields": {
      "thumbnail": "https://cdn.inflearn.com/public/courses/326624/cover/a47f727f-a67b-476b-9d23-fefb0db9a954",
      "lectureTitle": "[NarP Series] MVC 프레임워크는 내 손에 [나프1탄]\n대시보드",
      "lectureFee": 44000,
      "lectureDescription": "초급자를 위해 준비한\n[백엔드] 강의입니다.\n본 과정은 WEB MVC 프레임워크가 무엇이고 WEB MVC 프레임워크가 어떻게 변형이 되면서 Spring WEB MVC 프레임워크로 넘어가는지 TPC(생각하고-표현하고-코딩하고) 기법을 통해 단계적으로 학습하고 이해 할 수 있는 과정입니다.\n✍️\n이런 걸\n배워요!\n자바 웹 개발 환경(WAS)을 구축 할 수 있다.\nServlet과 JSP 웹 프로그래밍을 할 수 있다.\nJDBC를 myBatis 프레임워크로 변경 할 수 있다.\nMVC 프레임워크로 웹을 개발 할 수 있다.\n서버와 Ajax 통신을 할 수 있다.\nSpring Web MVC 구조를 이해 할 수 있다.\n단계별 학습(생각-표현-코딩)을 통해\nWEB MVC 프레임워크를 제대로 공부해보세요!\n\n현재 자바 개발에서 필수적으로 알아야 되는 프레임워크가 스프링 프레임워크입니다. 전자정부표준프레임 워크 또한 스프링 프레임워크를 사전에 알아야 쉽게 이해 할 수가 있고 기업의 웹 ERP시스템을 구축하고 유지보수 할 수 있습니다.\n자바를 공부하고 → 자바 웹 프로그래밍에서 중요한 Servlet, JSP를 공부한 다음 → MVC 프레임워크를 이해하면 스프링 프레임워크를 쉽게 접근할 수 있습니다. 본 과정은 이런 연계성을 고찰하고 단계적 실습(나프1~2탄)을 통하여 정확하게 MVC 프레임워크가 무엇이고 MVC 프레임워크가 어떻게 변형이 되어 스프링 프레임워크로 넘어가는지를 그림과 설명으로 명확하게 전달하기 위해 설계되었습니다.\nMVC 구조\nM Model(Java) : 비즈니스 로직을 담당, 데이터베이스 연동과 처리(CRUD)를 구현한다.\nV View(JSP) : 프리젠테이션로직을 담당, 컨트롤러에서 데이터를 받아 동적인 페이지를 만들어낸다.\nC Controller(Servlet) : 클라이언트의 요청을 받고, Model과 연동하여 View로 데이터를 전달하는 컨트롤 역할을 담당한다.\n\n\n단계별 학습 내용\n[STEP-1] - 웹 개발 환경구성(WAS)하기(Eclipse(eGovFrame), Tomcat, MySQL)\n[STEP-2] - 초기 MVC 이해하기(Servlet, JSP, JSTL, EL)\n[STEP-3] - 변형 MVC 이해하기(FrontController, POJO, HandlerMapping, ViewResolver)\n[STEP-4] - MVC와 Ajax의 만남(myBatis, JavaScript, jQuery, Ajax, JSON)\n[STEP-5] - Spring Web MVC(POJO변형, @애노테이션, 리플렉션, 파라메터 수집, Model, DI)\n단계별 프로그램 구성\n TPC 강의 기법 활용\nTPC란? Thinking-Presentation-Coding\nTPC(생각하고-표현하고-코딩하고) 방법을 이용하여 프로그램을 그림으로 쉽게 설명하는 기법\n\n  예상 질문 Q&A\nQ. 이 강의만의 특별한 장점이 있을까요?\nA. 자바를 배운 후 자바 웹프로그래밍 Servlet, JSP를 쉽게 학습 할 수 있도록 설계했습니다.\nB. 회원관리 예제를 단계별로 학습하면서 MVC 프레임워크를 쉽게 이해 할 수 있게 구성하였습니다.\nC. 그림과 설명을 활용하여(T.P.C) 이해도를 높이고 복합적인 사고를 하고록 유도하였습니다. \n\nQ. 비전공자도 들을 수 있나요?\nA. 비전공자는 조금 어려울 수 있지만, 학습노트(그림)를 제공하고 소스코드를 제공하기 때문에 비전공자도 따라해볼 수 있습니다.\nB. 비전공자들도 MVC 프레임워크를 가장 쉽게 접근 할 수있도록 설계된 강의입니다.\n\nQ. 왜 이번 \"MVC 프레임워크는 내 손에\" 강의를 배워야 하나요? \nA. MVC 프레임워크는 공공기관 웹 ERP 시스템 개발에 꼭 필요한 기술이므로 반드시 습득해야 합니다.\nB. 자바는 웹이 가장 중요한 기술 입니다. 웹 기술을 이해하고 웹 ERP시스템을 구축해보면 실무에 자신감이 생기고 자신의 이력관리에도 많은 도움이 되기 때문입니다.\nC. 스프링 웹 MVC 프레임워크를 쉽게 이해하기 위해서는 기초가 탄탄해야됩니다.\n\n지식공유자가 알려주는\n강의 수강 꿀팁!\n🎓\n이런 분들께\n추천드려요!\nJDBC 프로그래밍을 하고자 하는 사람\nServlet, JSP를 학습하고자 하는 사람\nMVC 프레임워크가 무엇인지 알고자 하는 사람\nMVC 프레임워크를 이용하여 WEB ERP를 만들고자 하는 사람\nSQL Mapping 프레임워크(myBatis)를 알고자 하는 사람\nSpring Web MVC를 적용해보고자 하는 사람\n📚\n선수 지식,\n필요한가요?\n자바 기초 학습자, 데이터베이스 이해자",
      "lectureDifficulty": "초급자"
    }
  },
  {
    "model": "lectures.lecture",
    "fields": {
      "thumbnail": "https://cdn.inflearn.com/public/courses/326615/cover/8e5d2a12-23e0-4cd3-a736-8437a81d3625",
      "lectureTitle": "면접을 부르는 [개발자 이력서] 쓰기\n대시보드",
      "lectureFee": 55000,
      "lectureDescription": "입문자를 위해 준비한\n[취업 · 이직, 개발 · 프로그래밍] 강의입니다.\n개발자 서류 전형에서 내 \"스펙\"이 아니라 \"개발 역량\"을 어필하고 싶다면 어떻게 해야 할까요? 이 강의는 \"개발 역량\"이 훌륭한데, 면접 기회를 쉽게 얻지 못하는 개발자 분들의 '서류 전형' 합격률을 높여줄 수 있는 이력서 쓰는 방법을 알려드리는데, 초점을 맞췄습니다. SI 업체 이력, 학원 수업, 개인 포트폴리오 등 내 '개발 역량'을 어떻게 이력서에 적어야 하는지 알려 드립니다.\n✍️\n이런 걸\n배워요!\n스펙이 낮아도 어필할 수 있는 개발자 이력서 쓰는 방법\nSI업체 경력 등을 '개발자 역량'으로 포장하는 방법\n개발자 '서류 전형' 합격을 높여주는 이력서 쓰는 방법\nCTO와 CSO가 함께 알려주는 서류 전형 합격률을 높여주는 이력서 쓰는 법\n스펙이 부족해도, 면접관에게 어필할 수 있는 '개발자 이력서' 작성법\n🔍 개발자 채용 시, 채용 플랫폼을 통한 이력서 수집이 가장 많이 활용됩니다.\n개발자 채용 담당자가 가장 도움 많이 받는 게, 무엇인지 아나요?\n바로 채용 플랫폼(구인/구직 사이트 등)을 통한 이력서 수집입니다. 지인 추천이 가장 신뢰있는 방법이지만, 회사가 필요로 하는 개발자를 채용하기에 위해서 채용 플랫폼을 통한 이력서 검토만큼 효율적인 수단이 없기 때문입니다.\n채용 플랫폼을 통해서는 수많은 이력서가 제출되기 때문에, 채용 담당자(면접관 등)는 이력서 하나에 10초 이상 눈길을 주기 쉽지 않습니다. 짧은 시간에 눈에 띌 수 있는 이력서를 작성해야, 채용 담당자가 이력서를 자세히 검토하고, 면접을 볼 수 있는 기회를 얻을 수 있습니다.\n<출처: Programmers Recruiting Survey 2021, https://programmers.co.kr/pages/2021-recruiting-survey>\n채용 담당자가 읽고 싶어하는, 서류 전형에서 버려지지 않는 이력서를 쓰려면 어떨게 해야 할까요?\n그 동안 많은 분들의 '개발자 이력서'를 검토하거나 코칭해 드리면서, 개발자 분들이 잘못 생각하고 있는 부분을 이번 강의를 통해 알려 드리고자 합니다. 특히 비전공자이거나 SI회사 경력 등 상대적으로 불리한 스펙때문에 서류 전형에서 떨어진다고 생각하는 개발자 분들에게 '개발 역량'을 잘 기술하기만 해도 서류 전형 합격 가능성을 높여주는 이력서 작성 법을 알려 드리고자 합니다.\n저는 SI 업체 경력 밖에 없어서, 서류 전형에서 떨어지는 것 같아요...                                   \n무조건 스펙이 나빠서 서류 전형에서 떨어지는 게 아닙니다! 대부분은 개발 역량을 이력서에 제대로 표현하지 못했기 때문입니다.\n그동안 많은 분들의 '개발자 이력서'를 검토하거나 코칭해 드리면서, 개발자 분들이 잘못 생각하고 있는 부분을 이번 강의를 통해 알려 드리고자 합니다. 특히 비전공자이거나 SI회사 경력 등 상대적으로 불리한 스펙때문에 서류 전형에서 떨어진다고 생각하는 개발자 분들에게 '개발 역량'을 잘 기술하기만 해도 서류 전형 합격 가능성을 높여주는 이력서 작성 법을 알려 드리고자 합니다.\n상장사와 스타트업의 CTO를 거친 Jay와 IT 대기업과 스타트업의 CSO를 거친 Michael이 그동안 수천 개의 개발자 이력서를 검토하고, 수백 명의 개발자 면접을 진행한 경험을 바탕으로 정리된 '개발 역량을 잘 어필할 수 있는 개발자 이력서' 작성 방법을 배우면, 개발 실력이 있음에도, 이력서 쓰는 법을 몰라서, 서류 전형에 떨어지는 시행착오를 줄이는 데 도움이 될 것입니다.\nCTO 박재호\n- 현 스타트업 돕다 CTO\n- 전 아이콘루프 CTO\n- 전 엑셈(상장사) CTO\n- Yes24 월간 개발자 (바로가기)\n- 클린코드, 마이크로서비스 도입, 이렇게 한다 등 다양한 개발 서적 번역/저술\n- 유튜브 \"채널 박재호(바로가기)\", \"OKdevTV(바로가기)\" 운영\nCSO 박종호\n- 현 스타트업 돕다 CSO\n- 전 비앤앤비 CEO\n- 전 엔미디어플랫폼 이사\n- 전 네오위즈게임즈 전략팀장\n- 전 네이버 광고 사업 PM\nCTRL C+V 이력서는 이제 그만! 서류 전형을 통과하는 '개발자 이력서'를 써 봅시다              \n스펙이 낮아서, 서류 전형에 떨어지는 이력서도 있지만, 많은 '개발자 이력서'는 개발 역량을 제대로 기술하지 못해서 서류 전형에서 탈락하게 됩니다.\n'CTRL C+V' 한 듯한 비슷한 '개발자 이력서'를 보다가 답답해서 준비했습니다\n수천 건의 개발자 이력서와 수많은 면접 경험의 두 지식공유자가 면접관이 좋아하는 개발자 이력서 쓰기 Tip을 대방출 합니다.\nTip을 알려줄 수 있는 멘토나 선배 등을 만날 기회가 없어서, 자기 포장을 잘 못하는 개발자 분들을 위하여, 약간의 도움을 드리고자 면접관이 면접을 보고 싶게 하는 개발자 이력서 쓰기 노하우를 알려 드립니다.\n스펙때문에 개발자 서류 전형에서 떨어진다고 생각하시나요?                                            \n많은 회사들이 스펙이 낮아도, 개발 역량이 있는 개발자를 찾기 위해서 노력하고 있습니다.\n지방대여서, SI업체 근무 이력 때문에 또는 비전공자라서 서류 전형부터 떨어진다고 생각하는 분들이 많습니다.\n대부분은 스펙이 낮아서가 아니라, 개발 역량이 부족하거나, 이력서에 개발 역량을 충분히 표현하지 못해서입니다.\n개발자를 구인하는 회사는 많은데, 좋은 개발자를 구하기 힘들기 때문에, 개발 역량이 있는 분들을 찾기 위해 노력하는 회사가 많습니다.\n회사들은 다양한 채용 플랫폼을 통해서, 많은 '개발자'들의 이력서를 검토하며, 스펙이 가려진 실력있는 개발자를 한 명이라도 충원하기 위해 노력하고 있습니다.\n개발 역량이 충분한데 서류 전형에서 떨어지고 있다고 생각한다면, 스펙 때문이 아니라, 이력서에 개발 역량을 제대로 어필하지 못해서 일 가능성이 높습니다.\n'개발자 이력서'만 잘 써도 면접 기회가 많이 늘어납니다.\n면접관이 보고 싶어하는 내용들을 이력서에 담아 보세요\n보유기술, 경력, 프로젝트 등 보유하고 있는 개발 역량이나 경험만 잘 기술해도, 서류 전형에서 더 많은 기회를 확보할 수 있습니다.\n'면접을 부르는 개발자 이력서 쓰기'에서는 다음의 내용을 알려 드립니다.\n취업/이직 목표 잡기: 목표로 하는 회사의 직무기술서(Job Description)를 분석하여, 이력서 작성을 위한 목표를 설정해 봅니다.\n목표로 하는 회사에 지원하기 위한 이력서 소재 정리하기: 목표로 하는 취업/이직 시점에 이력서를 쓰기 위해, 내 개발 역량을 정리하는 방법에 대해 알아봅니다.\n면접관에게 어필할 수 있는 개발 역량 표현법 알아보기: 지원하는 회사의 직무기술서(Job Description) 분석을 바탕으로, 보유기술, 경력, 프로젝트 등을 면접관이 관심을 가질 수 있도록, 구체적으로 기술하는 방법에 대해서 알아봅니다.\n지식공유자가 알려주는\n강의 수강 꿀팁!\n🎓\n이런 분들께\n추천드려요!\n이력서 쓰는 법을 제대로 배워 본적이 없는 개발자 (또는 개발직군 구직자)\n비전공자여서, 개발자 직군 이력서 작성에 고민이 많은 분\n지방대, SI업체 경력 등 스펙 문제로 서류 전형(이력서) 탈락한다고 생각하는 분\n이력서에 동아리, 학교 수업, 아르바이트, 취미 얘기만 있는 분",
      "lectureDifficulty": "입문자"
    }
  },
  {
    "model": "lectures.lecture",
    "fields": {
      "thumbnail": "https://cdn.inflearn.com/public/courses/326460/cover/87997944-d08e-42a9-abaf-6e8aa25bf81b",
      "lectureTitle": "시스템엔지니어가 알려주는 리눅스 실전편 Bash Shell Script\n대시보드",
      "lectureFee": 99000,
      "lectureDescription": "중급자를 위해 준비한\n[데브옵스 · 인프라] 강의입니다.\n실전편은 쉘스크립트 뿐 아니라 인프라 전반을 다루고 있습니다. 정말 실무에 가까운 이야기와 실무에서 많이 다뤄야만 하는 트러블슈팅(장애 해결) 위주로 구성했어요!\n✍️\n이런 걸\n배워요!\n쉘스크립트 뿐 아니라 전반적인 인프라 구성과 운용\n간단한 서버의 구성과 구축 방법\n여러 서버 종류별 특징과 트러블(장애) 상황\n트러블의 흐름을 파악하고 원인을 찾아가는 방법\n최종적으로 쉘 스크립트를 통해 트러블 슈팅을 완성하는 것을 배울 수 있습니다\nLinux 중급자로 나아가기 위한 선택!\n꼭! 알아야 할 실전편 Linux Bash Shell Script\n  실전편 Linux Bash Shell Script\n\n전 세계에서 서버로 가장 많이 사용하는 운영체제인 리눅스\n그리고 그 리눅스 활용의 핵심인 쉘 스크립트를 더 쉽게 배우기 위해 색다른 방법을 도입했습니다.\n👩🏻‍💻롤플레잉 게임을 하듯이 시나리오를 통해 실제 회사에서 운영하는 것과 같은 상황에서 쉘스크립트를 작성해 볼 수 있습니다.\n이 강의는 쉘스크립트 뿐 아니라 전반적인 인프라 구성과 운용에 대한 이야기도 다루고 있습니다.\n👨🏻‍💻다루는 내용\n간단한 서버의 구성과 구축 방법\n여러 서버 종류별 특징과 트러블(장애) 상황\n트러블의 흐름을 파악하고 원인을 찾아가는 방법\n그리고 최종적으로 쉘 스크립트를 통해 트러블 슈팅을 완성하는 것을 배울 수 있습니다.\n강의 구성은 어떻게 되어있나요?📑\n인프라의 전반적인 내용을 다루고 있기 때문에 \n시나리오별 필요한 기초 지식을 먼저 정리하고 시나리오를 통해 실습하도록 했습니다.\n강의를 보며 먼저 흐름과 용어에 익숙해진 후에 반복해서 실습하는 학습 방법을 추천합니다.\n리눅스 실전편 왜 만들었어요?\n🤔이 강의는 자주 받았던 질문에서부터 출발했습니다. \nQ : \"매일 수십 개의 명령어를 실행하며 반복하는 작업이 있는데 이걸 자동화 할 수 없나요?\"\nQ : \"명령어를 몇 개 알긴 하는데 매번 익숙해지지 않아서 검색하기가 귀찮아요.\"\n이런 분들을 위해 실전에서 리눅스를 운용하는 전반적인 상황을 시나리오로 만들고 \n그 흐름 안에서 쉘 스크립트를 어떻게 활용할 수 있는지 직접 겪어보실 수 있도록 강의를 기획했습니다.\n백 번 듣는 것보다 한 번 겪어보는 것이 이해가 빠르기 때문입니다.\n\n사실 아실 거예요.\n✅ 쉘 스크립트는 명령어 몇 개를 이어붙여서 파일로 만들면 쉽게 만들 수 있습니다.\n✅ 어려운 것은 실제 어떤 상황에서 어떤 명령을 어떤 옵션으로 사용할 지를 고를 수 있는 상황을 파악하는 능력입니다.\n✅ 이 강의는 인프라(시스템) 운용에서의 트러블 슈팅(장애 해결)을 중심으로 쉘 스크립트를 실무에 빠르게 적용할 수 있도록 만들었습니다.\n이 리눅스 실전편은 누가 들으면 좋을까요?💁🏻💁🏻‍♂️\n리눅스 설치도 할 줄 알고 명령어도 익숙하지만 \"이걸로 뭘하지?\" 하는 고민을 한 사람\n요즘은 클라우드를 써서 리눅스가 쉬워졌다고 하는데 뭐가 쉬워졌는지 모르겠는 사람\n리눅스 환경에서 개발을 하고 있지만 명령어 옵션의 활용이 불편하게 느껴지는 사람\n요즘 유행하는 DevOps, SRE를 꿈꾸는 사람\nSE(System Engineer), SA(System Administrator)를 꿈꾸는 사람\n기초편에서 하는 말이 대충 뭔지 안 사람\"\n  이 리눅스 실전편이 맞지 않는 사람은요?🙅🏻🙅🏻‍♂️\n윈도우즈 이외의 운영체제엔 관심이 없는 사람\n리눅스의 기본 명령어와 용어를 전혀 접해 본 적이 없으신 분들은 기초편을 먼저 들어주세요.\n\n이 강의를 들으면 어떻게 달라질까요?🎈\n인프라 운용 전반과 쉘 스크립트를 실전에서 적절하게 사용하는 방법을 익힐 수 있습니다.\n웹 서비스 인프라(서버/네트워크)의 구성과 미들웨어에 대한 지식\n로컬(pc/노트북)에 테스트용 서버 구축 방법 \n웹 서비스의 서버 운용 지식\n서버 종류별 트러블의 원인 조사 및 해결\n쉘 스크립트 작성\n  리눅스 실전강의 누가 알려주실까요?🧐\n동네에서 컴퓨터 좀 할 줄 아는 애로 유명해지며 컴퓨터계에 입문\nPC통신 유닉스, 윈도우, 파워유저 동호회 등에서 기초를 갈고닦음\n인터넷 세상으로 넘어가며 유명 커뮤니티의 (유령)회원으로 활동\nSun microsystems, IBM AIX 등 유닉스 시스템관리자로 시작\n이후 리눅스계열로 옮겨 RedHat, Fedora, CentOS, Ubuntu를 메인으로 다룸\n전, 학원 프랜차이즈 회사의 시스템 엔지니어\n누가 들어도 모를 이름을 가진 곳에서 누가 들어도 알만한 타이틀을 보유했던 게임 회사의 시스템 엔지니어\n700만명 이상의 웹 커뮤니티 / SNS 서비스의 시스템 엔지니어\n그 외 서버 인프라 컨설팅 등으로 15년이상 시스템 엔지니어 외길인생\n리눅스 강의를 진행하실 '강민구'님을 소개합니다. 👏\n2004년부터 서버 엔지니어로 일을 시작한 '강민구'님은 현재 '시스템 엔지니어'로 리눅스를 깊게 다루고 있는 실무자입니다. \n국내에 있는 리눅스 강의들이 실무와는 조금 동떨어져 있다는 생각을 하시고 있어서 이번 강의를 만들게 되었어요. \n이 리눅스 강의는 기초편과 실전편)로 이뤄져 있습니다. 실무에서 꼭 필요한 BASH명령어와 쉘 스크립트로 구성했으니 실전편도 기대해 주세요. :)\n더 자세한 이야기는 🎙️👤강민구님 Xㅍㅍㅅㅅ 기사에서 보실 수 있어요.\n리눅스 실전편 커리큘럼🎓\n오리엔테이션\n대상은 누구인가\n무엇을 배우는가\n어디에서 쓸 수 있는가\n어떻게 배우는가\n실습용 가상 스타트업 Virtual Web Service사의 소개\n1-1. 회사 소개\n1-2. 서버/네트웍 구성도\n기초지식\n서버/네트웍 구성도\n1-3. 서버 상세 정보\n기초지식\n서버 정보\n롤플레잉 시나리오\n2-1. 서버 구축\n기초 지식\nVagrant로 로컬에 웹서버 환경을 구축\n웹서버 구축 검증 및 확인 쉘 스크립트\n2-2. 웹 서버 트러블 슈팅을 위한 쉘 스크립트\n시나리오\n기초 지식\n장애 원인 찾기\n모니터링\n2-3. 웹 서버 트러블의 재발 방지를 위한 쉘 스크립트\n시나리오\n기초 지식\n로그 디렉토리 용량 감시 스크립트\n디스크 파티션 사용량 감시 스크립트\n2-4. 백업 쉘 스크립트\n시나리오\n기초 지식\n백업 정책 세우기\n백업 스크립트가 해야 할 일\n웹, 데이터베이스 , 스토리지 서버 백업 스크립트\n2-5. 웹, 데이터베이스 서버 트러블 슈팅을 위한 쉘 스크립트\n시나리오\n기초지식\n원인파악\n오류 처리를 추가한 백업 쉘 스크립트\n트러블 재발 방지를 위한 처리\n2-6. 스토리지 서버 트러블 슈팅 쉘 스크립트\n시나리오\n기초지식\n원인파악\n백업 스크립트 업그레이드\n2-7. 스토리지 서버 트러블 재발 방지를 위한 처리 쉘 스크립트\n시나리오\n기초지식\n백업 확인 쉘 스크립트\n현직 시스템 엔지니어의 커맨드 활용 팁\n명령어 옵션을 활용한 팁\n문법을 활용한 팁\n쉘 스크립트 문법 점검 팁\n실전 편을 마치며…\n  강사의 한마디👩🏻‍🏫\n\"대학시절 심리학과를 다니는 후배의 공연을 보러 간 적이 있었습니다.  심리학과에서 무슨 공연인가 싶었지만 심리치료의 한 방법으로 사용하는 사이코드라마 라는 것이었습니다. 사이코 드라마는 심리치료를 받는 사람이 안고있는 문제를 다른 사람의 입장에서 연기를 하게하고 그를 통해 타인의 입장과 생각을 이해하고 자신의 입장을 정리할 수 있는 공대생에게는 다소 낯설고 신선한 방법이었습니다.\n한 동안 잊고 지냈는데 이번 강좌를 만들기 위해 고민하던 중 어떤 한 가지 아이디어가 떠올랐습니다. 사이코드라마처럼 강좌를 듣는 사람이 실제 그 상황에 처해있다는 가정을 하고 배우면 더 빠르게 배울 수 있지 않을까? 하는 생각이었습니다.\n롤 플레잉 게임도 마찬가지의 느낌이었기에 롤을 부여하고 플레이를 할 수 있도록 시나리오를 만들었습니다.명령어만 나열하는 다소 지루한 강좌보다는 \n꼭 필요한 명령과 옵션,상황에 따라 맞춰서 사용할 수 있는 지식을 전달하고 싶었기 때문에 이런 방식을 채택했습니다.\n리눅스도 설치 할 수 있고 어느 정도 명령어도 사용할 줄 아는 분들에게 이러한 공부 방식이 다음 스텝으로 나아가는데 도움이 되리라 생각합니다. \n실무에서 어떤 명령을 써야하고 쉘 스크립트를 어떻게 왜 만들어야하는 지 궁금하시다면 이 강좌가 도움이 되실 것입니다. \"\n  지식공유자가 알려주는\n강의 수강 꿀팁!\n🎓\n이런 분들께\n추천드려요!\n리눅스 설치도 할 줄 알고 명령어도 익숙하지만 \"이걸로 뭘하지?\" 하는 고민을 가진 사람\n요즘은 클라우드를 써서 리눅스가 쉬워졌다고 하는데 뭐가 쉬워졌는지 모르는 분\n리눅스 환경에서 개발을 하고 있지만 명령어 옵션의 활용이 불편하게 느껴지는 사람\n요즘 유행하는 DevOps, SRE를 꿈꾸는 사람\nSE(System Engineer), SA(System Administrator)를 꿈꾸는 사람\n기초편에서 하는 말이 대충 뭔지 알겠는 사람",
      "lectureDifficulty": "중급자"
    }
  },
  {
    "model": "lectures.lecture",
    "fields": {
      "thumbnail": "https://cdn.inflearn.com/public/courses/326342/cover/e8771ba0-1550-4874-81f5-08823fac4ba9/326342-eng%20(1).png",
      "lectureTitle": "Confluence를 활용해서 효과적으로 지식 관리와 프로젝트 협업하기\n대시보드",
      "lectureFee": 88000,
      "lectureDescription": "입문자를 위해 준비한\n[기획 · 전략 · PM, 개발 도구] 강의입니다.\n회사는 조직원의 역량에만 기대지 않고 시스템과 프로세스 위에서 움직여야 합니다. 이를 위해서는 협업과 공유를 이끌어내는 업무 문화가 필요합니다. 본 강의는 협업의 필요성과 기존 협업 방법의 어려움을 짚으면서 Confluence (컨플루언스) 기반으로 효과적으로 협업을 하고 업무 이력을 쌓으며 노하우를 축적하는 방법에 대해서 설명합니다.\n✍️\n이런 걸\n배워요!\n협업의 정의와 필요성\nConfluence 제품 소개 및 종류\nConfluence 페이지 작성 및 Editor 사용법\n다양한 전문가들과 효율적으로 협업하기 위한 Confluence 활용법\nConfluence의 기능을 확대해 주는 다양한 macro 사용법\n가독성 좋은 문서를 만들기 위한 page layout 및 구성 방법\nJIRA, Slack 등 다른 제품과 연동하여 더 효과적으로 일하기\n협업의 시대, 협업 그 자체!\n컨플루언스로 더 전문적인 협업을 경험하세요.\n혹시, 일하면서\n이런 경험 있으셨나요?\n회의 자료를 이메일로 받았는데 첨부 파일이 누락되어 있었나요?\n업무 이력을 찾아봐야 하는데 그룹웨어에 붙은 이메일에서는 검색이 잘 안 돼서 이력을 찾는 데 시간을 까먹은 적 있나요?\n퇴사한 직원한테 인수인계 받을 자료가 있었는데 경영지원에서 PC를 포맷했나요?\n정신없이 여러 보고 자료를 만들다 보니 폴더 내에 파일 이름이 이런 식으로 생성되고 있나요?\n완성본_최종완성본_final...\n이런 상황을 방지하기 위해서는 어떻게 해야 할까요? 문제는 도구와 방법에 있습니다.\n바야흐로 정보 과잉 시대에 살고 있는 우리는 현대 기업 환경에서 협업을 하기 위해 가장 최적화된 도구와 방법론을 고민해봐야 합니다. 업무 이력을 회사의 노하우로 축적하면서 다른 팀과 더 잘 협업하고 좋은 결과를 내기 위해서는 협업 및 공유의 업무 문화를 뒷받침하는 실용적이고 체계적인 업무 관리 프로세스와 도구가 필요합니다. 바로, 컨플루언스(Confluence)가 필요한 이유입니다.\n지난 10년 동안 현업에서 컨플루언스를 사용하며 얻은 노하우를 통해 컨플루언스를 제대로 활용하는 방법을 알려드립니다.\n컨플루언스란?\nJIRA를 개발한 협업 툴 전문 회사,\n아틀라시안(Atlassian)에서 만든\n엔터프라이즈용 위키 시스템입니다.\n나날이 경쟁이 치열해져 가는 현대 기업 환경에서, 구성원의 업무 역량을 강화하고 디지털 전환과 협업 프로세스 기반의 강력한 기업 문화를 구축하는 것은 기업의 생존을 위해서 꼭 필요한 일입니다.\n조직의 사일로 현상(Silo Effect)을 없애고 신뢰와 협업 기반의 기업 문화를 구축하려면 익숙했던 기존의 업무 문화를 바꿔야 합니다.\n컨플루언스(Confluence)는 이런 현대 기업의 요구사항에 맞게 설계된 위키 시스템(Wiki System)입니다. 기업 문화를 개선할 의지가 있는 회사가 컨플루언스를 사용하면 마케팅, 세일즈, 운영, 엔지니어링 등 업무에 관계없이 모든 팀이 최신 정보를 공유하고 즉각적인 피드백을 할 수 있습니다.\n또 효과적인 문서 기반 협업과 지식 공유를 촉진하며 논의한 아이디어를 실행으로 전환할 수 있게 도와주는 협업 솔루션인 만큼, 협업과 소통에 드는 비용을 최소화해 더 나은 결과를 낼 수 있도록 도와줍니다.\n컨플루언스 활용,\n이런 분들께 추천합니다.\n쌓여가는\n업무 메일과 자료에\n지친 분\n흩어진 지식/경험을\n체계적으로\n관리하고 싶은 분\n기업 지식 자산을\n꾸준히 쌓고\n현행화하고 싶은 분\n협업 프로세스를\n전사적으로 구축하고\n전파하고픈 C레벨\n노션보다 훨씬\n협업/문서관리에\n맞는 도구를 찾는 분\n이미 컨플루언스를\n사용하고 있지만,\n더 제대로 쓰고픈 분\n왜 올인원 툴 대신\n컨플루언스를 써야 할까요?\n최근에는 하나의 툴로 여러 업무를 처리하는 것을 지향하는 올인원 프로덕트(all-in-one product)를 선호하는 분들도 많습니다. 그러나 협업과 업무 흐름 관리, 데이터 관리 등은 모두 지식과 전문성을 요구하는 별개의 업무입니다. 복잡하고 전문화된 현대 업무 환경에서 각각의 업무에 맞는 전용 도구를 사용하는 것이 보다 합리적이지 않을까요?\n잦은 피드백과 의견을 반영하고 빠르게 실행해야 하는 지금의 업무 환경에 맞춰 정보를 집중시키고, 협업을 이끌어낼 쉽고 편리한 방법을 찾아야만 합니다. 그런 점에서 컨플루언스는 강력한 해답을 제시하는 문서 기반 협업 툴이 될 수 있을 것입니다.\n컨플루언스와 다른 도구를\n같이 사용하려면?\n위에서 말씀드렸듯 컨플루언스는 모든 상황에 맞는 만능 도구가 아닙니다. 맥락과 상황에 맞게 여러 협업 툴을 같이 사용해야 합니다.\n기존의 문서 작성 도구인 MS Word, Excel, PowerPoint나 PDF 문서를 효과적으로 공유하고 관리하기 위해 Confluence Page에 연결하고 WebDAV(Web Distributed Authoring and Versioning, 웹 분산 저작 및 버전 관리)를 사용해서 \"보고서_2021-07-13-진짜_최종_마지막_v#3.pptx\" 같은 파일명을 생성하지 않아도 변경 사항을 관리할 수 있는 방법을 설명합니다.\nConfluence Space를 Slack(슬랙) 과 연동해서 새로운 페이지가 만들어지거나 기존 페이지나 수정되는 등 이벤트가 발생하면 슬랙 채널로 알림을 받아보게끔 하는 등 실용적인 연동 방법에 대해서도 배우게 됩니다.\n컨플루언스, 제대로 쓰려면?\n컨플루언스는 지라(JIRA)에 비하면 직관적이며, 사용법을 배우기 쉬운 편입니다.\n하지만 컨플루언스의 직관적이고 심플한 UI 뒤에는 협업을 더 효과적으로 지원하기 위한 많은 고급 기능이 숨어 있습니다.\n이런 고급 기능을 사용하지 않는다면 컨플루언스는 편리하지만 비싼 게시판, 또는 중앙집중형 파일 서버로밖에 존재하지 않게 됩니다.\n본 강의에서는 컨플루언스에 숨어있는 여러 가지 고급 기능을 활용해 생산성을 높이고, 지라와 연동하여 기업 문화를 강화하고 피드백 및 커뮤니케이션 흐름을 개선하도록 도와드립니다.\n[버전 댓글을 포함하여 게시] 기능\n이를 위해 컨플루언스의 개념과 기본적인 에디터 사용법부터 시작해 모든 정보를 컨플루언스에 모으기 위한 효과적인 사용법, 변경 사항을 관리하고 동료와 공유하는 방법 등 필수적인 협업 기능을 학습합니다.\n그리고 큰 노력을 들이지 않고 가독성 높은 문서를 작성하는 법, 첨부 파일 관리, 실시간 동시 편집 등 강력한 협업 프로세스를 구축하기 위한 다양한 방법에 대해서도 배웁니다.\n제로 트러스트(Zero Trust)란 무엇인가?\nMySQL 설정하기\n지라와의 차이점은?\n컨플루언스는 지라(JIRA)와 사용하면 시너지를 더 극대화하고 효과적으로 협업과 업무 이력을 관리할 수 있습니다. 하지만 많은 분들이 어느 상황에서 컨플루언스를 사용하고 언제 지라를 사용해야 할지 혼동된다고 말씀하십니다.\n지라의 장점은 업무 흐름(Workflow, 워크플로) 관리이며,\n컨플루언스는 문서 기반 협업에 사용하시면 됩니다.\n예를 들어 만약 개인정보보호법을 준수하기 위해 제공중인 웹 서비스에 올릴 “개인정보처리방침” 문서를 작성하는 업무를 수행해야 한다고 가정해 보겠습니다. 사내에는 문서를 작성하고 검토하고 외부에 배포하는 절차가 있을 테고 그 절차를 문서작성 워크플로라고 할 수 있습니다. 문서는 관련 팀에서 초안을 작성하고 내부 검토를 거쳐서 승인 후 배포되며, “개인정보처리방침” 같이 법/제도와 관련된 문서는 변호사의 검토를 다시 거친 후에 외부에 공개하는 워크플로를 갖고 있다고 가정해 보겠습니다.\n지라의 워크플로 에디터 기능을 사용하면 다음과 같이 모델링할 수 있습니다.\n이제 문서를 작성할 때 각 문서가 어느 워크플로상에 있는지 추적하기 위해 “개인정보처리방침” 이슈(Issue)를 지라에 등록하고, 진행 단계마다 워크플로에 맞게 상태를 변경해주면 됩니다.\n“개인정보처리방침” 문서는 관련 부서에서 초안을 작성하고 내용을 검토하고 오타나 어색한 문구 등을 조율해야 합니다. 이렇게 문서 기반으로 협업과 공유를 할 경우엔 컨플루언스를 통해 편집 및 리뷰를 공동으로 진행하면 수정 → 취합 → 배포에 드는 노력과 시간을 최소화할 수 있습니다.\n문서의 내용은 공동으로 작성하며 진행 상태는 Confluence Page와 JIRA Issue를 링크하고 각 단계가 끝나면 지라의 상태를 변경함으로써 워크플로를 수정해 줍니다.\n내부 리뷰까지 끝났으면 변호사에게 공유하고 지라의 Status를 “변호사 리뷰” 상태로 변경해 주면 이슈의 상태와 실제 수행하는 업무(문서 작성)를 각각 용도에 맞게 사용하면서 진행 상황을 추적하고 협업과 공유를 할 수 있습니다.\n이렇게 업무 흐름 추적이 필요한 업무는 지라에서 관리하며, 컨플루언스는 문서 기반 협업을 수행하고 단일 정보 출처로 활용하기 위해 지라의 이슈를 연결하는 방식으로 사용하면 됩니다.\n국내 유일!\n컨플루언스 온라인 강의를\n만나보세요.\n이 강의는 국내 유일의 온라인 컨플루언스 강의입니다. 10여 년간 컨플루언스를 활용해서 회사 업무와 프로젝트를 수행하면서 익힌 노하우와 협업 지식, 그리고 외부에 도입 컨설팅과 기업 대상 강의를 하면서 느낀 경험을 압축해서 강의에 담았습니다.\n컨플루언스의 방대한 기능 중 중요 기능을 선별하여 실습과 함께 제공하며 뒷부분에서는 다음과 같은 실용적인 꿀팁들을 제공하고 있습니다.\n컨플루언스로\n가독성 좋은 문서\n작성하기\n검색 품질을\n높이기 위한\n컨텐츠 관리 방법\n지라 - 컨플루언스\n연동을 통한\n업무 흐름 관리, 협업\n페이지 레이아웃 및\n섹션 편집 기능으로\n온보딩 페이지 작성\n사용 버전을\n확인해주세요.\n컨플루언스는 설치 여부에 따라 온프레미스(On-Premise, Server와 Data Center)와 클라우드로 나뉘며, 클라우드는 요금제에 따라 Free, Standard, Premium, Enterprise로 구분됩니다.\n본 강의는 Cloud Standard 버전을 기준으로 진행되며, 설치형은 Server 7.11 버전을 기준으로 강의합니다.\nConfluence 가격 정책 (클릭)\n서버와 클라우드, 양 제품 간의 차이가 커지고 있지만 아직도 공통 기능이 많으므로 공통 부분은 클라우드를 대상으로 강의하며 차이가 있는 부분은 설치형인 서버 버전을 사용합니다. 특정 제품에만 해당하는 내용은 제목에 (CLOUD)나 (SERVER)로 표시했습니다.\n온보딩(on-boarding) 페이지 예제\n이 강의를 만든\n지식공유자를 소개합니다.\nlesstif(정광섭)\n유닉스 환경의 C/C++ 서버 개발자로 시작해 다양한 프로젝트 경험을 쌓았습니다.\n자동화와 업무 프로세스 개선, 정보의 공유와 협업에 관심이 많습니다. 위키, 이슈 관리, 지속적인 통합 등을 활용해 협업 시스템을 구축하고 구성원의 참여를 이끌어내어 공유와 협력의 업무 문화를 만들기 위해 노력중입니다.\nMediaWiki, docuwiki, Redmine 등 다양한 오픈소스 기반 위키를 거쳐 10년 전부터 컨플루언스를 주로 사용하고 있으며 Confluence - JIRA 기반의 협업 프로세스 구축, 프로세스 개선 등의 업무도 수행하고 있습니다.\n8년 전부터 tistory 에 운영하던 블로그를 Confluence Server 기반인 lesstif.com 로 옮기고 지식과 정보를 공유하고 있으며, 깃허브에서 몇 가지 작은 오픈소스 프로젝트를 진행하고 있습니다. 이중에서 PHP로 JIRA REST API를 사용할 수 있게 한 프로젝트는 현재 100만이 넘는 다운로드를 기록하고 있습니다. 저서로 “리눅스를 활용한 회사 인프라 구축의 모든 것”과 “쉽게 배우는 라라벨 프로그래밍”이 있습니다.\n기업 강의 문의는 lesstif@gmail.com로 해주시면 됩니다.\n지식공유자의\n다른 강의가 궁금하다면?\nJIRA를 활용해 더 효과적으로 프로젝트 협업하기\n업무 효율을 높이는\n프로젝트 협업 노하우!\n로드맵으로\n협업툴 정복하자!\n당신의 협업을 도와줄 효율적인 툴, Jira와 Confluence!\n회사 내에서 진행되는 업무의 이력은 물론\n업무 흐름 및 데이터까지 관리해보세요!\n지식공유자가 알려주는\n강의 수강 꿀팁!\n🎓\n이런 분들께\n추천드려요!\n쌓여가는 이메일에 지치신 분들\n체계적으로 지식과 경험을 관리하고 싶으신 분\n회사의 지식 자산과 노하우를 체계적으로 쌓고 현행화하고 싶은 분\n다양한 분야 전문가들과 협업하기 위한 방법을 배우고 싶은 분\n전사적으로 협업 프로세스와 방법론을 구축하고 전파하고 싶은 C level",
      "lectureDifficulty": "입문자"
    }
  },
  {
    "model": "lectures.lecture",
    "fields": {
      "thumbnail": "https://cdn.inflearn.com/public/course-326288-cover/9bd53e0c-48e2-449d-969a-277335c0df77",
      "lectureTitle": "초보를 위한 쿠버네티스 안내서\n대시보드",
      "lectureFee": 49500,
      "lectureDescription": "초급자를 위해 준비한\n[백엔드, 데브옵스 · 인프라] 강의입니다.\n쿠버네티스를 1도 모르는 입문자, 초보자를 위한 쿠버네티스 안내서 입니다. 초보자도 이해하기 쉬운 내용과 흐름으로 구성했어요.\n✍️\n이런 걸\n배워요!\n쿠버네티스\n쿠버네티스 입문\n쿠버네티스 기본 개념\n쿠버네티스 기본 사용법\n데브옵스(DevOps) 입문자라면 주목! \n쿠버네티스의 첫발을 함께 떼어보세요 🚩\n화제의 쿠버네티스 안내서 블로그, \n이제 동영상으로 만나요 📺\n도커에 이은 2번째 DevOps 시리즈, 초보를 위한 쿠버네티스 안내서입니다. 이론부터 실습까지 쿠버네티스에 대해 좀 더 이해하기 쉽도록 구성하였습니다.\n도커 안내서 강의가 궁금하다면? 📺\n초보를 위한 도커 안내서\nDocker\n(285)\n₩29,700\n꼭 알아야 할\n쿠버네티스 핵심만 쏙쏙 📌\n\"너무 복잡해요\", \"진짜 아무것도 몰라요\", \"핵심만 배우고 싶어요\"\n쿠버네티스를 사용하는 이유, 동작 원리, 실전 사용법을\n하나하나 꼼꼼하게 알아봅니다.\n쿠버네티스는 인프라(서버)를 지탱하는 최신 기술입니다.\n컨테이너를 쉽고 빠르게 배포/확장하고 관리를 자동화해줄 수 있도록 구글이 만든 오픈소스 플랫폼으로, 현재 수많은 기업에서 사용중입니다. 국내 기업만 해도 카카오, 네이버 등 대규모의 서버를 관리하는 곳에서는 필수로 사용하는 기술입니다.\n쿠버네티스(Kubernetes, k8s)는 설치부터 운영, 각종 고급 기능까지 다양한 부분을 알아야 하고 그 과정은 험난하고 처음 접하는 사람을 지치게 합니다. 그리고 새로운 버전이 빠르게 나오고 자주 변하는 만큼 단순 사용법을 익히기보다, 쿠버네티스의 핵심 동작 방식을 이해하고 실습을 통해 사용법을 익히는 것이 중요합니다.\n오랜 기간 쿠버네티스를 사용하면서 느꼈던, 자주 사용하고 꼭 알아야 할 내용을 모아 부담없이 학습할 수 있도록 하였습니다. 도저히 쿠버네티스가 뭔지 모르겠어! 라고 생각한다면 지금 바로 수강하세요!\n다른 쿠버 강의와 다른 \n이 강의만의 핵심 강점 ✨\n110개 이상의 수강평이 인증하는 인프런 쿠버네티스 베스트셀러!\n다양한 오프라인 강의 경험의 핵심을 그대로 온라인으로 옮겨왔습니다. \n이제 영상으로 차근차근 배우고, 실습까지 따라 진행해보세요!\n👨‍💻 슬라이드 + 영상 강의\n📖 단원별 개인실습 자료 제공 (문제 + 해답)\n✏️ 내용을 잘 이해했는지 확인하는 중간 실습\n어떤 내용을 다루나요? 📚\n쿠버네티스를 처음 접하는 분들이 가장 빠르고 쉽게 이해할 수 있도록 핵심적인 내용을 다룹니다.\n최대한 기술적으로 복잡한 내용을 제외하고 쉬운 용어를 사용하여 쿠버네티스를 입문하는데 도움이 되도록 구성하였습니다.\n1. 쿠버네티스를 왜 쓰는지? \n쿠버네티스가 무엇인지 알아보자!\n시작하기 - 컨테이너 오케스트레이션\n알아보기 - 동작방식 및 아키텍처\n2. 쿠버네티스가 무엇인지 이해했다면 \n실제로 사용해보자!\n실습 준비 - windows, macOS, linux, cloud 환경 준비\n기본 실습 - 핵심만 뽑아 빠르게\n👨‍💻 Coming Up Next...?\n고급편도 준비중입니다. 조금만 기다려주세요!\n지식공유자가 알려주는\n강의 수강 꿀팁!\n🎓\n이런 분들께\n추천드려요!\n쿠버네티스를 1도 모르는 입문자/초보자\n짧은 시간에 쿠버네티스 개념을 익히고 사용하고 싶은 개발자\n쿠버네티스가 무엇인지, 어떻게 사용하는지 궁금한 분\n📚\n선수 지식,\n필요한가요?\n도커",
      "lectureDifficulty": "초급자"
    }
  },
  {
    "model": "lectures.lecture",
    "fields": {
      "thumbnail": "https://cdn.inflearn.com/public/courses/325969/cover/2868c757-5886-4508-a140-7cb68a83dfd8/325969-eng.png",
      "lectureTitle": "스프링 핵심 원리 - 기본편\n대시보드",
      "lectureFee": 88000,
      "lectureDescription": "초급자를 위해 준비한\n[웹 개발, 백엔드] 강의입니다.\n스프링 입문자가 예제를 만들어가면서 스프링의 핵심 원리를 이해하고, 스프링 기본기를 확실히 다질 수 있습니다.\n✍️\n이런 걸\n배워요!\n스프링 기본 기능\n스프링 핵심 원리\n객체 지향 설계\n스프링 핵심 원리를 이해하고, \n성장하는 백엔드 개발자가 되어보세요!\n📢 수강 전 확인해주세요!\n본 강의는 자바 스프링 완전 정복 시리즈의 두 번째 강의입니다. 우아한형제들 최연소 기술이사 김영한의 스프링 완전 정복 로드맵을 먼저 확인해주세요. (바로가기)\n스프링 핵심 원리 - 기본편 현재 강의\n객체 지향 설계와 스프링\nSOLID - SRP, OCP, DIP\n스프링 컨테이너와 스프링 빈\n스프링 컨테이너 - IoC, DI\n의존관계 주입\n빈 생성주기와 스코프\n스프링 핵심 원리 - 고급편\n스프링 핵심 디자인 패턴\n템플릿 메서드 패턴, 전략 패턴, 템플릿 콜백 패턴, 프록시 패턴, 데코레이터 패턴\n쓰레드 로컬\n동시성 문제, 멀티쓰레드, 쓰레드 로컬\n스프링 AOP\n개념, 동작 원리, 실전 예제, 주의 사항\n김영한의 스프링 핵심 원리 기본편\n객체 지향 설계, 스프링의 핵심 원리 및 기능\n  스프링의 원리부터 핵심 가치까지\n단순히 스프링이 제공하는 기능을 배우고 사용하는 것은 어렵지 않습니다. 그런데 스프링이 제공하는 핵심 가치와 원리를 제대로 이해하고 사용하려면 큰 난관에 부딪힙니다. 왜냐하면 IoC(제어의 역전), DI(의존관계 주입) 같은 알듯말듯한 용어부터, SRP, OCP, DIP 같은 소위 SOLID라 불리는 좋은 객체 지향 설계의 원칙들도 함께 이해해야 비로소 스프링의 핵심 원리를 제대로 파악할 수 있기 때문입니다. \n스프링의 진정한 핵심 가치는 바로 객체 지향 프로그래밍(OOP)에 있습니다. 그리고 스프링을 제대로 이해하기 어려운 이유도 이 객체 지향 때문입니다. 다음 단계의 백엔드 개발자로 성장하려면, 스프링이 제공하는 핵심 가치와 원리를 반드시 깊이있게 이해해야 합니다.\n이 강의는 스프링이 없던 20년 전으로 돌아가서 스프링이 왜 만들어졌는지 그 이유부터 시작합니다. 그리고 우리도 그때로 돌아가서 스프링 없는 순수한 자바 코드로 예제 애플리케이션을 만들어봅니다. 요구사항이 변경 됨에 따라 문제점들이 하나씩 발견되고, 그 문제를 해결하기 위해 좋은 객체 지향 원리들을 하나씩 코드에 적용하면서 문제를 해결해나갑니다. 이 과정속에서 여러분은 자연스럽게 코드로 좋은 객체지향의 원리(SOLID)와 IoC, DI에 대해서 이해하고, 또 스프링 컨테이너가 왜 필요한지 깨달을 수 있습니다.\n스프링의 핵심 원리를 단순히 이론적으로 이해하는 것이 아니라, 예제 애플리케이션을 직접 코드로 개발하는 과정 속에서 자연스럽게 이해하게 됩니다.\n강의 목차\n1. 객체 지향 설계와 스프링\n2. 스프링 핵심 원리 이해1 - 예제 만들기\n3. 스프링 핵심 원리 이해2 - 객체 지향 원리 적용\n4. 스프링 컨테이너와 스프링 빈\n5. 싱글톤 컨테이너\n6. 컴포넌트 스캔\n7. 의존관계 자동 주입\n8. 빈 생명주기 콜백\n9. 빈 스코프\n강의의 앞부분(1~3)은 이렇게 객체 지향과 스프링의 핵심 원리에 대해서 설명합니다. 그리고 이후 4. 스프링 컨테이너와 스프링 빈 부터는 스프링이 제공하는 핵심 기능들을 설명합니다. 각 핵심 기능들이 왜 만들어졌는지, 어디에 왜 필요한지, 그리고 가장 중요한 실무에서 어떤 방식으로 사용되는지, 이 부분에 초점을 맞추어 설명합니다.\n그래서 스프링의 기능을 단순히 사용하는 단계를 넘어서, 실무에서 어떻게 활용하는 게 좋은 방법인지 제대로 이해하고 사용할 수 있습니다.\n이 강의를 듣고 나면\n이 강의는 단순히 스프링 레퍼런스 문서에 있는 기능을 하나하나 설명하는 강의가 아닙니다. 기능을 넘어서 왜 스프링을 만들었고, 왜 스프링이 이런 기능을 제공하는지 그 이유와 핵심 원리에 대해서 설명하는 강의입니다.\n강의가 끝나면 여러분은 스프링의 기본 기능을 잘 사용하는 것은 물론이고, 스프링의 본질에 대해서 깊이있는 이해를 하게 됩니다. 스프링의 본질을 이해한다는 것은 객체 지향 설계의 본질을 이해하는 것과 같습니다. 따라서 단순히 스프링의 기능만 사용하는 개발자에서 객체 지향 애플리케이션의 설계와 아키텍처 레벨까지 고민하는 개발자로 성장할 수 있습니다.\n강의 대상\n    스프링을 처음\n접하는 개발자\n스프링 핵심 원리를\n이해하고픈 개발자\n객체지향 설계가\n고민인 개발자\n김영한 스프링 입문\n수강생\n스프링 핵심 원리 강의는 스프링을 처음 접하는 개발자부터, 실무에서 스프링을 사용하지만 스프링의 핵심 원리를 제대로 이해하고 사용하고 싶은 개발자 분들을 위해서 준비했습니다. 그리고 객체지향 설계에 고민이 많은 개발자 분들에게도 도움이 됩니다.\n앞으로 이어질\n스프링 완전 정복 시리즈\n스프링을 완전히 마스터할 수 있는 시리즈를 준비하고 있습니다. 실제 실무에서 사용하는 핵심 스프링 기능을 중심으로, 실무에서 쓰이지 않거나 오래된 기능은 과감하게 생략한 실무 노하우를 전수해드릴 예정입니다.\n강의 순서\n스프링 입문 - 코드로 배우는 스프링 부트, 웹 MVC, DB 접근 기술 \n스프링 핵심 원리 - 기본편  현재 강의 \n모든 개발자를 위한 HTTP 웹 기본 지식 \n스프링 MVC 1편 - 백엔드 웹 개발 핵심 기술\n스프링 MVC 2편 - 백엔드 웹 개발 활용 기술\n스프링 DB 1편 - 데이터 접근 핵심 원리\n스프링 DB 2편 - 데이터 접근 활용 기술\n스프링 핵심 원리 - 고급편\n실전! 스프링 부트   출시 예정    \n관련 로드맵\n스프링 완전 정복 시리즈 \n스프링 똑똑하게 시작하기,\n핵심 원리부터 실전 활용   이 강의 포함 \n  스프링 부트 + JPA 실무 완전 정복 \n최신 실무 기술로 웹 앱을\n만들며 학습하고 싶다면  실전 심화 단계 \n지식공유자가 알려주는\n강의 수강 꿀팁!\n🎓\n이런 분들께\n추천드려요!\n스프링을 처음 접하는 개발자\n개발자 취업 준비생\n스프링을 코드로 쉽게 이해하고 싶은 개발자\n스프링을 공부했지만 어려워서 포기했던 개발자\n실무에서 스프링을 사용하지만 스프링의 핵심 원리를 제대로 이해하고 사용하고 싶은 개발자\n📚\n선수 지식,\n필요한가요?\n자바 언어",
      "lectureDifficulty": "초급자"
    }
  },
  {
    "model": "lectures.lecture",
    "fields": {
      "thumbnail": "https://cdn.inflearn.com/public/course-325637-cover/d5fd6216-71d1-490e-8759-594cbbdc1973",
      "lectureTitle": "[리뉴얼] React로 NodeBird SNS 만들기\n대시보드",
      "lectureFee": 88000,
      "lectureDescription": "중급자를 위해 준비한\n[웹 개발, 프론트엔드] 강의입니다.\n리액트 & 넥스트 & 리덕스 & 리덕스사가 & 익스프레스 스택으로 트위터와 유사한 SNS 서비스를 만들어봅니다. 끝으로 검색엔진 최적화 후 AWS에 배포합니다.\n✍️\n이런 걸\n배워요!\n리액트 개발\n리덕스&리덕스 사가\n리액트 Hooks 사용\nStyled Components\nAnt Design\nSWR\n서버 사이드 렌더링\n검색 엔진 최적화\nAWS 배포\n새로 만나는 제로초의 리액트 노드버드 프로젝트!\n리뉴얼된 사항\nnext@9, styled-components@5, next-redux-wrapper@5, node.js@14 등의 최신 버전을 다룹니다.\n최근 업데이트로 인해서 SSR 연동 방법이 어려워졌는데 그 부분이 어려우시다면 들으시면 됩니다. 또한 https를 적용할 때 greenlock-express 대신 nginx+letsencrypt(certbot-auto) 조합으로 합니다.\n당부의 말씀\n작년에 많은 수강생분들이 이 강좌를 들어주셨습니다. 감사합니다. 다만 드리고 싶은 말씀이 하나 있습니다. 단순히 강의를 눈으로 본다고 해서 풀스택 개발자 되지 않습니다(그것은 욕심입니다). 직접 따라서 치시고, 발생하는 에러들을 해결하고, 강좌에는 없는 기능을 만들어보면서 나오는 기술을 자기 것으로 만들어야 합니다.\n이 강좌는 실제로 6개월 이상이 걸리는 커리큘럼을 20시간 가까이 이어서 보여드리는 것입니다. HTML, CSS, JS, Node, MySQL, AWS 모두 최소 1달 이상을 투자해야 어느 정도 소화할 수 있습니다. 따라서 강좌는 20시간 분량이더라도 별도의 공부가 필요합니다.\n제로초의 React로 배우는\n20시간 풀스택 강좌!\n▲ NodeBird SNS 만들기\n트위터와 비슷한(이라고 쓰고 짝퉁이라 읽는다) 제로초의 시그니처 프로젝트 NodeBird SNS를 만들어보며, 서비스 구현부터 배포까지 모두 배워봐요.\nNext.js(SSR) + React Hooks + Redux + Redux saga + Ant Design + Styled Components + Node + Express + Sequelize(MySQL)를 배웁니다.\n검색엔진 최적화와 AWS 배포(간단하게 EC2 + Lambda + S3 + Route53 사용)는 보너스!\n직접 만들어보세요!\n로그인, 게시글 작성, 좋아요\n이미지 업로드, 댓글, 리트윗\n  인피니트 스크롤링, 팔로우, 언팔로우\n  해시태그 검색, 유저 프로필\n  질문에 빠르게\n대답해 드립니다.\n제 강좌의 장점은 Q&A입니다. 질문하시면 하루 안에 답변드려요.\n강좌 관련 내용을 자유롭게 질문하시면서 능동적으로 공부해 보세요.\n내용을 이해하기에 더 도움이 될 거예요!\n지식공유자를 소개합니다.\n제로초 블로그 및\n유튜브 채널 운영\n웹개발 베스트셀러\n<Node.js 교과서> 저자\n주식회사 오늘의픽업\nCTO\n연관 강의\n웹 게임을 만들며 배우는 React\n무료로 웹 게임을 통해 리액트를 배워봅니다.\n프론트를 중점으로 다루고 백엔드는 부가적인 역할을 합니다.\n[리뉴얼] Node.js 교과서 - 기본부터 프로젝트 실습까지\n노드에 대한 핵심 개념을 익힌 후,\n실전 예제를 통해 실무에 뛰어들 준비를 갖춥니다.\nVue로 Nodebird SNS 만들기\nVue로 만드는 풀스택 SNS 강좌!\n지식공유자가 알려주는\n강의 수강 꿀팁!\n🎓\n이런 분들께\n추천드려요!\n리액트 Hooks나 Next같이 리액트를 응용하고 싶은 분\n풀스택 개발에 관심있는 분\n프론트엔드 개발자 지망생\nNext9버전의 변경점이 궁금하신 분.\n📚\n선수 지식,\n필요한가요?\nHTML, CSS 지식\n자바스크립트 최신 문법 지식\n제로초의 리액트 무료 강좌 시청",
      "lectureDifficulty": "중급자"
    }
  },
  {
    "model": "lectures.lecture",
    "fields": {
      "thumbnail": "https://cdn.inflearn.com/public/courses/325392/course_cover/a4af3e8d-c9ad-4ebd-9104-5f52f8758542/boanproject-ios-eng.png",
      "lectureTitle": "해커를 위한 iOS 앱 모의 해킹 전문 과정\n대시보드",
      "lectureFee": 198000,
      "lectureDescription": "초급자를 위해 준비한\n[보안] 강의입니다.\n모의해킹 실무에서 iOS 모바일 앱 모의해킹은 이제 필수입니다! iOS 앱 진단을 처음 접하는 분들을 위한 기초 강의입니다. 진단에 필요한 기초적인 선수지식부터 모의해킹 업무에서 다루는 실무 중심 실습으로 구성하였습니다.\n✍️\n이런 걸\n배워요!\n모바일 앱 모의해킹 방법\niOS 앱 모바일 보안\niOS 앱 해킹\niOS 모바일 앱 모의해킹 기초부터 간단한 실무 실습까지!\n[강의 소개]\niOS 모바일 앱 모의해킹을 처음 접하는 분들을 위한 기초 강의입니다. 진단에 필요한 기초적인 선수지식부터 모의해킹 업무에서 다루는 실무 중심 실습으로 구성하였습니다.\n강의를 천천히 따라오신다면 iOS 모바일 앱 모의해킹 기초는 충분히 다질 수 있다고 생각합니다. 참고로, 기초 강의로 제작되었기 때문에 실무에서 모의해킹 업무를 하고 계신 분들에게는 적합하지 않을 수 있습니다.\n      [학습 목표]\niOS 모바일 앱 모의해킹에 대한 두려움을 없애는 것이 이 강의의 목표입니다. 강의를 듣는다고 iOS 모바일 앱 진단에 대한 모든 것을 완벽하게 소화할 수는 없습니다. 지속해서 기술이 발전하고 그에 따른 진단 기법과 우회 기법도 나날이 발전하기 때문입니다. 여러분들이 이 강의를 통해 기술이 발전하더라도 필요할 때마다 찾아 공부할 수 있는 기초 기반을 다질 수 있게 하는 것이 제 목표입니다.\n    [도움 되는 분들]\n• 모의해킹 모의해킹 컨설팅/실무자로 진로를 선택한 분들\n• iOS 모바일 앱 모의해킹에 입문하고 싶으신 분들\n• 실무에서 iOS 모바일 진단이 당장 필요한 분\n    [준비물]\n• 실습은 윈도우 환경과 Jailbreak(탈옥)가능한 아이폰에서 진행됩니다.\n• 강의에서 진행하는 아이폰은 iPhone 6 (iOS 12.4.X) 입니다.\n• 준비물에 대한 자세한 내용은 오리엔테이션 강의 참고 부탁드립니다.\n    [강사 소개]\n보안프로젝트(www.boanproject.com) 김태영 팀장\n다년간 모의해킹, 콘텐츠 개발, 저술 프로젝트 참여\n  [강의 이력]\n• 한세 사이버 보안 고등학교 사이버가디언스 (오프라인)\n• 프리다(Frida)를 이용한 안드로이드 앱 모의해킹 심화 과정 (온라인, 오프라인)\n• 안드로이드 앱 취약점 진단 (오프라인)\n• 웹 애플리케이션 버그 바운티 특강 (오프라인)\n• 장애 청년 대상 IT보안 강의\n• 버그헌팅 스터디/프로젝트 운영\n  [저술 경력]\n• 프리다(Frida)를 이용한 안드로이드 앱 모의해킹\n• Metasploitable3 환경을 이용한 모의해킹 분석 이해[1부, 2부]\n• Nmap NSE 스크립트를 이용한 모의해킹 활용편 - 모의해킹 시리즈 12\n  [버그 바운티 포상 경력]\n• Naver Bug Bounty Program 2020 제보(심사 중)\n• Naver Bug Bounty Program 2019 포상\n• 리디 버그 바운티 2020 제보(심사 중)\n• 리디 버그 바운티 2019 포상\n• KISA&NAVER S/W 신규 취약점 제보 2019 1분기 포상\n• KISA&NAVER S/W 신규 취약점 제보 2018 4분기 포상\n• KISA&NAVER S/W 신규 취약점 제보 2018 3분기 포상\n• Hack the KISA 대회 2018 포상\n  지식공유자가 알려주는\n강의 수강 꿀팁!\n🎓\n이런 분들께\n추천드려요!\n모의해킹 취업을 준비하는 분\niOS 모바일 해킹이 궁금한 분\niOS 모바일 진단을 실무에 적용할 분\n📚\n선수 지식,\n필요한가요?\n모바일 서비스 이해\niOS 앱 환경 이해\n모의해킹에 대한 관심",
      "lectureDifficulty": "초급자"
    }
  },
  {
    "model": "lectures.lecture",
    "fields": {
      "thumbnail": "https://cdn.inflearn.com/public/courses/325241/course_cover/b706da64-1414-407f-9466-7da4b875e49d/byj-excel-data.jpg",
      "lectureTitle": "진짜 현업에서 쓰이는 직장인의 실무 엑셀 - 데이터 가공부터 분석까지\n대시보드",
      "lectureFee": 84700,
      "lectureDescription": "중급자를 위해 준비한\n[오피스, 데이터 분석] 강의입니다.\n현재 엑셀의 가장 트렌디한 방법으로 데이터를 효율적, 과학적으로 가공, 분석함에 '표준'이 되는 과정입니다.\n✍️\n이런 걸\n배워요!\n1. 파워쿼리로 데이터 가공\n2. 가장 핫한 방법을 사용하여 피벗으로 분석, 시각화\n3. 회귀분석으로 데이터의 미래를 예측하는 프로세스\n4. 데이터의 최적의 값을 찾는 과학적 방법\nVlookup보다 훨씬 쉽고 정교한 데이터 가공 전문 툴\n“파워쿼리” 배워서 일잘러가 되어보세요!\n\n예전에 쓰던 엑셀과 요즘 엑셀의 차이점, 알고 계신가요? 기존에는 데이터를 조인할 때, 복붙 노가다를 하거나 Vlookup을 쓰는 경우가 대부분이었죠. 하지만 데이터가 많으면 버벅거리는 등 사용에 불편함이 많았어요. 이를 보완하기 위해 요즘 엑셀에는 데이터 추출 전문 기능인 파워쿼리가 추가되었습니다. \n    1   파워쿼리란?\n\n기존에 MS의 액세스(Access)에서 사용되던 데이터 추출 기능인 ‘쿼리’를 엑셀에서 사용할 수 있도록 만든 기능이 바로 ‘파워쿼리’입니다. 간단히 말하자면, 노가다와 VBA 중간 포지션에 위치한, 웬만한 데이터 가공을 다 할 수 있는 데이터 가공 전문 툴이라고 할 수 있죠.\n \n리본메뉴 > 개발도구(옵션-리본사용자지정-개발도구..체크) > 엑셀 추가기능 > 분석도구, 해찾기 체크박스에 체크하는 것만으로 전문 통계분석 툴에서 할 수 있는 거의 대부분의 전문 분석 기능을 범용적인 엑셀 프로그램에서 사용 할 수 있어요. 물론 결과값도 똑같습니다.\n전문 분석 기능을 쉽게 사용 할 수 있는 파워쿼리, 제대로 배워보고 싶지 않으신가요?\n    2   파워쿼리가 효율적이고 좋은 이유!\n1. 매달 데이터 집계 후 보고를 해야 할 때, 특정 폴더 안에 들어있는 수많은 엑셀 파일들의 데이터들을 하나로 취합하는 선작업이 필요합니다. 이때 기존 엑셀과 최신 엑셀은 아래와 같은 차이가 나요.\n기존 엑셀\n파워쿼리(최신 엑셀)\n\n- 파일 취합, 시트 취합 기능 없음\n- 노가다(복,붙) 또는 VBA 코딩으로 문제 해결\n - 파워쿼리를 메뉴로 제공하므로\n    클릭만 하면 파일 통합, 시트 통합을 한 방에 해결\n - 원본 데이터가 바뀌는 경우,\n   ‘새로고침’ 버튼만 눌러주면 자동으로 업데이트\n\n\n2. 현업에서 Vlookup 함수로 데이터들을 조인하는 작업을 많이 하지요.\n     이때 기존 엑셀과 요즘 엑셀은 아래와 같은 차이가 납니다.\n기존 엑셀\n파워쿼리(최신 엑셀)\n\n- 현업에서 많이 사용하는 Vlookup 함수를\n   사용할  때, 데이터들이 많으면 처리 속도 떨어짐\n- 연결된 원본 데이터가 이동되거나 소실되면\n   Vlookup 함수에 설정된 파일 에러 발생\n\n - 메뉴 클릭으로 데이터 조인이 순삭 이뤄지며\n    연결된 원본 데이터의 이동과 소실에 대응할      수 있는 메뉴 제공\n\n3. 이 외에도 웹데이터를 깔끔하게 가져올 수 있으며, 함수 사용없이 텍스트 추출 가능,\n     데이터의 정형화, 피벗테이블의 단점 보완 등, 복잡한 데이터 가공을 쉽게 할 수 있습니다.\n    3   이 강의만의 강점\n현재 엑셀의 가장 트렌디한  데이터 가공, 분석 스킬 제시!\n지금까지 미래의 데이터 값 예측은 전문 통계분석툴을(SAS, R, MINITAP..) 사용할 줄 아는 한정된 사람에게만 가능한 분야라고 다들 생각했습니다. 왜냐하면, 엑셀 파워유저들도 엑셀에 이런 기능이 있는 줄은 알지만 통계학을 기반으로 설계된 기능이다 보니 기본 통계지식이 있어야 이 결과값을 해석할 수 있는데 일반 유저들이 기본적 통계지식을 가지고 있는 경우가 거의 없기 때문입니다.\n이 과정은 엑셀의 통계학에 기반을 둔 '분석' 기능을 유연하게 실무에 적용할 수 있도록 기본 통계지식을 알려주고, 실무 예제를 통해 쉽게 이해하고 적용할 수 있도록 도와줍니다.\n    4   이 강의에서 배울 수 있는 것\n  Business Intelligence Platform으로서의 엑셀이 자랑하는 파워쿼리로 현업의 정형, 비정형화되어 있는 데이터들을 가공하는 방법을 학습합니다.\n\n슬라이서, 피벗테이블 연결 기능, 조건부 서식을 활용하여, 집계된 피벗을 멋지게 시각화하고 약간의 vba 코드로 자동으로 피벗테이블을 Refresh 합니다.\n\n통계 모델에 바탕을 두고 설계된 엑셀의 통계 분석 기능 중, 기술 통계법으로 데이터의 속성을 한 눈에 파악하고, 회귀 분석으로 데이터의 과학적인 미래 예측합니다. 학습을 통해 통계 기본지식을 쉽게 익혀, 보고서를 과학적으로 쓸 수 있습니다.\n\n데이터의 최적의 조합을 찾는 방법을 쉽게 이해하고 실무에 적용할 수 있습니다. 해찾기 기능을 통해, 비즈니스 세계에서 유한한 자원을 가지고 최적의 데이터의 조합을 찾아봅니다.\n지식공유자가 알려주는\n강의 수강 꿀팁!\n🎓\n이런 분들께\n추천드려요!\n1. 노가다와 vba가 아닌, 좀 더 쉽고, 과학적인 방법으로 데이터를 가공하는 방법을 찾는 분\n2. 파워쿼리의 다양한 실무 케이스를 학습하고자 하는 분\n3. 엑셀로 고급분석이 가능하다던데, 어디까지? 또는 얼마만큼 그 결과에 대해 신뢰할 수 있을지 고민하는 분\n4. 엑셀 데이터 분석의 끝판왕을 보고 싶은 분\n📚\n선수 지식,\n필요한가요?\n엑셀 초급",
      "lectureDifficulty": "중급자"
    }
  },
  {
    "model": "lectures.lecture",
    "fields": {
      "thumbnail": "https://cdn.inflearn.com/public/courses/324858/cover/ea79a3dc-c1e5-488e-b750-1cbf75c55234",
      "lectureTitle": "15일간의 빅데이터 파일럿 프로젝트\n대시보드",
      "lectureFee": 132000,
      "lectureDescription": "초급자를 위해 준비한\n[데이터 분석, 데이터 사이언스] 강의입니다.\n\"빅데이터+AI 풀스택 개발\" - AI에 생명력을 불어 넣는 빅데이터 구축 과정을 파일럿 프로젝트 형식으로 진행합니다. 요구사항을 파악해 단계별로 플랫폼을 구성하고, 스마트카 데이터 탐색과 분석을 수행 합니다.\n✍️\n이런 걸\n배워요!\n입문자/초보자도 따라만 하면 빅데이터•AI 프로젝트를 완성\n빅데이터•AI 프로젝트의 분석>설계>개발>적용 과정을 이해\n대용량 + 실시간 데이터를 처리하면서 분석에 활용하는 방법\n스마트카 미니 프로젝트로 빅데이터~AI로의 가치 창출 과정\n오픈소스를 프로젝트에 적용하고 아키텍처를 구성하는 방법\n15일에 끝장내는 빅데이터+AI 학습!\n실전 프로젝트로 재밌게 만들어보세요.\n4차 산업혁명의 핵심기술\n빅데이터와 AI를 모두 이해한다!\n이 강의는 빅데이터와 AI의 기술 장벽을 넘기 위한 하나의 훈련 도구로 쓰이길 바라며 시작합니다. 특히 대규모 인프라에서 동작하는 복잡한 분산 소프트웨어와 분석 기법이 만들어낸 빅데이터/AI 구현 기술과 동작 원리에 좀 더 비중을 두고 있습니다.\n우리 일상에서 이미 흔하게 볼 수 있는 스마트카를 예로 들어볼까요? 똑똑한 스마트카 안에 있는 전장 기술은 주행 거리부터 운행 패턴, 위치나 속도 등 차량과 운전자의 상태를 모니터링하는 다양한 IoT 센서들로 수많은 데이터를 만들어내고 있습니다. 이 정보가 보험이나 마케팅, 광고, 자동차, 교통 등 다양한 비즈니스 분야로 활용되고, 그렇게 활용된 정보는 다시 운전자에게로 전달되죠.\n이렇듯 빅데이터 기술은 어느덧 우리의 삶에서 빠트릴 수 없는 필연적인 요소로 자리를 잡았습니다. 하지만 방대한 데이터의 양만큼이나 빅데이터 기술은 어렵고 막연하게만 느껴지죠. 그런데 누구나 약간의 기술만으로 빅데이터 및 AI 기술을 연동하고, 가치를 창출할 수 있다면 어떨까요?\n숲과 나무를 동시에 보는\n빅데이터 시스템의 모든 것!\n이 강의에서는 빅데이터 시스템을 구축하는 데 필요한 실무 요건들을 도출하고, 이를 해결하기 위한 빅데이터의 핵심 기술 요소들을 설명합니다. 뒤이어 가상의 스마트카 파일럿 프로젝트를 통해 실전과 같은 빅데이터 및 AI 시스템을 구축하고 활용하는 방법을 경험하게 됩니다.\n누구라도 좋습니다! 데이터를 수집하고, 적재하고, 탐색하고, 분석하는 네 가지 단계를 거쳐 머신러닝/딥러닝으로 이어지는 인사이트와 가치를 창출해보세요. 이번 강의를 통해 이제 막 빅데이터 분야에 뛰어든 IT 전문가들이 빅데이터의 숲과 나무를 동시에 볼 수 있는 통찰력을 기를 수 있기를 바랍니다.\n스마트카 파일럿 프로젝트로 \n쉽고 빠른 실전 학습.\n가상의 스마트카 파일럿 프로젝트로 ‘수집 → 적재 → 탐색 → 분석’ 의 네 단계를 직접 따라해 보면서 실전과 같은 빅데이터 및 AI 시스템을 구축해 봅니다. 20여 종의 오픈소스 + 하둡(Hadoop) 에코시스템을 이용한 프로젝트를 통해 빅데이터와 AI 원리를 한층 더 쉽게 이해하고, 실전에 빠르게 적응할 수 있도록 돕습니다.\n15일간의 파일럿 프로젝트로 \n개념과 실전을 동시에.\n프로젝트 일정은 총 15일+α 로, 빅데이터에 대한 기본적인 개념을 이해한 뒤 시스템 구축에 필요한 파일럿 프로젝트의 전 단계를 직접 실습을 통해 따라할 수 있도록 구성되어 있습니다. \n누가 배우면 좋을까요?\n  빅데이터 학습을\n시작한 학생/취준생\nAI, 빅데이터 기술\n적용해볼 개발자\n데이터 활용/분석을\n고민하는 기획자\n빅데이터 관심있는\n누구나 OK\n학생, 취업 준비생, 개발자/엔지니어, 분석가, 기획자 등등 빅데이터와 AI 기술, 오픈소스 및 아키텍처링을 통한 프로젝트를 준비하는 분들이라면 간단한 SW 지식만 가지고 프로젝트의 처음부터 끝까지 도전할 수 있도록 구성했습니다.\n복잡한 빅데이터+AI 환경\n커뮤니케이션과 협업 역량이 매우 중요.\n다양한 이해관계자의 역할과 포지션을 직접 경험 함으로써, 실전 현장에서 빠르게 적응하며 좋은 성과로 이어질수 있도록 도움을 드립니다.\n학습을 위한 필수 요구 환경. (아래 저사양 or 고사양 수준의 PC 1대)\n※ 실습 PC 환경 - 참고해주세요!\n- 18GB 분량 실습자료와 2대의 가상서버 제공\n- 버추얼박스 기반으로 가상머신 서버환경 구성\n- 실습 시작전 메모리와 디스크의 여유공간 확보\n지식공유자의 저서가\n궁금하다면?\n『실무로 배우는 빅데이터 기술』 (위키북스, 개정2판)\n2017년 초판 이후 현재 개정 2판까지 출판된 빅데이터 학습 서적 『실무로 배우는 빅데이터 기술: 데이터 수집, 적재, 처리 분석, 머신러닝까지』를 집필했습니다. (위키북스, 2020, 책 소개 바로가기)\n지식공유자가 알려주는\n강의 수강 꿀팁!\n🎓\n이런 분들께\n추천드려요!\n빅데이터/AI 분야의 실전과 같은 프로젝트 경험이 필요한 분들\n빅데이터/AI의 숲과 나무를 동시에 보는 통찰력이 필요한 분들\n빅데이터/AI의 기술장벽을 넘기 위한 훈련 도구가 필요한 분들\n아키텍트로 성장하기 위해 오픈소스 활용 역량이 필요한 분들\n📚\n선수 지식,\n필요한가요?\nprint(\"Hello World!\") 코드를 이해\n간단한 리눅스 명령어를 Copy & Paste",
      "lectureDifficulty": "초급자"
    }
  }
]